{
    "text": "The U.S. Justice Department and more than a dozen states filed a blockbuster antitrust lawsuit against Apple on Thursday, accusing the giant company of illegally monopolizing the smartphone market.\n\nIt’s the largest in a recent string of Big Tech companies to face antitrust complaints from the U.S. government, which is cracking down on the massive industry, whose power has gone largely unchecked over the past several decades.\n\nThe complaint, said Attorney General Merrick Garland at a news conference, alleges that ”Apple has maintained monopoly power in the smartphone market not simply by staying ahead of the competition on the merits but by violating federal antitrust law.”\n\n“Consumers should not have to pay higher prices because companies break the law,” he added.\n\nThe long-anticipated lawsuit, which was filed in the US District Court for the District of New Jersey, comes after years of allegations by critics that Apple has harmed competition with restrictive app store terms, high fees and its “walled-garden” approach to its hardware and software: Apple famously makes its tech easy to use, but it achieves that by tightly controlling – and in some cases, restricting – how third-party companies can interact with the tech behemoth’s products and services. In some cases, Apple may give its own products better access and features than its competitors.\n\nThe company said it denied the lawsuit’s allegations and would fight them and added that the lawsuit could empower government “to take a heavy hand in designing people’s technology.”\n\nBut Garland on Thursday said Apple’s actions have wide-ranging effects.\n\n“Monopolies like Apple’s threaten the free and fair markets upon which our economy is based. They stifle innovation. They hurt producers and workers and increase cost for consumers,” Garland said Thursday.\n\n“If left unchallenged, Apple will only continue to strengthen its smartphone monopoly. But there’s a law for that,” he added.\n\nFor example, Apple allows iPhone customers to send high-quality photos and videos seamlessly to one another, but multimedia texts to Android phones are slower and grainy. The company late last year relented and agreed to improve the quality standard it uses to interact with Android phones via text message – but it still maintains those messages in green bubbles, creating a kind of class divide, critics argue.\n\nThe company also gives its own products the ability to access certain parts of its hardware that it restricts other companies from using. That unleashes an almost magical experience for how iPhones interact with AirTags, when competitors’ products are far more limited in their capabilities.\n\n“Apple creates barriers that make it extremely difficult and expensive for both users and developers to venture outside the Apple ecosystem,” Garland said on Thursday.\n\n‘We will vigorously defend against it’\n\nThis year, European regulations forced Apple to give other companies access to the iPhone’s tap-to-pay hardware chip, enabling the creation of competing digital wallets. But those rules are limited to the European Union.\n\nAnd Apple maintains a 30 per cent commission on most sales through its app store – a frequent complaint from companies that try to sell subscriptions, saying Apple’s enormous share of the smartphone market forces them to pay what they argue is an unnecessarily high commission.\n\n“We believe this lawsuit is wrong on the facts and the law, and we will vigorously defend against it,” Apple said in a statement.\n\nThursday’s suit claims Apple has illegally monopolized smartphone markets by using a complex web of contractual terms that harm everything from text messaging to mobile payments. Among other things, the DOJ says, Apple has used its control over iOS, the iPhone operating system, to block innovative new apps and cloud streaming services from the public; degrade how Android messages appear on iPhones; restricted how competing smartwatches can work with iPhones; and hindered rival payment solutions.\n\nApple, in a statement, said the lawsuit would set a “dangerous precedent” and hinder its ability to make the compelling and consumer-friendly technology that have made the company one of the most valuable in the world.\n\n“At Apple, we innovate every day to make technology people love – designing products that work seamlessly together, protect people’s privacy and security, and create a magical experience for our users,” the company said in its statement. “This lawsuit threatens who we are and the principles that set Apple products apart in fiercely competitive markets.”\n\nYears of scrutiny\n\nApple has shrugged off legal challenges and criticism for years that its practices are anticompetitive. Its sterling consumer reputation and a disciplined public relations and legal strategy mirror the precision with which Apple manufactures and oversees its products.\n\nBut the Justice Department’s landmark suit challenges a broad range of Apple’s practices.\n\nThe case represents the Biden administration’s latest effort to hold a Big Tech giant accountable under U.S. antitrust law.\n\nApple was named in a sprawling House report in 2020 finding that the iPhone maker, along with Meta, Google and Amazon, hold “monopoly power.” Until Thursday, Apple was the only one of those tech companies the federal government had not yet sued for alleged antitrust violations.\n\nThe legal action could weigh on Apple’s stock price, which currently values the company at just under $3 trillion, and could force changes to policies, business strategies, products and applications by the tech giant. Even divestment of some assets is not out of the question for Apple, the tech company founded by Steve Jobs in the 1970s.\n\nApple’s (AAPL) stock fell 3 per cent Thursday. The lawsuit was widely anticipated.\n\nAlong with a pair of ongoing antitrust cases against Google, the DOJ lawsuit against Apple is likely to become a symbol of the Biden administration’s commitment to competition and lowering prices. It will also be a test of how far courts are willing to go to apply decades-old antitrust law to the modern digital economy.\n\nThe Apple case may be one of the most closely watched lawsuits brought by Jonathan Kanter, Biden’s top DOJ antitrust official. Kanter, who in private practice once represented rivals to Google including Microsoft and Yelp, is viewed as part of a fresh generation of regulators.\n\nAlong with his counterpart at the Federal Trade Commission, Lina Khan, Kanter has argued that the United States has for decades allowed a wave of corporate consolidation and anticompetitive practices that ultimately harmed the public through higher prices, fewer choices or reduced innovation.\n\nApps vs Apple\n\nTo solve Android phone customers’ “green bubble” issue, Eric Migicovsky, a tech entrepreneur, says an app he created, dubbed Beeper Mini, to help Android users message iPhone users without those limitations was quickly shut down by Apple.\n\n“It lasted for a total of three days before Apple started to take swings at us,” Migicovsky said. “Technologically, they worked very hard to take actions to penalize Beeper Mini users by knocking the connection offline or by making it progressively more unreliable.”\n\nThose kind of interactions have made Apple’s app store a focus of antitrust complaints.\n\nBeginning in 2020, Apple fought a highly public court battle against Epic Games, maker of the video game “Fortnite.”\n\nApple isn’t an illegal monopolist in distributing iOS apps, federal courts have decided in that case, highlighting the difficulty of pinning Apple down on federal antitrust charges. Apple did, however, get penalized for violating a California competition law and altered some of its app store practices in response to a court order.\n\nThose rulings highlight the challenges ahead for the Justice Department, which will need to bring a strong legal theory about how Apple has allegedly harmed competition, legal experts say. The DOJ would also need to prove that the benefits Apple has delivered to consumers don’t outweigh its alleged antitrust violations.\n\nEurope’s bite at Apple\n\nThe U.S. government isn’t the only one to pressure Apple to change its business practices. In March, a new European Union law took effect that forces Apple to make significant adjustments.\n\nIn a seismic move to comply with the EU’s Digital Markets Act (DMA), Apple said for the first time it would allow users in the trading bloc to download apps from third-party app stores.\n\nBut critics including Epic are already accusing Apple of violating the EU law. Just before the DMA took effect, Epic complained to competition authorities that Apple blocked it from launching its own app store on iOS. The European Commission is investigating.\n\nUpstart turned behemoth\n\nSince its early days, Apple has pursued a reputation as an elite, high-design brand. It’s often focused on a premium user experience and design aesthetic, setting its products apart from rivals such as Microsoft and Google. That limited approach worked for years, until a wave of complaints by app developers and consumers drew more attention to the potential downsides of Apple’s restrictiveness.\n\nIn the era led by founder Steve Jobs, “Apple was a cultural phenomenon that pitted wingtips against sandals; suits against t-shirts,” said James Bailey, a professor of leadership development at the George Washington University School of Business. “Apple relentlessly innovated. They were always steps ahead of the competition.”\n\nNow, however, Apple’s advances are more “incremental” than earth-shattering, Bailey added. “[CEO Tim] Cook has been focused on financial management and expanding market share.”\n\n“Apple’s financially healthy,” Bailey said, but their reputation for innovation is “dimming.”",
    "title": "Biden administration to sue Apple: sources",
    "date": "2024-03-21T16:42:00.000+02:00",
    "url": "https://www.ctvnews.ca/sci-tech/apple-sued-in-a-landmark-iphone-monopoly-lawsuit-1.6816389",
    "author": "@CTVNews"
}