{
    "text": "Newsatw.com is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.co.uk.“As an Amazon Associate, I earn from qualifying purchases.”\n\nFour years after the Covid-19 pandemic sent America into a standstill, President Joe Biden’s campaign is looking to co-opt a common question posed by former President Donald Trump and his allies: “Are you better off than you were four years ago?”\n\nTrump asked his 6.7 million followers on Truth Social that question earlier this week, using it to drive contrasts between Biden and Trump’s records on the economy and the border. But the Biden-Harris campaign plans to highlight key moments from four years ago in an effort to flip the question back onto Trump, seeing a golden opportunity to exploit his handling of the pandemic.\n\nThe Biden campaign made a statement Friday morning highlighting Trump’s pledge four years ago to the day to “terminate” the Affordable Care Act, roughly 10 days after the World Health Organization formally declared Covid-19 a global pandemic.\n\n“Four years ago today, Trump was trying to throw millions of Americans off their insurance while Americans were dying by the thousands of Covid-19, even more Americans were infected, and hospitals were reaching a breaking point,” Biden-Harris senior spokesperson Sarafina Chitika said in a statement.\n\nOn Thursday, the campaign released a digital ad that paired images from the early days of the Covid-19 pandemic with audio of Trump suggesting disinfectant as a treatment, downplaying concerns over the number of Covid-related deaths at the time and dismissing questions from reporters about his handling of the pandemic.\n\nAnd Biden is test-driving the strategy on the stump while speaking at fundraisers in Texas.\n\n“Just a few days ago, he asked the famous question, are you better off today than you were yesterday? Well, Donald, I’m glad you asked that question,” Biden said during a campaign reception in Houston on Thursday. (The Trump campaign did not respond to a request for comment.)\n\nBiden pointed to Trump’s handling of the pandemic and a debunked claim that Trump suggested the injection of bleach as a treatment option.\n\n“He must’ve done it,” Biden joked.\n\nIt comes amid a broader effort by Biden and his campaign to co-opt language made popular by Trump and Republicans.\n\nIn a bid to highlight that Biden held more campaign events this month than Trump, Biden’s campaign accused the former president of “hiding in his basement” — a line Trump and allies frequently deployed about Biden in 2020.\n\nThe campaign has also turned “Brandon” — a code word used by Republicans to insult Biden — into a kind of internet alter-ego and a core component of his social media branding, launching a “Dark Brandon” account on X and releasing several “Dark Brandon”-branded memes.\n\nA senior Biden-Harris campaign official told NBC News the campaign will continue to highlight “key moments from four years ago throughout the month of April.”\n\nThose moments will include headlines reminding voters of rising crime and toilet paper shortages toward the end of Trump’s first term and footage reminding voters of the “chaos” of the pandemic in 2020.\n\n“Americans remember March Madness, proms, weddings, and celebrations being canceled, waiting in line for toilet paper and essentials, businesses shutting down, and losing loved ones — all because Trump failed to prepare for and then couldn’t lead when we needed him the most,” “The only thing to happen four years ago to make Americans’ lives better was Donald Trump losing to Joe Biden,” Biden campaign spokesperson Ammar Moussa said.",
    "title": "Biden campaign fires Trump’s lines of attack back at him - NewsATW",
    "date": "2024-03-22T13:08:00.000+02:00",
    "url": "https://newsatw.com/biden-campaign-fires-trumps-lines-of-attack-back-at-him",
    "author": "admin"
}