{
    "text": "Advt\n\nAdvt\n\nJoin the community of 2M+ industry professionals Subscribe to our newsletter to get latest insights & analysis. Download ETAuto App Get Realtime updates\n\nSave your favourite articles Scan to download App\n\nPresident Joe Biden's administration announced Wednesday revised pollution standards for cars and trucks meant to accelerate the US auto industry's shift to electric to mitigate climate change.The rules set ambitious emission reductions for 2032 but are moderated compared with preliminary standards unveiled last April. Following carmaker criticism, the final rules give manufacturers greater flexibility and ease the benchmarks in the first three years. Environmental Protection Agency Administrator Michael Regan said the updated policy would lead to a future \"powered by cleaner energy\" leveraging \"American ingenuity and technology.\"Speaking against a backdrop that included electric vehicles (EVs) and an American flag, Regan was joined by environmental groups, a key auto industry lobby supporting the policy and an EPA colleague from the agency's environmental justice wing who emphasized improvements in air quality in largely non-white communities near heavy industry and highways.But the policy drew criticism from Republican Senate Minority Leader Mitch McConnell and the American Petroleum Institute, which threatened litigation to block changes that \"will unequivocally eliminate most new gas cars... from the US market in less than a decade.\"Biden's final tailpipe emission rules -- likely to be undone if Republican Donald Trump defeats Biden in November -- require a nearly 50% drop in fleet-wide emissions in 2032 compared with 2026 through increased sales of electric vehicles (EVs) and low-emission autos.The rules, which dovetail with other key Biden programs to incentivize EV sales and build more EV charging stations and manufacturing facilities, highlight environmental issues in November's election.Trump has mocked climate change as a problem and cast the transition to EVs as a job-killer that will benefit China at the expense of American workers.Biden argues that US auto builders need to take the lead in the expanding EV market.\"I brought together American automakers. I brought together American autoworkers,\" said Biden in a statement, touting \"historic progress.\"Alluding to his target set three years ago that 50% of new vehicles in 2030 would be EVs, Biden predicted,\"we'll meet my goal.\"- Industry given more time -EVs accounted for 7.6% in 2023 sales, up from 5.9% in 2022, according to Cox Automotive.The original proposal had envisioned the EV share surging to as much as 67% of new vehicle sales by 2032.Carmakers criticized the initial standards as overly-stringent. They cited the limited state of charging capacity in the United States, as well as difficulties in supply of metals and other raw materials for EV batteries.Regulators then decided to allow manufacturers a \"variety of pathways\" to reaching the standard, a senior Biden administration official said Tuesday.This path could include a mix of EVs, conventional but more fuel-efficient engines, and plug-in hybrid vehicles.Biden administration officials opted to soften year-to-year emissions improvements in the 2027-2030 period, while maintaining the same target in 2032.Moderating the targets in these first three years \"was the right call,\" said John Bozzella, president of the Alliance for Automotive Innovation, a Washington lobby representing carmakers, who appeared at Wednesday's event with Regan.\"These adjusted EV targets -- still a stretch goal -- should give the market and supply chains a chance to catch up,\" said Bozzella.- Litigation ahead? -The final standards set a fleet-wide target of 85 grams of carbon dioxide in 2032, down from 170 in 2027, according to an administration fact sheet.Wednesday's initiative won praise from the Sierra Club and NRDC, which said the new rules \"take us in the right direction.\"However, Dan Becker, director of the climate transport campaign at the Center for Biological Diversity, said \"the EPA caved to pressure from Big Auto, Big Oil and car dealers.\"The petroleum lobby was hardly happy with the final result.\"This regulation will make new gas-powered vehicles unavailable or prohibitively expensive for most Americans,\" said a statement from API and a trade group representing oil refineries, which vowed to mount a court challenge.jmb/sms",
    "title": "Biden Administration: Biden admin unveils strict auto standards to speed electric shift, ET Auto",
    "date": "2024-03-21T07:53:00.000+02:00",
    "url": "https://auto.economictimes.indiatimes.com/news/industry/biden-admin-unveils-strict-auto-standards-to-speed-electric-shift/108666961",
    "author": "www.ETAuto.com"
}