{
    "text": "United States President and Democrat Joe Biden’s re-election campaign had more than double the amount of cash on hand than his predecessor and Republican frontrunner Donald Trump ahead of the presidential election in November, new filings showed, on Wednesday (Mar 20).\n\nBiden overtakes Trump\n\nThe cash disparities between Trump and Biden were seen in the filings with the Federal Election Commission which required campaigns to file fundraising and spending reports for last month. However, the report only covers a part of the committees associated with those running for office.\n\nWATCH | US Elections 2024: Nikki Haley backer Harry Sloan to donate to Biden Biden at the end of February, had $71 million in cash available in his main campaign account which is more than double of Trump’s $33.5 million.\n\nThe filings show that the former president received more than $3 million in his campaign account in February, which added to the $30 million on hand in January.\n\nHowever, the incumbent president, which had $56 million by the end of January, added $15 million in February.\n\nWhile Trump is in the lead in more nationwide polls, Biden and the Democratic Party have a growing cash advantage.\n\nThe Democratic National Committee, according to the filing, had more than twice the cash on hand when compared to its Republican counterpart.\n\nHowever, the report does not show the entire picture since Biden and Trump are raising money through joint fundraising committees which will not file their reports until the end of next month.\n\nA Trump campaign official told CNN that their campaign and joint fundraising committee brought in $20.3 million in February and they entered this month with a combined $41.9 million cash.\n\nThe amount still trails behind Biden’s campaign which reported raising a combined $53 million in February across the committees supporting his re-election bid, with a combined total of a whopping $155 million.\n\nReasons behind the cash gap\n\nBiden, as the current president, reportedly has an advantage over Trump, who became the presumptive Republican nominee only in February.\n\nThe cash crunch has also reportedly prompted the former president to have meetings at his Mar-a-Lago club in Florida and even host private dinners with the Republican Party’s biggest financiers.\n\nThe former president’s lagging in terms of cash could also be attributed to his many legal woes as the filings also show the financial strain it is taking on his campaign. Trump is currently facing four criminal trials.\n\nAlso Read | Trump Tower among properties that could be seized to cover $454mn civil fraud fine\n\nThe financial disclosures of the group called Save America – which raises money together with Trump’s election campaign but is legally separate and reportedly used to underwrite his lawyers’ fees – showed that around $5.6 million was spent on legal bills in February.\n\nThe amount spent was the biggest single month of spending on legal bills since Trump formed the organisation in 2020 after his election defeat four years ago.\n\nThe filings also show that the group has spent more than $55 million on legal bills since the beginning of last year.",
    "title": "US presidential election 2024: Biden has massive cash advantage over Trump - World News",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.wionews.com/world/us-presidential-election-2024-biden-has-massive-cash-advantage-over-trump-702748",
    "author": "WION Web Team"
}