{
    "text": "Advertisement\n\nAdvertisement\n\nBiden’s campaign said over the weekend that it had raised more than $53 million in February.\n\nWashington:\n\nJoe Biden may be facing off against Donald Trump in the polls ahead of the US presidential election in November, but his numbers are looking good in one department: campaign finance.\n\nDemocrats are ahead of their Republican opponents in fundraising, while Trump is burning through legal fees as he navigates multiple criminal and civil cases.\n\nThe cash shortage has also given the 81-year-old Biden a new direction of attack on the campaign trail, as he mocked the self-proclaimed billionaire tycoon’s growing financial woes.\n\n“Just the other day, a guy who looked like a loser came up to me and said, ‘Mr. President, I need your help, I’m overwhelmed with debt, I’m totally broke,'” he said at a fundraiser Zhong said. Wednesday in Dallas, Texas.\n\n“Donald, I’m sorry, I can’t help you,” Biden said, drawing laughter and applause from supporters.\n\nBiden’s financial advantage could help soothe Democratic nerves as the nation’s oldest president suffers record-low approval ratings less than seven months into his rematch with Trump.\n\nDocuments filed with the Federal Election Commission on Wednesday showed that the Biden campaign had $71 million in cash on hand as of the end of February, more than double Trump’s $33.5 million in cash.\n\nIn February alone, the current president’s campaign raised $21.3 million, nearly double Trump’s $10.9 million. Meanwhile, Biden spent $6.3 million that month, but Trump spent more — $7.8 million.\n\nHowever, the numbers don’t give a complete picture of any individual candidate, as documents from their various fundraising committees aren’t due until April.\n\nBiden’s campaign said over the weekend that it had raised more than $53 million in February, for a “historic” total of $155 million, which it said was the most money raised by a Democratic Party at this stage of the election cycle.\n\n-“Dumpster Fire”-\n\nPerhaps Trump’s most worrying factor is his massive legal bills as he faces criminal cases, including ones seeking to overturn his 2020 election defeat and keep secret documents.\n\nLegal fees accounted for a whopping $5.6 million of Trump’s Save America PAC’s expenses in February — money that could have been spent on campaign events and television ads.\n\nThe figures add to Trump’s woes as he works to raise $464 million in bonds to appeal a fine imposed by a New York court for fraudulently inflating his wealth.\n\nThe 77-year-old now faces asset seizure, a humiliating blow to his carefully cultivated image as a dealmaker and self-made tycoon.\n\nTrump has called the fraud a “witch hunt” and, as usual, is trying to use the legal cases against him to inflame his supporters and get them to open their wallets.\n\n“I’m calling on one million Trump-supporting patriots to say: Stop the witch hunt against President Trump!” Wednesday’s campaign message said.\n\nThe message was titled “Keep your dirty hands away from Trump Tower,” his flagship New York property that could be at risk of a court case.\n\nEarlier this month, Trump successfully raised a separate bond of $91.6 million as he appealed sexual assault and defamation convictions in a lawsuit filed by New York writer E. Jean Carroll.\n\nBiden’s campaign described Trump’s finances as a “dumpster fire.”\n\n“Trump’s documents paint a bleak picture for the Republican Party,” Biden campaign spokesman Amal Moussa wrote Thursday.\n\nBut as the election approaches and Trump leads Biden in key battleground states in recent polls, Democrats will try to keep their war chest as deep as possible.\n\nBiden will join Barack Obama and Bill Clinton at a fundraiser in New York on March 28, the first such event to feature three Democratic presidents. One of the most profitable events in the party’s history.\n\nAccording to NBC News, the gala will raise $10 million for Biden’s campaign, and guests will have to pay $100,000 each to take photos with the 42nd, 44th and 46th President of the United States.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "title": "'Sorry, Donald': Biden mocks Trump's campaign cash lead",
    "date": "2024-03-21T18:08:00.000+02:00",
    "url": "https://www.thelocalreport.in/sorry-donald-biden-mocks-trumps-campaign-cash-lead",
    "author": "Pooja Sood"
}