{
    "text": "Left: House Oversight Committee Chairman James Comer (R., Ky.) speaks during a House Oversight and Accountability Committee hearing as part of the impeachment probe into President Biden, on Capitol Hill in Washington, D.C., March 20, 2024. Right: President Joe Biden speaks in Milwaukee, Wis., August 15, 2023.\n\nHouse Oversight Committee chairman James Comer (R., Ky.) will soon be inviting President Joe Biden to testify about his family’s business dealings for the House GOP’s impeachment inquiry.\n\nTwo of Hunter Biden’s former business partners, Tony Bobulinski and Jason Galanis, testified on Wednesday to discuss the president’s alleged role in his son’s foreign business enterprise. At the end of the hearing Comer announced his plans to invite President Biden to testify himself.\n\n“In the coming days, I will invite President Biden to the House Oversight Committee to provide his testimony and explain why his family received tens of millions of dollars from foreign companies with his assistance,” Comer announced. He did not specify whether he would issue a subpoena to the White House to compel testimony from Joe Biden.\n\nWhite House spokesman Ian Sams mocked Comer’s announcement as a “stunt” and dismissed the impeachment inquiry.\n\nHunter Biden did not attend the hearing on Wednesday after previously having demanded that House Republicans allow him to testify publicly. His attorney, Abbe Lowell, told Comer last week that his client would not appear for the public hearing because it was designed to be a media circus. Devon Archer, a former Biden business partner and key witness in the impeachment inquiry, also declined to show up for the public hearing.\n\nIn closed-door testimony last month, Hunter Biden confirmed that his father met foreign business partners and spoke to business associates on speakerphone, corroborating significant portions of Archer’s and Bobulinski’s testimony. Nonetheless, he repeatedly insisted that Joe Biden played no role in his business dealings.\n\nJoe Biden himself has repeatedly denied having had any involvement with Hunter Biden’s overseas dealings. The White House has disparaged and dismissed the impeachment inquiry on numerous occasions.\n\nThe extent of Joe Biden’s involvement in his son’s business enterprise during and after his vice presidency is the focus of the House GOP’s impeachment inquiry into President Biden. Evidence gathered by the impeachment inquiry includes bank records, witness testimony, texts, emails, images, and other documents relevant to the investigation. Republican investigators have scrutinized Hunter Biden’s business dealings with individuals and entities in Ukraine, China, Russia, Romania, and Kazakhstan.\n\nAt the hearing, Bobulinski suggested that Joe Biden committed various crimes by assisting his son with his business dealings and voiced his support for impeaching the president. Most Notably, Bobulinski accused Hunter Biden and his uncle Jim of lying under oath about their business dealings with Chinese conglomerate CEFC.\n\nSimilarly, Galanis claimed that Hunter Biden had used his father to help close lucrative business deals and mentioned how Hunter leveraged the “Biden lift,” a term used by Galanis to describe access to Joe Biden.\n\nSpecial counsel David Weiss is prosecuting Hunter Biden for alleged federal gun and tax crimes committed in Delaware and California. Lowell claimed that Hunter Biden’s court date in California on Thursday conflicted with the timing of the hearing.\n\nMore on National Review\n\nNews Related",
    "title": "Comer Says He Will Invite Joe Biden to Testify about Biden-Family Business Dealings",
    "date": "2024-03-22T00:05:00.000+02:00",
    "url": "https://newsexplorer.net/comer-says-he-will-invite-joe-biden-to-testify-about-biden-family-business-dealings-s2008364.html",
    "author": "VNExplorer"
}