{
    "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nFIRST ON FOX: Former President Trump's campaign heavily criticized the Biden administration's newly finalized regulations targeting gas-powered cars on Wednesday, vowing to overturn the action.\n\nIn a statement to Fox News Digital, the Trump campaign said the climate regulations — unveiled by the White House and the Environmental Protection Agency (EPA) on Wednesday — would force Americans to buy expensive electric vehicles (EV) and reduce consumer choice. The campaign further vowed that Trump would immediately strike down the regulations if he bests President Biden in their election rematch later this year.\n\n\"Joe Biden's extreme electric vehicle mandate will force Americans to buy ultra-expensive cars they do not want and cannot afford while destroying the U.S. auto industry in the process,\" Trump campaign national press secretary Karoline Leavitt told Fox News Digital in a statement. \"This radical policy is anti-jobs, anti-consumer and anti-American.\"\n\n\"It will destroy the livelihoods of countless U.S. autoworkers while sending the U.S. auto industry to China. President Trump will reverse Joe Biden's extreme electric vehicle mandate on Day One.\"\n\nVULNERABLE HOUSE DEM BUCKS PARTY ORTHODOXY, BLASTING HIS STATE'S PROPOSED EV MANDATE\n\nThe statement comes months after Trump took aim at the Biden administration's climate agenda over its impact on blue-collar rank-and-file autoworkers. During the United Auto Workers strike last year, the former president said the best interests of American workers were his \"number one concern,\" and that a forced EV transition would destroy the U.S. auto industry.\n\nVIRGINIA DEMOCRATS UPHOLD STATE'S EV MANDATE DESPITE GROWING OPPOSITION: 'DEFY COMMON SENSE'\n\nMeanwhile, under the regulations unveiled Wednesday, the federal government will enforce the most stringent tailpipe emissions restrictions ever finalized beginning with model year 2027 light-duty and medium-duty vehicles. Those regulations are slated to progressively ramp up through 2032, forcing most new car purchases to be battery electric and plug-in hybrid within that time frame.\n\nIn one \"low cost\" model EPA outlined in the rule, administration officials said automakers would be forced to ensure 56% of light-duty car sales are battery electric and another 13% are hybrid by 2032, meaning nearly 70% of new cars would be zero-emissions or low-emissions by then.\n\n\"Three years ago, I set an ambitious target: that half of all new cars and trucks sold in 2030 would be zero-emission,\" Biden said in a statement after the regulations were posted Wednesday.\n\n\"I brought together American automakers. I brought together American autoworkers,\" he said. \"Together, we’ve made historic progress. Hundreds of new expanded factories across the country. Hundreds of billions in private investment and thousands of good-paying union jobs. And we’ll meet my goal for 2030 and race forward in the years ahead.\"\n\n130+ HOUSE, SENATE REPUBLICANS JOIN FORCES IN OPPOSITION OF BIDEN'S UPCOMING EV MANDATE\n\nThe EPA regulations, though, were immediately blasted by the energy industry, farm groups, consumer advocates and Republican lawmakers who vowed to pursue legislation aimed at overturning the rules.\n\nAccording to the Alliance for Automotive Innovation, an association that represents major automakers, 9.3% of total car purchases in the U.S. last year were electric or plug-in hybrids — up from 7% in 2022. That uptick was driven largely by purchases in California and urban areas where the majority of EV purchases are made.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAt the same time, EVs remain far more expensive than traditional, gas-powered cars. Even factoring in generous federal and state subsidies, the average cost of an EV is about $52,500, while the average subcompact car costs $24,000.\n\nThe White House did not immediately respond to a request for comment when contacted by Fox News Digital.",
    "title": "Trump campaign responds in force after Biden cracks down on gas cars, vows 'Day One' reversal | Fox News",
    "date": "2024-03-20T20:45:00.000+02:00",
    "url": "https://www.foxnews.com/politics/trump-campaign-responds-in-force-after-biden-cracks-down-gas-cars-vows-day-one-action",
    "author": "Thomas Catenacci"
}