{
    "text": "Donald Trump knows the value of a historical rewrite.\n\nFor two decades, Trump has pitched and re-pitched versions of his own story that seriously revised some of the facts we all knew about him.\n\nLong before he was a one-term president, Trump was a New York real estate developer and casino operator known for being brash – and often bankrupt.\n\nThen came \"The Apprentice,\" NBC's \"alleged\" reality television show that incongruously cast Trump in 2004 as a business whiz who could do no wrong, a profitable role that helped save him financially and then propel him to the presidency.\n\nTrump is still at it, rewriting history as quick as he can make it.\n\nTrump has go-to lies he tells on repeat for the sake of his followers\n\nConsider his speech Saturday in Dayton, Ohio, when Trump pushed his three favorite lies as historical rewrites: The 2020 election he lost was \"rigged,\" we were all better off four years ago with him as president, and the goons who attacked the Capitol at his urging on Jan. 6, 2021, are really \"patriots\" who have done no wrong.\n\nWhy does Trump tell these lies? Because he knows they work, at least with his existing supporters. A USA TODAY/Suffolk University Poll in January found that two-thirds of Trump voters don't trust the 2020 election results and many were softening their views on the rioters who attacked the Capitol.\n\n'Bloodbath' if Trump loses?Trump's threat wasn't even the most dangerous thing he said all weekend\n\nA salute to the Jan. 6 'patriots'\n\nTrump opened Saturday's speech with his \"patriots\" so let's start there. He took to the stage and saluted as an announcer asked the crowd to stand \"for the horribly and unfairly treated Jan. 6 hostages.\"\n\nWhat followed was a now standard Trump rally recording of \"Justice For All,\" sung by a choir of defendants detained on Jan. 6 rioting charges, singing \"The Star-Spangled Banner,\" with verses interspersed with Trump reciting lines from the Pledge of Allegiance.\n\nTrump told the crowd the \"hostages\" have been \"treated terribly and very unfairly\" and vowed to do something about that if he wins in November. But then he made it all about himself.\n\n\"You fight an election and they end up indicting you because you fought a crooked election,\" Trump complained, before circling back to that point nearly an hour into his speech, claiming, \"I'm being indicted for you.\"\n\nHere's the truth: Tens of thousands of people attended Trump's Jan. 6 rally and some of the them marched to the Capitol. Many were peaceful. Others fought with police, smashed windows and stole government property.\n\nLet the election begin.Biden must win back 2020 voters. Trump only cares about MAGA.\n\nThe U.S. Department of Justice reports that more than 1,300 people have been charged from nearly all 50 states. The roster of sentences runs 94 pages long and is filled with people who received probation, home detention or prison terms of a few days or weeks.\n\nAbout a third of those defendants earned longer terms by assaulting or impeding law enforcement.\n\nIf you consider yourself a law-and-order kind of person who also considers these people \"hostages,\" then you are not, in fact, a law-and-order kind of person.\n\nTrump is still claiming 2020 was 'rigged' – and claims he'll stop 2024 from being stolen, too\n\nFor Trump, 2024 was always going to be about 2020.\n\nThe news outlet Axios prompted some serious social media skepticism two weeks ago with a report, citing unnamed Trump top advisers, saying that he was shifting away from talking about old grievances like the 2020 election and focusing more on 2024 issues like the economy. It was hard to imagine Trump dropping that talk.\n\nAnd he didn't. His speech Saturday with all the old gripes, especially the results of the 2020 election.\n\n\"The radical left Democrats rigged the presidential election in 2020, and we're not going to allow them to rig the presidential election in 2024,\" Trump said. \"Not going to allow it to happen.\"\n\nYou know what else isn't going to happen? Trump won't – even can't – stop talking about it. His loss is an affront to his ego, which runs his every move. He will never, ever let that go.\n\nBut I understand why his campaign staff wants him to. The same USA TODAY/Suffolk University Poll in January that found his supporters agree with him about 2020 also found that other voters see it as bunk. For Biden supporters, 98% say he was elected fairly while 82% of voters considering third-party candidates agree.\n\nTrump's litany of grievance sells with his supporters. But it can also drive away the independent and undecided voters who know it is nonsense. Presidencies are won by building coalitions, not pushing voters away.\n\nTrump and dictators:Republicans clapped when 'coolest dictator' defended Trump. Somehow that makes sense.\n\nTrump's obsession with 2020 will overwhelm his efforts this year. He just can't cope with a loss.\n\nHere's the truth: Trump had many chances in court in 2020 to make his case about the conduct of election. His sweeping public claims were backed by nothing of substance in those cases. He whiffed.\n\nTrump says we were better off four years ago, when COVID tore through the world\n\nTrump started Monday with his oddest form of historical rewrite, a post on his social media site that said in predictable all capital letters, \"ARE YOU BETTER OFF THAN YOU WERE FOUR YEARS AGO?\"\n\nThe headlines four years ago Monday were that COVID-19 had spread to all 50 states, and that Trump's White House was pushing for checks to be sent to all Americans to deal with the impending economic impact of the epidemic, including a spike in unemployment and plunging stock prices on Wall Street.\n\nAlso, an NPR/\"PBS NewsHour\"/Marist poll found that 60% of Americans didn't trust what Trump was saying then about the epidemic.\n\nFacebook's \"memories\" app will undoubtedly show you this week what you were up to four years ago. Chances are, it will remind you of a time when everything shifted in your life. My Facebook page just showed me a post I put up about working from home for a few weeks. That turned into nearly two years.\n\nTrump, speaking to his faithful followers Saturday, said his success from four years ago was the reason he's their nominee again for president.\n\n\"Because you love the job I did for four years,\" he said. \"You want to get back to the best economy that we've ever had.\"\n\nA USA TODAY/Suffolk County University Poll from last week found voters trust Trump to handle the economy slightly more than Biden, 40% to 38%, but that some see an economic rebound in the works.\n\nHere's the truth: Trump had a healthy economy with low inflation and rising wages, right up until it smashed into the epidemic. He likes to skip over the part where, in the fourth year of his presidency, everything took a nosedive.\n\nWho can blame him? All politicians play to their strengths and pooh-pooh the negative. But that's an easier sell in the primaries when they're talking to likely supporters. That's all over. We're in the general election now, even if Nov. 5 is still 33 weeks away.\n\nBiden and his campaign seize on every historical rewrite Trump offers because they know there's a big pool of voters out there who remember the shock of the country shutting down in March 2020, the tanking economy that followed, and the stark video of Capitol violence on Jan. 6, 2021.\n\nTrump's campaign wants him to move on. But he can't. And Biden potentially benefits with every rewrite.\n\nFollow USA TODAY elections columnist Chris Brennan on X, formerly known as Twitter: @ByChrisBrennan",
    "title": "Trump spews same lies during election rallies. Will 2024 voters care?",
    "date": "2024-03-20T10:04:00.000+02:00",
    "url": "https://www.usatoday.com/story/opinion/columnist/2024/03/20/trump-repeats-lies-2024-election-voters/73018393007",
    "author": ", USA TODAY"
}