{
    "text": "Committee Chairman James Comer said he would invite Biden to testify.\n\nAfter nearly eight hours of contentious testimony, Oversight Committee Chairman James Comer gaveled Wednesday's impeachment hearing out of session – but not before announcing his intention to call President Joe Biden to testify about his alleged involvement in his family's business endeavors.\n\n\"In the coming days, I will invite President Biden to the Oversight Committee to provide his testimony and explain why his family received tens of millions of dollars from foreign companies with his assistance,\" Comer said in a closing statement. \"We need to hear from the president himself.\"\n\nThe hearing – perhaps as expected – retreaded over well-worn allegations of Biden family impropriety by House Republicans, while Democrats sought to cast the probe as a political hit job with no merits.\n\n\"The Bidens don't sell a product or service or set of skills,\" Comer said in his opening statement. \"The Bidens sell Joe Biden. That is their business.\"\n\n\"With any luck, today marks the end of perhaps the most spectacular failure in the history of Congressional investigations, the effort to find a high crime or misdemeanor committed by Joe Biden and then to impeach him for it,\" said Rep. Jamie Raskin, the ranking Democrat on the Oversight Committee.\n\nHunter Biden, son of US President Joe Biden, and attorney Abbe Lowell arrive for a closed-door deposition with the House Oversight and Judiciary committees on Capitol Hill in Washington, DC, February 28, 2024. Roberto Schmidt/AFP via Getty Images\n\nTony Bobulinski and Jason Galanis, both former associates of Hunter Biden, testified during the hearing. Bobulinski was in the hearing room. Galanis participated via Zoom from the Alabama prison where he is serving a 14-year prison sentence for securities fraud.\n\nBobulinski faced withering criticism from Democrats and clashed with lawmakers on multiple occasions.\n\nRep. Alexandria Ocasio-Cortez had a particular contentious back-and-forth with Bobulinski over his claim that he witnessed the president commit a crime.\n\n\"Corruption statutes, RICO and conspiracy, FARA,\" Bobulinski said, naming the alleged crimes he witnessed.\n\n\"And what is it? What is? What is the crime, sir?\" Ocasio-Cortez asked, noting that RICO is not a crime.\n\nHouse Oversight Committee Chairman James Comer adjusts his microphone before a House Oversight and Accountability Committee hearing as part of the House of Republicans' impeachment probe into President Joe Biden, on Capitol Hill in Washington, D.C., on March 20, 2024. Amanda Andrade-Rhoades/Reuters\n\nComer had publicly invited Bobulinski and Galanis to appear alongside Hunter Biden and another witness in the probe, Devon Archer. Hunter Biden and Archer declined the invite.\n\nDemocrats called as their witness Lev Parnas, a onetime Rudy Giuliani associate-turned critic of the impeachment allegations.\n\nIan Sams, the White House spokesperson for oversight and investigations, called the hearing \"embarrassing\" in a statement to ABC News.\n\n\"That hearing was embarrassing for House Republicans,\" he said. \"A total waste of time. It's time to move on from this sad charade. There are real issues the American people want us to address.\"",
    "title": "Hunter Biden associates to testify in House impeachment hearing - ABC News",
    "date": "2024-03-20T02:00:00.000+02:00",
    "url": "https://abcnews.go.com/Politics/hunter-biden-associates-testify-house-impeachment-hearing/story?id=108306965",
    "author": "Lucien Bruggeman"
}