{
    "text": "Will the Biden Impeachment Inquiry Bear Fruit Today?\n\nMarch 20, 2024 | Tags: LIBERTY DAILY\n\nDepending on who you ask, today is either the beginning of the end for the Biden Crime Family’s influence peddling business or it’s Kabuki Theater for Republicans to pretend they’re finally getting tough with Hunter Biden, Uncle James, and Daddy Joe.\n\nWitnesses will be trotted out before the House Oversight Committee. These witnesses will support the contention by House Republicans that the Biden Crime Family got paid for doing nothing other than dishing out political favors from then-VP Joe Biden. It will be crystal clear to anyone who’s paying attention that Joe was the product the family was selling. Hunter, James, and their cohorts offered nothing else of value in exchange for a whole lot of money from the highest bidders.\n\nUnfortunately, this will likely bear no real fruit other than score some political points in an election year. That’s it. Neither Hunter nor James are going to jail. The man in the Oval Office will not be removed until either voters take him out in November or Barack Obama replaces him with another puppet before the election.\n\nConservative media will be aflutter. Corporate media will be bouncing back and forth between debunking and ignoring claims by witnesses and Committee members. Social media will trade clips of “bombshells.” But at the end of the day, nothing of substance will happen.\n\nSuch is the way in Washington DC. Depending on who’s in power at the time, Democrats will either act to destroy the nation or Republicans will talk about taking action after the upcoming election. They always delay until the next election. That’s the UniParty Swamp.\n\nHere’s the writeup of Wednesday’s happenings generated from corporate media reports….\n\nIn a “groundbreaking” development, former business associates of Hunter Biden are set to testify publicly on Capitol Hill this Wednesday. This marks the beginning of the next phase in the impeachment inquiry against President Biden, as congressional Republicans take the lead.\n\nHouse Oversight Committee Chairman James Comer is expected to open the hearing by shedding light on a year-long investigation that has unearthed no credible evidence of the Bidens providing any work product. Furthermore, investigators have not identified any legitimate value or documents to support the Bidens’ business partnerships.\n\nComer will emphasize that the Bidens’ work methodology deviates from traditional norms. They do not function as consultants, lawyers, or advisors; nor do they sell products, services, or skill sets. Instead, the Bidens’ primary asset is Joe Biden himself.\n\nComer will assert that Joe Biden has consistently taken actions to further his family’s wealth accumulation. He will describe the alleged scam as a simple one: the Bidens promise to resolve foreign partners’ issues by leveraging the U.S. government. This process has been repeated multiple times, with Joe Biden’s power being invoked, subsequently resulting in millions of dollars flowing into the Bidens’ pockets.\n\nTony Bobulinski, a U.S. Navy veteran, will testify publicly during a joint hearing of the House Oversight and Judiciary committees on Wednesday morning. Jason Galanis, serving a 14-year prison sentence for securities fraud, will also provide testimony, albeit virtually from a minimum-security prison in Alabama.\n\nDemocrats have invited Lev Parnas, a former associate of former Trump attorney Rudy Giuliani, to testify publicly as well.\n\nComer, in announcing the hearing earlier this month, extended an invitation to Hunter Biden to testify publicly, fulfilling the first son’s repeated requests. However, through his attorney, Abbe Lowell, Hunter Biden rejected the invitation, dismissing the hearing as a “carnival side show.”\n\nComer also invited Hunter Biden’s former associate, Devon Archer, who is not expected to attend. Comer claims to have “called Hunter Biden’s bluff” by offering a public hearing after the committee had deposed him, as per standard procedure for all witnesses.\n\nDuring Hunter Biden’s deposition last month, he maintained that his father was never involved in or benefited from his business dealings. The committee also heard testimony from James Biden, the president’s younger brother, who shared the same sentiment.\n\nHunter Biden did admit to putting his father on speakerphone with business associates and inviting him to business lunches. Archer had previously testified that Hunter Biden put his father on speakerphone at least 20 times with business associates.\n\nWithout Hunter and Archer, the hearing will feature Bobulinski, who worked with Hunter Biden to create SinoHawk Holdings, a joint venture with Chinese energy company CEFC. Bobulinski testified behind closed doors that he personally met with Joe Biden for more than 45 minutes in 2017.\n\nBobulinski also testified that Joe Biden “enabled” his son Hunter to sell access to the U.S.’s “most dangerous adversaries,” including the Chinese Communist Party, Russia, and others.\n\nGalanis’ testimony will also focus on whether Joe Biden was involved in the businesses he worked on with Hunter Biden. Galanis, who was interviewed by congressional investigators last month, testified that Joe Biden was considering joining the board of a joint venture created by Hunter Biden and his business associates with ties to the Chinese Communist Party after he left the vice presidency.\n\nGalanis also mentioned that the phrase “lean in” was used by Devon and Hunter Biden to signify access to Vice President Biden’s political influence.\n\nDemocrats have criticized the impeachment investigation as “hopeless,” with Rep. Jamie Raskin, D-Md., the top Democrat on the Oversight Committee, stating that it originated from lies told by an indicted liar in close proximity to Russian agents.\n\nIt’s always the Russians.\n\nThe post Will the Biden Impeachment Inquiry Bear Fruit Today? appeared first on 🔔 The Liberty Daily.\n\n\n\nRead More...",
    "title": "Will the Biden Impeachment Inquiry Bear Fruit Today?",
    "date": "2024-03-20T12:51:00.000+02:00",
    "url": "https://freedombunker.com/2024/03/20/will-the-biden-impeachment-inquiry-bear-fruit-today",
    "author": "Discern Reporter"
}