{
    "text": "Democratic presidential nominee Joe Biden brought his socialist agenda to Nevada and Arizona on Tuesday, touting false promises of affordable housing while attacking President Trump’s successful economic policies.\n\nBIDEN: “For too many people, the dream of having a good home is still feels out of reach.” FACT: The monthly mortgage payment on a median-priced home is double what it was when Biden took office and rent affordability is at its worst ever. pic.twitter.com/3TGrysWqhU — RNC Research (@RNCResearch) March 19, 2024\n\nDuring his campaign stops, Biden resorted to using Trump’s signature slogan, “Make America Great Again,” while promoting his radical ideas that would only drive our country further into chaos and debt.\n\nBiden is now using Trump’s “Make America Great Again” slogan. If you can’t beat’em join’em. pic.twitter.com/lso7luf6In — @amuse (@amuse) March 19, 2024\n\nInstead of acknowledging Trump’s record-breaking economy, Biden chose to spread fear and division, claiming that the American Dream of home ownership is now out of reach for too many people.\n\nBIDEN: “That black home was worth 20% less than the white home!” pic.twitter.com/VSSx5RyqHK — RNC Research (@RNCResearch) March 19, 2024\n\nBut the truth is that housing costs have risen because of Biden’s failed economic policies. His administration’s inaction on high-interest rates and the rising cost of living have made it difficult for working-class families to own a home. And yet, he has the audacity to blame President Trump for these issues.\n\nIn a desperate attempt to win over voters, Biden promised a $10,000 mortgage relief tax credit and a $10,000 tax credit for those selling their homes. But how does he plan to fund these handouts?\n\nOf course, Biden will increase taxes on hardworking Americans. It’s obvious his solution to every problem is to throw more money at it rather than implement sound economic policies that have proven successful under President Trump.\n\nBiden also called on real estate brokerages to “lower commissions,” conveniently ignoring that the National Association of Realtors agreed to resolve an antitrust lawsuit just last week.\n\nIn Arizona, Biden spoke at a Mexican restaurant in a blatant attempt to appeal to Latino voters. He knows that he needs their support if he wants to win battleground states, but his charm offensive can’t hide the fact that he flip-flopped on key issues, such as immigration and trade, to pander to his base.\n\nBiden is panicking as Trump’s approval ratings continue to rise. It seems many on both sides of the fence are not happy with Biden. Some left-wing voters have even launched an “Abandon Biden” movement, urging voters to support an obscure author in the Democratic primary.",
    "title": "Biden Gives Address While In Nevada",
    "date": "2024-03-20T17:46:00.000+02:00",
    "url": "https://redrightpatriot.com/bgawin",
    "author": "Rachel Stevenson"
}