{
    "text": "Young People Aren’t Nearly Angry Enough About Government Debt\n\nAuthored by The American Institute for Economic Research,\n\nYoung people sometimes seem to wake up in the morning in search of something to be outraged about. We are among the wealthiest and most educated humans in history. But we’re increasingly convinced that we’re worse off than our parents were, that the planet is in crisis, and that it’s probably not worth having kids.\n\nI’ll generalize here about my own cohort (people born after 1981 but before 2010), commonly referred to as Millennials and Gen Z, as that shorthand corresponds to survey and demographic data. Millennials and Gen Z have valid economic complaints, and the conditions of our young adulthood perceptibly weakened traditional bridges to economic independence. We graduated with record amounts of student debt after President Obama nationalized that lending. Housing prices doubled during our household formation years due to zoning impediments and chronic underbuilding. Young Americans say economic issues are important to us, and candidates are courting our votes by promising student debt relief and cheaper housing (which they will never be able to deliver).\n\nYoung people, in our idealism and our rational ignorance of the actual appropriations process, typically support more government intervention, more spending programs, and more of every other burden that has landed us in such untenable economic circumstances to begin with. Perhaps not coincidentally, young people who’ve spent the most years in the increasingly partisan bubble of higher education are also the most likely to favor expanded government programs as a “solution” to those complaints.\n\nIt’s Your Debt, Boomer\n\nWhat most young people don’t yet understand is that we are sacrificing our young adulthood and our financial security to pay for debts run up by Baby Boomers. Part of every Millennial and Gen-Z paycheck is payable to people the same age as the members of Congress currently milking this system and miring us further in debt.\n\nOur government spends more than it can extract from taxpayers. Social Security, which represents 20 percent of government spending, has run an annual deficit for 15 years. Last year Social Security alone overspent by $22.1 billion. To keep sending out checks to retirees, Social Security goes begging to the Treasury Department, and the Treasury borrows from the public by issuing bonds. Bonds allow investors (who are often also taxpayers) to pay for some retirees’ benefits now, and be paid back later. But investors only volunteer to lend Social Security the money it needs to cover its bills because the (younger) taxpayers will eventually repay the debt — with interest.\n\nIn other words, both Social Security and Medicare, along with various smaller federal entitlement programs, together comprising almost half of the federal budget, have been operating for a decade on the principle of “give us the money now, and stick the next generation with the check.” We saddle future generations with debt for present-day consumption.\n\nThe second largest item in the budget after Social Security is interest on the national debt — largely on Social Security and other entitlements that have already been spent. These mandatory benefits now consume three quarters of the federal budget: even Congress is not answerable for these programs. We never had the chance for our votes to impact that spending (not that older generations were much better represented) and it’s unclear if we ever will.\n\nYoung Americans probably don’t think much about the budget deficit (each year’s overspending) or the national debt (many years’ deficits put together, plus interest) much at all. And why should we? For our entire political memory, the federal government, as well as most of our state governments, have been steadily piling “public” debt upon our individual and collective heads. That’s just how it is. We are the frogs trying to make our way in the watery world as the temperature ticks imperceptibly higher. We have been swimming in debt forever, unaware that we’re being economically boiled alive.\n\nMillennials have somewhat modest non-mortgage debt of around $27,000 (some self-reports say twice that much), including car notes, student loans, and credit cards. But we each owe more than $100,000 as a share of the national debt. And we don’t even know it.\n\nWhen Millennials finally do have babies (and we are!) that infant born in 2024 will enter the world with a newly minted Social Security Number and $78,089 credit card bill for Granddad’s heart surgery and the interest on a benefit check that was mailed when her parents were in middle school.\n\nHeadlines and comments sections love to sneer at “snowflakes” who’ve just hit the “real world,” and can’t figure out how to make ends meet, but the kids are onto something. A full 15 percent of our earnings are confiscated to pay into retirement and healthcare programs that will be insolvent by the time we’re old enough to enjoy them. The Federal Reserve and government debt are eating the economy. The same interest rates that are pushing mortgages out of reach are driving up the cost of interest to maintain the debt going forward. As we learn to save and invest, our dollars are slowly devalued. We’re right to feel trapped.\n\nSure, if we’re alive and own a smartphone, we’re among the one percent of the wealthiest humans who’ve ever lived. Older generations could argue (persuasively!) that we have no idea what “poverty” is anymore. But with the state of government spending and debt…we are likely to find out.\n\nDespite being richer than Rockefeller, Millennials are right to say that the previous ways of building income security have been pushed out of reach. Our earning years are subsidizing not our own economic coming-of-age, but bank bailouts, wars abroad, and retirement and medical benefits for people who navigated a less-challenging wealth-building landscape.\n\nRedistribution goes both ways. Boomers are expected to pass on tens of trillions in unprecedented wealth to their children (if it isn’t eaten up by medical costs, despite heavy federal subsidies) and older generations’ financial support of the younger has had palpable lifting effects. Half of college costs are paid by families, and the trope of young people moving back home is only possible if mom and dad have the spare room and groceries to make that feasible.\n\nGovernment “help” during COVID-19 resulted in the worst inflation in 40 years, as the federal government spent $42,000 per citizen on “stimulus” efforts, right around a Millennial’s average salary at that time. An absurd amount of fraud was perpetrated in the stimulus to save an economy from the lockdown that nearly ruined it. Trillions in earmarked goodies were rubber stamped, carelessly added to young people’s growing bill. Government lenders deliberately removed fraud controls, fearing they couldn’t hand out $800 billion in young people’s future wages away fast enough. Important lessons were taught by those programs. The importance of self-sufficiency and the dignity of hard work weren’t top of the list.\n\nBoomer Benefits are Stagnating Hiring, Wages, and Investment for Young People\n\nEven if our workplace engagement suffered under government distortions, Millennials continue to work more hours than other generations and invest in side hustles and self employment at higher rates. Working hard and winning higher wages almost doesn’t matter, though, when our purchasing power is eaten from the other side. Buying power has dropped 20 percent in just five years. Life is $11,400/year more expensive than it was two years ago and deficit spending is the reason why.\n\nWe’re having trouble getting hired for what we’re worth, because it costs employers 30 percent more than just our wages to employ us. The federal tax code both requires and incentivizes our employers to transfer a bunch of what we earned directly to insurance companies and those same Boomer-busted federal benefits, via tax-deductible benefits and payroll taxes. And the regulatory compliance costs of ravenous bureaucratic state. The price paid by each employer to keep each employee continues to rise — but Congress says your boss has to give most of the increase to someone other than you.\n\nFederal spending programs that many people consider good government, including Social Security, Medicare, Medicaid, and health insurance for children (CHIP) aren’t a small amount of the federal budget. Government spends on these programs because people support and demand them, and because cutting those benefits would be a re-election death sentence. That’s why they call cutting Social Security the “third rail of politics.” If you touch those benefits, you die. Congress is held hostage by Baby Boomers who are running up the bill with no sign of slowing down.\n\nYoung people generally support Social Security and the public health insurance programs, even though a 2021 poll by Nationwide Financial found 47 percent of Millennials agree with the statement “I will not get a dime of the Social Security benefits I have earned.”\n\nIn the same survey, Millennials were the most likely of any generation to believe that Social Security benefits should be enough to live on as a sole income, and guessed the retirement age was 52 (it’s 67 for anyone born after 1959 — and that’s likely to rise). Young people are the most likely to see government guarantees as a valid way to live — even though we seem to understand that those promises aren’t guarantees at all.\n\nHealthcare costs tied to an aging population and wonderful-but-expensive growth in medical technologies and medications will balloon over the next few years, and so will the deficits in Boomer benefit programs. Newly developed obesity drugs alone are expected to add $13.6 billion to Medicare spending. By 2030, every single Baby Boomer will be 65, eligible for publicly funded healthcare.\n\nThe first Millennial will be eligible to claim Medicare (assuming the program exists and the qualifying age is still 65, both of which are improbable) in 2046. As it happens, that’s also the year that the Boomer benefits programs (which will then be bloated with Gen Xers) and the interest payments we’re incurring to provide those benefits now, are projected to consume 100 percent of federal tax revenue.\n\nGovernment spending is being transferred to bureaucrats and then to the beneficiaries of government spending who are, in some sense, your diabetic grandma who needs a Medicare-paid dialysis treatment, but in a much more immediate sense, are the insurance companies, pharma giants, and hospital corporations who wrote the healthcare legislation. Some percentage of every college graduate’s paycheck buys bullets that get fired at nothing and inflating the private investment portfolios of government contractors, with dubious, wasteful outcomes from the prison-industrial complex to the perpetual war machine.\n\nNo bank or nation in the world can lend the kind of money the American government needs to borrow to fulfill its obligations to citizens. Someone will have to bite the bullet. Even some of the co-authors of the current disaster are wrestling with the truth.\n\nForget avocado toast and streaming subscriptions. We’re already sensing it, but we haven’t yet seen it. Young people are not well-informed, and often actively misled, about what’s rotten in this economic system. But we are seeing the consequences on store shelves and mortgage contracts and we can sense disaster is coming. We’re about to get stuck with the bill.",
    "title": "Young People Aren't Nearly Angry Enough About Government Debt - Conservative Angle",
    "date": "2024-03-20T03:33:00.000+02:00",
    "url": "https://conservativeangle.com/young-people-arent-nearly-angry-enough-about-government-debt",
    "author": "EdJenner"
}