{
    "text": "Today, the House Committee on Oversight and Accountability held a hearing titled, “Influence Peddling: Examining Joe Biden’s Abuse of Public Office.” Witnesses included Biden family business associates Tony Bobulinski and Jason Galanis who testified that Joe Biden knew about, participated in, and enabled his family’s corrupt influence peddling schemes that made his family over $24 million. Congresswoman Lauren Boebert (CO-03) said, “Joe Biden has leveraged his elected position to enable the Biden family, their business associates, and their shell companies to receive over $24 million dollars from China and other entities. Biden is compromised and a threat to our national security. It is far past time Congress evict the resident in the White House and hold him accountable for selling out the American people.” Background Courtesy of the House Committee on Oversight and Accountability: Biden family business associates Tony Bobulinski and Jason Galanis testified under oath President Joe Biden actively participated in his family’s corrupt business dealings and acted as the closer for deals with Chinese and Russian entities. Mr. Tony Bobulinski, Biden family business associate: “Joe Biden was more than a participant in and beneficiary of his family’s business; he was an active, aware enabler who met with business associates such as myself to further the business, despite being buffered by a complex scheme to maintain plausible deniability.” Mr. Jason Galanis, Biden family business associate: “During the May 4th party, we were told to go to an area of the restaurant to gather because Hunter was going to call his father. Hunter called his father, said hello and ‘hold on, Pops,’ then put the call on speakerphone and said, ‘I am here with our friends I told you were coming to town, and we wanted to say hello.’ The Vice President said hello and some pleasantries […] and then seemed like he wanted to bring the call to an end by saying, ‘Ok then, you be good to my boy.’ Hunter responded by saying, ‘Everything is good, and we are moving ahead.’ The Vice President said something about ‘being helpful,’ and Hunter ended the call by saying that he was going to call his father later. […] A few days after this May 4th party, an email my lawyer provided to this committee shows that Devon had confirmed Ms. Baturina was committed to a ‘hard order’ of $10-20 million in a Burnham investment banking client.” The Bidens don’t sell a product or a service or a set of skills. President Joe Biden is “the brand” that the Biden family is selling for millions of dollars to those around the world willing to pay for it. Mr. Tony Bobulinski: “I want to be crystal clear: from my direct personal experience and what I have subsequently come to learn, it is clear to me that Joe Biden was ‘the Brand’ being sold by the Biden family. His family’s foreign influence peddling operation – from China to Ukraine and elsewhere – sold out to foreign actors who were seeking to gain influence and access to Joe Biden and the United States government. Mr. Jason Galanis: “The entire value-add of Hunter Biden to our business was his family name and his access to his father, Vice President Joe Biden.” House Oversight Committee Chairman James Comer (R-Ky.): “The scam is simple. It’s done over and over again. The Biden family promises Joe’s power, Joe Biden shows up, and millions of dollars come into the Bidens’ pockets. House Judiciary Committee Chairman Jim Jordan (R-Ohio): “Millions of dollars from foreign entities run through twenty different companies, for what? Devon Archer told us what it was for: Access to the brand. And the brand was Joe Biden. The brand that played rounds of golf, took calls and meetings, attended lunches and dinners with Hunter Biden and his business partners.” Hunter Biden failed to appear alongside his business associates today because his testimony would not withstand public scrutiny when held up against witness facts and evidence uncovered showing Joe Biden’s involvement in the business schemes. Hunter for months has requested a public hearing, but when offered one alongside his business associates, he failed to show up. Mr. Bobulinski: “How are the American people supposed to get the unvarnished facts and truth when the son and brother of Joe Biden are willing to perjure themselves to protect the family?” President Joe Biden continues to lie directly to the American people about the central role he played in his family’s corrupt influence peddling schemes. Mr. Tony Bobulinski: “Why is Joe Biden blatantly lying to the American people? Why has he not simply leveled with the American people about all of the meetings, phone calls, emails and handshakes he has had with the Biden family’s U.S. and foreign business partners, including players from some of America’s most challenging adversaries such as China and Russia, as well as Ukraine, Kazakhstan, Romania and others. If he were doing nothing wrong, why go through this insane exercise of obstructing and denying obvious facts?” The House Committee on Oversight and Accountability released a video exposing Joe Biden’s repeated lies about his family’s influence peddling business. The video uses new footage from recent transcribed interviews with key witnesses who testified today. ###",
    "title": "Boebert Blasts Biden Crime Family in House Impeachment Hearing",
    "date": "2024-03-21T04:14:00.000+02:00",
    "url": "https://boebert.house.gov/media/press-releases/boebert-blasts-biden-crime-family-house-impeachment-hearing",
    "author": "boebert.house.gov"
}