{
    "text": "Earlier this month, the Justice Department took the unusual step of moving to dismiss a $3.3 billion civil fraud lawsuit against Dish Network, after founders Charlie Ergen and his wife joined President Biden’s re-election campaign late last year. This comes just months after he donated more than $113,000.\n\nErgen, a former professional poker player who helped start the company then called EchoStar Communications in 1980, has been fighting federal fraud claims for nearly a decade.\n\nBut the Tennessee native donated $100,000 to Biden’s super PAC with his spouse, Candy, shortly after reaching the cap with a matching $6,600 contribution to the president’s primary campaign committee in December. , reported that he saw his luck change. Campaign finance declaration form.\n\nIn January of this year, Dish $50 million Government grants to support national expansion of 5G coveragebiggest prize” and the company has gushed about this kind of project through a $1.5 billion fund established by CHIPS and Science Law.\n\nDish Chairman Charlie Ergen has been fighting a civil fraud lawsuit for nearly a decade that could bankrupt the company. Reuters\n\nOn January 12, two days after the $50 million award was announced, Justice Department lawyers intervened on Dish’s behalf, calling Vermont Telephone, which had made fraudulent claims, “into an unethical settlement.” He threatened her and “tried to bully her.” Lead attorney Bennett Ross said the lawsuit will be dismissed.\n\nThe motion to dismiss the case reversed plans to dismiss the Ergens for their knowledge of the fraud scheme and led Vermont Telephone’s lawyers to accuse the Justice Department of political interference.\n\n“[I]”The effect, if not the purpose, of the Department of Justice’s hasty dismissal of this case appears to be to protect Mr. Ergen from questioning under oath,” Ross wrote in a letter to the Justice Department’s lead attorney in the case. I wrote this in a letter dated August 8th. , according to a copy seen by The Post.\n\n“It just so happens that Mr. Ergen, his wife (who is scheduled to be removed from office next week), and DISH’s political action committee have collectively donated more than $5 million to Democratic candidates and campaigns between 2008 and 2022. “I don’t think so,” he added.\n\n“As the election approaches, this case appears to be the latest example of the Justice Department’s two-tiered justice system, where wealthy and politically connected people are treated one way and everyone else is treated differently. ”\n\nThe government formally filed a motion to dismiss on March 8. Sentencing by D.C. Senior District Judge Colleen Koller Kotelly is pending.\n\nThe Justice Department’s Civil Division is objecting to the lawsuit being dismissed in 2022 and 2023, according to court filings, which say it is highly unusual to intervene in such fraud claims.\n\nThe Commerce Department gave Dish its “largest award” to date from the $1.5 billion fund created by the CHIPS and Science Act, one of the Biden administration’s most celebrated achievements. AP\n\n“As far as we know, the parties involved have filed approximately 4,000 complaints.” [similar] “Since 2018, the Department of Justice has filed dismissal claims in about 65 of the False Claims Act cases, less than 2% of the time,” Ross told the Post.\n\n“And in the cases the Justice Department has sought to dismiss, it has generally been based on fatal flaws in the case, which does not apply to Vermont Telephone’s claims against DISH.”\n\n“Given the paucity of evidence and the difficulty of proving damages, the government’s benefit in continuing the lawsuit is minimal. To the contrary, as a result of the extraordinary discovery, The costs to the government (and this court) will be high.”\n\nBy taking control of small businesses, Dish acquired an additional $3.3 billion in wireless licenses before the company offered cell phone service. Gary E. Dufour/Facebook\n\nThe dispute began in 2015, and according to previous FCC filings, Dish is considered a “very small business” (defined as a business with less than $15 million in revenue) by the Federal Communications Commission (FCC). $13.3 billion was bid for wireless licenses as part of an auction aimed at supporting the United States. report According to the Wall Street Journal.\n\nWith the help of asset management firm BlackRock, Dish has acquired nearly half of the wireless licenses (spectrum) sold at auction by small and medium-sized businesses (702 out of 1,600) in which Dish has a controlling interest and is eligible for a 25% discount. ).\n\nThis allowed Dish to make a $3.3 billion bid for spectrum in Boston, New York, and Chicago before the company offered cell phone service.\n\nAccording to a May 13, 2015 complaint, the Vermont Telephone Company sued Dish and its small businesses, Northstar Wireless and SNR Wireless, in U.S. District Court for the District of Columbia, accusing them of engaging in a “fraudulent bidding scheme.” vermont telephone company\n\n“Defendants shorted the government $3.3 billion, which remains unpaid to this day,” Ross said. “They also corrupted programs designed to benefit genuine small businesses, distorted the FCC auction process, and impeded the deployment of wireless spectrum for the public benefit. Defendants are held accountable.” You should.”\n\nThe FCC later dismissed these claims of fraud, but Dish did not receive the $3.3 billion in bidding credits it earned in the auction, which were returned to the pool to be auctioned later.\n\nA senior FCC official told the Post that the agency was “not in a position to determine whether it was fraud” at the time and was “hoping that this action would set the record straight.”\n\nHowever, the official said, “Dish has annual revenues of well over $10 billion, continues to be profitable, and receives FCC subsidies for companies with less than $50 million in revenue. We established a shell company for this purpose.”\n\n“It’s inconceivable that the Justice Department would try to dismiss it at the 11th hour without any intention.”\n\n“Dish has generated and continues to generate well over $10 billion in annual revenue, but it has created a shell company to receive FCC subsidies for companies with less than $50 million in revenue. established,” a senior FCC official told the Post. AP\n\nAs the lawsuit progresses, Dish has grown to become the fourth largest wireless network in the United States, thanks to acquisitions of carriers such as Sprint. In September 2023, Dish’s net worth was approximately $54 billion.\n\nDish has pledged to spend billions of dollars building out its 5G network, leaving its own wireless spectrum occupied at the same time its TV customers are hemorrhaging and putting its business in a precarious position. There is.\n\nspeculation swirled A person familiar with the matter said the station could file for bankruptcy this year after its acquisition by Echostar left it “cash-strapped,” and an unfavorable civil lawsuit could result in 60. It added that more than $1 billion in damages could be awarded.\n\nLast year, Ergen acknowledged on an earnings call that the “bond market is essentially closed” for the company, with its bonds trading at just 30 cents on the dollar. This indicates that investors think the company is unlikely to pay off its debt. Last year, he even flew to Dubai in hopes of collaborating with a Middle East sovereign wealth fund.\n\nOther sources said Ergen has been “very close to the White House” throughout Biden’s tenure, frequently “bragging” about his connections and even been seen coming in and out of FCC headquarters.\n\nSources told the Post that Ergen has been “very close to the White House” throughout Biden’s tenure, frequently “bragging” about his connections and frequenting FCC headquarters. It has also been seen there. AFP (via Getty Images)\n\n“Dish is very good at navigating the beltway,” said Roger Entner, founder of Recon Analytics. They have strong relationships on both sides of the aisle. ”\n\nMr. Ergen has donated most of his money to Democrats, but in recent years he has donated to more than a dozen people, including Sen. Ted Cruz of Texas, Sen. Marsha Blackburn of Tennessee and Sen. John Thune of South Dakota. He has also donated tens of thousands of dollars to several prominent Republicans. They all serve on the Commerce, Science, and Transportation Committee, which oversees the FCC.\n\nThe Dish boss has also worked with influential Republicans such as Sen. Chuck Grassley of Iowa and Sen. Mike Lee of Utah, who serve on the Senate Judiciary Committee and if they If someone wanted to investigate him or his business, it could make his life difficult.\n\nwhite house visitor record show Ergen met with Biden officials at least three times, including on Oct. 16, 2023, with Kurt Campbell, then deputy chief of staff and now chief of staff. Deputy Secretary of State.\n\nWhite House visitor records show the Dish founder has met with Biden officials at least three times, including on Oct. 16, 2023, with Kurt Campbell, then the president’s deputy chief of staff. is also included. AP\n\nThis month, Ergen also appointed He was sent to the Philippine Presidential Trade and Investment Mission after the White House announced a partnership with the Philippines. Expand access to 5G coverage Over a year ago.\n\ndespite having angered the FCC Ergen has been slow to develop radio, making it potentially important to the Biden-Harris administration. Modernization efforts This is thanks to Dish’s Open Radio Access Network (ORAN) technology.\n\n“ORAN provides them with what is considered a more affordable option because it separates software and hardware,” one source said. “We don’t have to rely on proprietary technology to provide nationwide service.”\n\n“That’s why Dish keeps going to the White House and telling everyone, ‘Listen, ORAN is the best thing since sliced ​​bread,'” the source said. added.\n\n“And, of course, that’s exactly what the Biden administration wants to hear and wants other countries to sing the same song. There is a partnership between the two.”\n\nIt’s unclear whether Mr. Ergen’s political connections are enough to provide a lifeline to his company.\n\nDish reported earlier this month that it lost customers and revenue declined in the final quarter of 2023. He also acknowledged in a filing with the Securities and Exchange Commission that he “expects to use significant amounts of cash” to repay debt, but cautioned that it was unclear how he would do so. He will pay the $1.98 billion debt he is due in November.\n\n“This raises significant doubts about our ability to continue as a going concern,” the filing acknowledges.\n\nJeff Blum, Echostar’s executive vice president of external and government affairs, told the Post in a statement that “fraud claims have always been frivolous, and the Justice Department’s attempt to dismiss them is That’s completely legitimate.”\n\n“First, the FCC thoroughly investigated the allegations and found no misrepresentations or wrongdoing by EchoStar or its business partners.The Department of Justice then gave VTel years to uncover evidence of fraud. “Blum said.\n\n“Despite tens of thousands of discovery documents and countless depositions, VTel has never been able to prove any wrongdoing. And last year, contrary to VTel’s claims that the government had fallen short, , the government itself said in sworn testimony that all payments were made in a timely manner. It was a deadline. ”\n\nBloom said the motion is a “desperate attempt by VTel and its attorneys to avoid having to pay millions of dollars in legal fees on this baseless lawsuit.” intends to pursue all legal remedies against the frivolous conduct of VTel and its lawyers.” Claim. “\n\n“It is a matter of record that Ecostar and Charlie Ergen have supported both Republicans and Democrats over the years,” Blum added about the donations. “As EchoStar builds the world’s largest Open RAN wireless network, we are working closely with policymakers on both sides to return U.S. leadership to carriers and create a true alternative to Chinese vendor dominance. We’ve provided options.”\n\nNeither the White House nor the Biden campaign responded to requests for comment. The Justice Department declined to comment on pending litigation.",
    "title": "DOJ moved to dismiss $3.3B fraud suit against Dish after chairman Charlie Ergen donated $113K to Biden - Total News",
    "date": "2024-03-22T16:05:00.000+02:00",
    "url": "http://totalnews.com/doj-moved-to-dismiss-3-3b-fraud-suit-against-dish-after-chairman-charlie-ergen-donated-113k-to-biden",
    "author": "@totalnewsinc"
}