{
    "text": "Pres. Joe Biden said Thursday $6 billion in student loans would be canceled for 78,000 borrowers. (Kevin Lamarque, Reuters)\n\nLeer en español Read in English\n\nEstimated read time: 1-2 minutes\n\nWASHINGTON — President Joe Biden announced Thursday that $6 billion in student loans would be canceled for 78,000 borrowers, bringing his administration's total student debt cancellation to nearly $150 billion.\n\nBiden pledged last year to find other avenues for tackling debt relief after the Supreme Court in June blocked his broader plan to cancel $430 billion in student loan debt.\n\nThe latest group includes public service workers, like teachers, nurses and firefighters, who qualify under the Public Service Loan Forgiveness Program created in 2007 to forgive student debt for Americans who go into public service.\n\n\"These public service workers have dedicated their careers to serving their communities, but because of past administrative failures, never got the relief they were entitled to under the law,\" Biden said in a statement.\n\nAs of June 2023, about 43.4 million U.S. student loan recipients had $1.63 trillion in outstanding loans, according to the Federal Student Aid website. Higher education debt has tripled since the 2008 financial crisis.\n\nSteep interest and hefty payments on these loans mean younger Americans struggle to buy homes or make other investments, and Democrats have pushed for U.S. government forgiveness for years. Republicans largely oppose such actions.\n\nBiden is seeking re-election in November and needs the youth vote to help him win.\n\n\"I won't back down from using every tool at my disposal to deliver student debt relief to more Americans, and build an economy from the middle out and bottom up,\" Biden said.\n\nA White House official said Biden's latest move brought the total amount of debt cancellation under the Biden administration to $144 billion for nearly 4 million Americans.\n\n×\n\nRelated stories\n\nMost recent Politics stories\n\nRelated topics Education Politics",
    "title": "Biden cancels $6B in student loan debt for 78,000 public service workers | KSL.com",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.ksl.com/article/50957232/biden-cancels-6b-in-student-loan-debt-for-78000-public-service-workers",
    "author": "Deseret Digital Media"
}