{
    "text": "President Biden’s reelection campaign is enlisting former President Obama and former Speaker Nancy Pelosi (D-Calif.) to help boost his health care record with voters ahead of November.\n\nTo mark the 14th anniversary of the Affordable Care Act (ACA) becoming law, Obama and Pelosi will join Biden during a virtual event on Saturday to mobilize supporters and volunteers, the campaign announced Wednesday.\n\nSaturday’s virtual rally will mark the start of events throughout the week across eight battleground states, including a wave of advertising and social media content.\n\nThe events show the Biden campaign is enthusiastically jumping into a fight with former President Trump over ObamaCare, after Trump has floated taking another run at repealing the law.\n\nBiden and Democrats have long felt health care is a winning issue for them, and the president has leaned into the pocketbook issue of lowering people’s costs amid broad concerns about the economy.\n\n“Donald Trump already tried to dismantle Obamacare once and throw millions off their health insurance – and he’s promising to try once again if he regains power,” Biden campaign communications director Michael Tyler said in a statement. “President Biden will not let that happen – under his leadership, insurance premiums and drug costs are lower, the price of insulin is capped, and in a second term, he’d continue protecting and expanding the ACA to cover more people and lower costs even more for families.”\n\nMore than 40 million people have health insurance through ObamaCare, and the law is more popular than ever. Nine red and purple states have expanded Medicaid since Republicans tried and failed to repeal the law in 2017 when Trump was president and Republicans controlled both chambers of Congress.\n\nThree GOP-led attempts to repeal the law through the courts have also failed, including one backed by then-President Trump in 2020.\n\nSince then, GOP members have largely conceded that an ObamaCare fight is a losing issue and have instead focused on issues like crime, immigration and the economy.\n\nJust In News | The Hill Read More\n\nLike this: Like Loading...",
    "title": "Biden campaign enlists Obama, Pelosi for ACA-focused virtual reelection rally",
    "date": "2024-03-20T23:44:00.000+02:00",
    "url": "https://themillennialpress.com/2024/03/20/biden-campaign-enlists-obama-pelosi-for-aca-focused-virtual-reelection-rally",
    "author": "@Milennial_con"
}