{
    "text": "Introduction\n\nIsrael has launched an invasion (October 7, 2023) of the Gaza Strip.\n\nAs outlined by Felicity Arbuthnot with foresight 10 years ago in a December, 30 2013 article:\n\n“Israel is set to become a major exporter of gas and some oil, “If All Goes to Plan”.\n\nIn the current context, Israel’s “All Goes to Plan” option consists in bypassing Palestine and “Wiping Gaza off the Map”, as well confiscating ALL Gaza’s maritime offshore gas reserves, worth billions of dollars.\n\nThe ultimate objective is not only to exclude Palestinians from their homeland, it consists in confiscating the multi-billion dollar Gaza offshore Natural Gas reserves, namely those pertaining to the BG (BG Group) in 1999, as well the Levant discoveries of 2013.\n\nUpdate. Israel’s Secret Intelligence Memorandum\n\nAn official “secret” memorandum authored by Israel’s Ministry of Intelligence “is recommending the forcible and permanent transfer of the Gaza Strip’s 2.2 million Palestinian residents to Egypt’s Sinai Peninsula”, namely to a refugee camp in Egyptian territory. There are indications of Israel-Egypt negotiations as well as consultations with the U.S.\n\nThe 10-page document, dated Oct. 13, 2023, bears the logo of the Intelligence Ministry … assesses three options regarding the future of the Palestinians in the Gaza Strip … It recommends a full population transfer as its preferred course of action. … The document, whose authenticity was confirmed by the ministry, has been translated into English in full here on +972. See below, click here or below to access complete document (10 pages)\n\nFirst published on October 22, 2023. Video added on October 27, 2023, Update, November 1, 2023\n\n***\n\nVideo: Michel Chossudovsky, Interview with Caroline Mailloux, Lux Media\n\nTo leave a comment and/or Access Rumble click to lower right hand corner\n\nReaders’ Thanks to Michel Chossudovsky\n\nFelicity Arbuthnot’s 2013 Analysis\n\n“The Giant Leviathan natural gas field, in the eastern Mediterranean, discovered in December 2010, widely described [by governments and media] as “off the coast of Israel.”\n\nThese Levant reserves must be distinguished from those discovered in Gaza in 1999 by British Gas, which belong to Palestine. Felicity Arbuthnot’s analysis nonetheless confirms that “Part of the Leviathan Gas fields lie in Gazan territorial waters” (See Map Below).\n\nWhilst Israel claims them as her very own treasure trove, only a fraction of the sea’s wealth lies in Israel’s bailiwick as maps. Much is still unexplored, but currently Palestine’s Gaza and the West Bank between them show the greatest discoveries… (Felicity Arbuthnot, 2013)\n\nFlash Forward to October 2023\n\nNetanyahu’s October 2023 declaration of war against 2.3 million people of the Gaza Strip is a continuation of its 2008-2009 invasion of Gaza under “Operation Cast Lead.”\n\nThe underlying objective is the outright military occupation of Gaza by Israel’s IDF forces and the expulsion of Palestinians from their homeland.\n\nI should however mention that there are powerful financial interests which stand to benefit from Israel’s criminal undertaking (Genocide) directed against Gaza.\n\n.\n\nThe ultimate objective is not only to exclude Palestinians from their homeland, it consists in confiscating the multi-billion dollar Gaza offshore Natural Gas reserves, namely those pertaining to the BG (BG Group) in 1999, as well the Levant discoveries of 2013.\n\nEgypt-Israel “Secret Bilateral Talks”\n\nIn 2021-22, Egypt and Israel were involved in “secret bilateral talks” regarding “the extraction of natural gas off the coast of the Gaza Strip.\n\n“Egypt succeeded in persuading Israel to start extracting natural gas off the coast of the Gaza Strip, after several months of secret bilateral talks.\n\nThis development … comes after years of Israeli objections to extract natural gas off the coast of Gaza on [alleged] security grounds, …\n\nBritish Gas (BG Group) has also been dealing with the Tel Aviv government.\n\nWhat is significant is that the civilian arm of the Hamas Gaza government has been bypassed in regards to exploration and development rights over the gas fields:\n\nThe field, which lies about 30 kilometers (19 miles) west of the Gaza coast, was discovered in 2000 by British Gas (currently BG Group) and is estimated to contain more than 1 trillion cubic feet of natural gas.\n\nThe official in the Egyptian intelligence service told Al-Monitor on condition of anonymity, “An Egyptian economic and security delegation discussed with the Israeli side for several months the issue of allowing the extraction of natural gas off the coast of Gaza. …Al-Monitor, October 22, 2022\n\nA Memorandum of Understanding was signed between Egypt and Israel, which had the rubber-stamp of the Palestinian National Authority (PA):\n\n“The Egyptian official explained that Israel required the start of practical measures to extract gas from the Gaza fields at the beginning of 2024, to ensure its own security. (Al-Monitor, October 22, 2022\n\nNetanyahu’s Timeline: “Before The Beginning of 2024”\n\nThe timeline resulting from these bilateral Israel-Egypt “secret talks” i.e. confiscation of Palestine’s offshore Maritime Gas Reserves is “The Beginning of 2024”.\n\nUnited Nations Assessment\n\nAn important United Nations Conference on Trade and Development (UNCTAD) (2019) report describes Palestine’s predicament as follows:\n\nGeologists and natural resources economists have confirmed that the Occupied Palestinian Territory lies above sizeable reservoirs of oil and natural gas wealth, in Area C of the occupied West Bank and the Mediterranean coast off the Gaza Strip.\n\nHowever, occupation continues to prevent Palestinians from developing their energy fields so as to exploit and benefit from such assets. As such, the Palestinian people have been denied the benefits of using this natural resource to finance socioeconomic development and meet their need for energy.\n\nThe accumulated losses are estimated in the billions of dollars. The longer Israel prevents Palestinians from exploiting their own oil and natural gas reserves, the greater the opportunity costs and the greater the total costs of the occupation borne by Palestinians become.\n\nThis study identifies and assesses existing and potential Palestinian oil and natural gas reserves that could be exploited for the benefit of the Palestinian people, which Israel is either preventing them from exploiting or is exploiting without due regard for international law. (UNCTAD, August 2019, emphasis added, download complete report)\n\nCrimes against Humanity\n\nIn the words of Netanyahu who is on Record for Supporting and Financing a faction within Hamas:\n\n“Anyone who wants to thwart the establishment of a Palestinian state has to support bolstering Hamas and transferring money to Hamas … This is part of our strategy – to isolate the Palestinians in Gaza from the Palestinians in the West Bank.” (Benjamin Netanyahu, statement at a March 2019 meeting of his Likud Party’s Knesset members, Haaretz, October 9, 2023, emphasis added) “Hamas was treated as a partner to the detriment of the Palestinian Authority to prevent Abbas from moving towards creating a Palestinian State. Hamas was promoted from a terrorist group to an organization with which Israel conducted negotiations through Egypt, and which was allowed to receive suitcases containing millions of dollars from Qatar through the Gaza crossings.” (Times of Israel, October 8, 2023, emphasis added)\n\nCrimes against humanity beyond description by the Netanyahu government against the People of Palestine,\n\nCrimes also committed against the People of Israel who are the victims of the Hamas “False Flag Attack” carefully engineered by Mossad-IDF.\n\nThere are deep-seated divisions within Hamas. Our “False Flag” analysis pertains to a military-intelligence faction within Hamas which cooperates with Israeli and U.S. intelligence. See:\n\nIs the Gaza-Israel Fighting “A False Flag”? They Let it Happen? Their Objective Is “to Wipe Gaza Off the Map”?\n\nBy Philip Giraldi and Prof Michel Chossudovsky, October 20, 2023\n\nMichel Chossudovsky, Global Research, October 21, 2023\n\nBelow is the 2013 article by Felicity Arbuthnot\n\nIsrael Gas-Oil and Trouble in the Levant\n\nby Felicity Arbuthnot\n\nGlobal Research,\n\nDecember 13, 2013\n\nIsrael is set to become a major exporter of gas and some oil, if all goes to plan. The giant Leviathan natural gas field, in the eastern Mediterranean, discovered in December 2010, is widely described as “off the coast of Israel.”\n\nAt the time the gas field was:\n\n“ … the most prominent field ever found in the sub-explored area of the Levantine Basin, which covers about 83,000 square kilometres of the eastern Mediterranean region.” (i)\n\nCoupled with Tamar field, in the same location, discovered in 2009, the prospects are for an energy bonanza for Israel, for Houston, Texas based Noble Energy and partners Delek Drilling, Avner Oil Exploration and Ratio Oil Exploration.\n\nAlso involved is Perth, Australia-based Woodside Petroleum, which has signed a memorandum of understanding for a thirty percent stake in the project, in negotiations which have been described as “up and down.”\n\nThere is currently speculation that Woodside might pull out of the deal: “ …since the original plans to refrigerate the gas for export were pursued when relations between Israel and Turkey were strained. That has changed, more recently, which has opened the door for gas to be piped to Turkey.”\n\nThe spoils of the Leviathan field has already expanded from an estimated 16.7 trillion cubic feet (tcf ) of gas to nineteen trillion – and counting:\n\n”We’ve discovered nearly 40 tcf of gas, and we have roughly 19 tcf of that gas that’s available for export to both regional and extra-regional markets. We see exports reaching 2 billion cubic feet a day in capacity in the next decade. And we continue to explore.”, stated Noble Vice Chairman Keith Elliot (ii) There are also estimated to be possibly six hundred million barrels of oil, according to Michael Economides of energytribune.com (“Eastern Mediterranean Energy – the next Great Game.”)\n\nHowever, even these estimates may prove modest. In their: “Assessment of Undiscovered Oil and Gas Resources of the Levant Basin Province, Eastern Mediterranean”, the US Department of the Interior’s US Geological Survey, wrote in 2010:\n\n“We estimated a mean of 1.7 billion barrels of recoverable oil and a mean of 122 trillion cubic feet of recoverable gas in this province using a geology based assessment methodology.”\n\nNevertheless, Woodside Petroleum, might also be hesitant to become involved in further disputes, since they are already embroiled, with the Australian government, in a protracted one in East Timor relating to the bonanaza of energy and minerals beneath the Timor Sea, which has even led to East Timor accusing Australia “of bugging East Timorese officials during the negotiations over the agreement.”(iii)\n\nWoodside’s conflict in East Timor however, may well pale against what might well erupt over the Leviathan and Tamar fields. The area is not for nothing called the Levantine Basin.\n\nWhilst Israel claims them as her very own treasure trove, only a fraction of the sea’s wealth lies in Israel’s bailiwick as maps (iv, v, see below) clearly show.\n\nMuch is still unexplored, but currently Palestine’s Gaza and the West Bank between them show the greatest discoveries, with anything found in Lebanon and Syria’s territorial waters sure to involve claims from both countries.\n\nIn a pre-emptive move, on Christmas Day, Syria announced a deal with Russia to explore 2,190 kilometres (850 Sq. miles) for oil and gas off its Mediterranean coast, to be: “… financed by Russia, and should oil and gas be discovered in commercial quantities, Moscow will recover the exploration costs.”\n\nSyrian Oil Minister, Ali Abbas said during the signing ceremony that the contract covers “25 years, over several phases.”\n\nSyria, increasingly crippled by international sanctions, has seen oil production plummet by ninety percent since the largely Western fermented unrest began in March 2011. Gas production has nearly halved, from thirty million cubic metres a day, to 16.7 cubic metres daily.\n\nThe agreement is reported to have resulted from “months of long negotiations” between the two countries. Russia, as one of the Syrian government’s main backers, looks set to also become a major player in the Levant Basin’s energy wealth. (vi)\n\nLebanon disputes Israel’s map of the Israeli-Lebanese maritime border, filing their own map and claims with the UN in 2010. Israel claims Lebanon is in the process of granting oil and gas exploration licenses in what Israel claims as its “exclusive economic zone.”\n\nThat the US in the guise of Vice President Joe Biden, as honest broker, acting peace negotiator in the maritime border dispute would be laughable, were it not potential for Israel to attack their neighbour again. In a visit to Israel in March 2010, Biden announced: “There is absolutely no space between the United States and Israel when it comes to Israel’s security- none at all”, also announcing on arrival in Israel:”It’s good to be home.”\n\nGiven US decades of “peace brokering” between Israel and Palestine, this is already a road of pitfalls, one sidedness and duplicity, well traveled. There is trouble ahead.\n\nOh, and in demonology, Leviathan is one of the seven princes of Hell.\n\nNotes\n\n\n\ni. http://www.offshore-technology.com/projects/leviathan-gas-field-levantine-israel/\n\nii. http://m.theage.com.au/business/options-widen-for-woodsides-leviathan-partners-20131219-2znu6.html\n\niii. http://www.abc.net.au/news/2013-09-04/east-timor-offers-funds-for-onshore- gas-processing/4933106\n\n\n\niv. http://www.offshore-technology.com/projects/leviathan-gas-field-levantine-israel/leviathan-gas-field-levantine-israel1.html\n\n\n\nv. http://www.google.co.uk/search?q=Leviathan+gas+project+Israel+map&tbm=isch&tbo=u&source=univ&sa=X&ei=ntC2UvO7IcPE7Ab7rIDYCQ&ved=0CEQQsAQ&biw=1017&bih=598\n\n\n\nvi. http://www.phantomreport.com/syria-inks-oil-gas-deal-with-russia-firm#more-20238\n\n",
    "title": "Video: “Wiping Gaza Off The Map”: Big Money Agenda. Confiscating Palestine’s Maritime Natural Gas Reserves",
    "date": "2024-03-20T12:09:00.000+02:00",
    "url": "https://www.globalresearch.ca/israel-gas-oil-and-trouble-in-the-levant/5362955",
    "author": "Felicity Arbuthnot"
}