{
    "text": "A White House spokesperson poured cold water on Republicans’ stated intention to invite Joe Biden to testify in public in his own impeachment hearings, lamenting “a sad stunt” and telling the rightwing congressman steering the effort: “Call it a day, pal.”\n\nJames Comer of Kentucky, the Republican chair of the House oversight committee, has led attempts to impeach the president over alleged corruption involving the business dealings of his son Hunter Biden.\n\nAt the end of a long hearing on Wednesday, Comer said: “In the coming days I will invite President Biden to the oversight committee to provide his testimony and explain why his family received tens of millions of dollars … We need to hear from the president himself.”\n\nIan Sams, the White House spokesperson for oversight and investigations, responded swiftly and brutally.\n\n“LOL,” Sams wrote, adding a face-palm emoji.\n\nHe added: “Comer knows 20-plus witnesses have testified that [Joe Biden] did nothing wrong. He knows that the hundreds of thousands of pages of records he’s received have refuted his false allegations. This is a sad stunt at the end of a dead impeachment. Call it a day, pal.”\n\nHunter Biden, who has pleaded not guilty to federal tax and gun charges, has testified in private. So has James Biden, the president’s brother.\n\nWednesday’s hearing featured two Republican witnesses, both former associates of Hunter Biden. Tony Bobulinski appeared in person. Jason Galanis appeared by video link from prison in Alabama, where he is serving a near-16-year sentence for fraud.\n\nAnother key source for Republicans, Alexander Smirnov, was recently imprisoned in Nevada after being charged with lying to the FBI about supposed corruption involving the Biden family. Smirnov has also been linked to Russian intelligence.\n\nOn Wednesday, Bobulinski and Galanis claimed Joe Biden was involved in family business activities, though a meeting described by Bobulinski took place in 2017, after Biden left office as vice-president and years before he beat Donald Trump to become president.\n\nDemocrats called Lev Parnas, a Ukrainian-American businessman who worked with Rudy Giuliani on Trump’s attempts to find dirt on the Bidens in Ukraine, efforts that led to the first of two Trump impeachments.\n\n“The only information ever pushed on the Bidens and Ukraine has come from one source and one source only: Russia and Russian agents,” Parnas said.\n\nAmid grandstanding from members of both parties, Democrats sought to persuade the watching public the Republican impeachment effort was dead.\n\n“Our colleagues now are apparently preparing to save face by ending the impeachment farce with criminal referrals,” said Jamie Raskin, the ranking Democrat on the oversight committee. “But criminal referrals require evidence of crimes. And the only crimes we have seen are those of the GOP’s own star witnesses.”\n\nThe attempt to impeach Joe Biden, Raskin said, had become “perhaps the most spectacular failure in the history of congressional investigations”.\n\nIn his pushback efforts, Sams also cited commentators’ responses. Among them was Charlie Sykes, an anti-Trump Republican who spoke to MSNBC.\n\n“What happened today was truly amazing even by our standards,” Sykes said. “It is one thing to say that this thing is falling apart but that actually understates how horrifically bad this is.\n\n“This was dumb and dumber.”",
    "title": "White House on Republican plan for Biden to testify on impeachment: ‘LOL’ | Joe Biden",
    "date": "2024-03-21T16:02:00.000+02:00",
    "url": "http://swifttelecast.com/white-house-on-republican-plan-for-biden-to-testify-on-impeachment-lol-joe-biden",
    "author": "Adrian Jhonsan"
}