{
    "text": "\n\nDonald Trump Wins Florida And Illinois Presidential Preference Primary Election\n\nFormer President Donald Trump is happy and thanking Florida people after an overwhelming victory in the sunshine state.\n\nDonald Trump secured his party’s nomination during the GOP presidential primary, as reported by the Orlando Sentinel.\n\nThe former President took to his Truth social site to thank Florida, writing, “THANK YOU, FLORIDA — MAGA!” Reports state 94% of the vote counted, and Trump had 80.8%, and 14% of the votes went towards former South Carolina Gov. Nikki Haley. Lastly, 3.9% of votes went towards Gov. Ron DeSantis.\n\nView this post on Instagram A post shared by The Shade Room (@theshaderoom)\n\nRon DeSantis endorsed Trump after he dropped out of the race and Florida is his home state, so it’s not surprising that Trump won. Trump’s win is not only in Florida, he also won the Republican primary in Illinois. According to The Hill, there are 64 GOP delegates up for grabs in Illinois.\n\nAs it stands, the former President has already met the delegate requirements needed to secure the Republican nomination for 2024.\n\nThis is coming after Trump received backlash for saying that there would be a “bloodbath” for the country if he doesn’t get elected. He made the statement during a campaign rally in Ohio on Saturday for Senate candidate Bernie Moreno.\n\n“It’s Florida!! I know more wasn’t expected,” someone commented. “I really do not like this man but at this point I honestly rather Trump in office before Biden Ain’t never hear Trump attempt to give billions of dollars to man other country to side in a war that we don’t got shit to do with,” another person wrote.",
    "title": "Donald Trump Wins Florida & Illinois Presidential Preference Primary Election",
    "date": "2024-03-20T22:55:00.000+02:00",
    "url": "https://dreddinfo.com/2024/03/donald-trump-wins-florida-illinois-presidential-preference-primary-election.html",
    "author": "Peter Dredd"
}