{
    "text": "WASHINGTON ― President Joe Biden is lapping Donald Trump in fundraising for the 2024 election, bolstered by a haul in February that was about double what the former president and presumptive Republican nominee brought in.\n\nThe widening fundraising gap is a warning sign for Trump, who has been saddled with paying off legal bills in his multiple court cases. And it has given Biden a new line of attack against his opponent on the campaign trail.\n\n\"Donald, I'm sorry I can't help you,\" Biden told supporters at a fundraiser Wednesday night in Dallas, reciting a joke about a man coming up to him with crushing debt.\n\nBiden's reelection campaign reported raising $21.3 million in February, nearly double the $10.9 million raised by the Trump campaign, according to filings with the Federal Election Commission, giving the incumbent Democratic president $71 million cash on hand at the end of February compared to $33.5 million for Trump's campaign.\n\nWhen combined with money raised by the Democratic National Committee in February, Biden has a war chest of $97.5 million for the general election, more than double the $44.8 million cash on hand across Trump's main campaign account and the Republican National Committee.\n\nPrep for the polls: See who is running for president and compare where they stand on key issues in our Voter Guide\n\nA full picture or the campaign fundraising won't be clear until other joint committees affiliated with the campaigns release their latest fundraising figures to the FEC at a later time. But Biden's fundraising advantage is indisputable at this point.\n\nFactoring in the efforts of all their affiliated committees, the Biden campaign said it raised $53 million in February, giving the president $155 million in the bank still to spend − the most ever for a Democratic presidential candidate at this point in the election cycle.\n\nOne of Trump's affiliated committees, the Save America PAC, reported having $4.1 million on hand at the end of February after spending more than $7.2 million the same month led by $5.6 million on legal fees and services, according to the committee's monthly disclosure.\n\n\"We’ve said Donald Trump is in dire financial straits,\" Biden campaign spokesman Ammar Moussa said in a statement. \"We said his campaign is struggling and doesn’t have the ability to build a winning coalition. We just didn’t know it was THIS bad.\"\n\nTrump faces massive penalties in court following recent judgements. The former president has been able to get a bond in his New York civil fraud case to shield his assets as he appeals a $454 million judgment for fraudulently over-valuing his real estate empire.\n\nTrump this month posted a $92 million bond to block columnist E. Jean Carroll from collecting on her $83.3 million judgement as Trump appeals her defamation victory.\n\nThe Trump campaign did not address the disparity when asked to comment on Biden's fundraising lead. “Americans know that they were better off with President Trump four years ago than with Crooked Joe Biden and his disastrous policies,\" Trump spokesman Steven Cheung said in a statement to USA TODAY. \"We need a return to America First policies that successfully kept our country safe and supercharged the economy for all Americans.”\n\nBiden has been on a multi-day campaign swing this week that included two fundraisers in the Dallas area on Wednesday. A fundraiser in Houston is set for Thursday.\n\nNext week, Biden is holding a fundraiser in New York with former president Barack Obama and Bill Clinton in what will be the campaign's highest profile fundraiser to date.\n\nReach Joey Garrison on X, formerly Twitter, @joeygarrison.",
    "title": "Biden widens fundraising lead over Trump",
    "date": "2024-03-21T00:54:00.000+02:00",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/21/biden-widens-fundraising-lead-over-trump/73051510007",
    "author": "autoweek.com"
}