{
    "text": "Bernie Moreno, Republican candidate for Senate, speaks in Salem, Ohio, on Friday, March 15, 2024. Photo: Bill Clark/CQ-Roll Call, Inc via Getty Images\n\nFor the second election cycle in a row, Donald Trump has intervened in a highly competitive multi-candidate Ohio Republican Senate primary and pulled off a win that reinforces his dominant position in the GOP. Trump’s endorsee, auto-dealer magnate Bernie Moreno, beat State Senator (and Cleveland Guardians co-owner) Matt Dolan and Secretary of State Frank LaRose decisively on March 19. With over 96 percent percent of the expected vote in, Moreno is winning just over half the total votes and leading by Dolan by 18 percent. It’s a broad-based victory, since Moreno is ahead in all of Ohio’s 88 counties. (Trump won his own primary over withdrawn rival Nikki Haley by a 79 percent to 14 percent margin).\n\nMoreno is definitely over-performing expectations. He led Dolan, who was backed by Governor Mike DeWine and former senator Rob Portman, and who outspent him by a significant margin, by a spare two points in the final RealClearPolitics polling averages on the race. Trump will undoubtedly take credit for the Moreno surge, having conducted an Ohio rally with his candidate over the last weekend. But Democrats may have had something to do with the outcome; a super-PAC associated with the Democratic Party sank upward of $3 million on ads boosting Moreno among Republican voters by attacking him as “too conservative for Ohio.” It’s also possible that some Democrats slipped over to the GOP primary (the Buckeye State has open primaries) to help Moreno given incumbent Senator Sherrod Brown’s unopposed nomination quest.\n\nMoreno may have drawn this unfriendly assistance because he’s recently gone loud and proud extremist MAGA, as opposed to Dolan, who endorsed Trump’s presidential candidacy but has mostly campaigned as a standard-brand Republican conservative with some moderate leanings. Another factor could be weird recent reports linking a Moreno email account to a hookup site where someone purporting to be him solicited gay sex back in the day. That mostly matters because Moreno has trended harshly anti-LGBTQ in his current Senate race.\n\nBut at this point the Moreno primary win makes Trump two-for-two in recent Ohio Senate primaries. His late endorsement of J.D. Vance in 2022 clearly played a role in the Hillbilly Elegy author surviving a crowded GOP contest (in which Dolan was a candidate while Moreno withdrew after failing to get Trump’s support). Vance went on to defeat Democratic candidate Tim Ryan by a comfortable margin.\n\nMoreno begins his general-election campaign with a lot of doubts about his viability against the perennially popular Brown, but also some advantages thanks to the high likelihood that Trump will again win the state handily (he carried Ohio by an identical 8.1 percent margin in both 2016 and 2020).\n\nIf Trump’s Senate candidate wins in November, it would go a long way toward flipping the upper chamber toward the GOP and would also give Ohio a matched set of MAGA senators in Vance and Moreno. That would represent a significant devolution of the state that was the ultimate dead-even battleground as recently as 2004. Right now Sherrod Brown stands alone as a potential salvager of statewide Democratic hopes in Ohio.",
    "title": "Ohio Election Results: Trump Pick Bernie Moreno Wins Primary",
    "date": "2024-03-20T15:45:00.000+02:00",
    "url": "https://nymag.com/intelligencer/article/ohio-election-results-bernie-moreno-wins-primary.html",
    "author": "Ed Kilgore"
}