{
    "text": "Asked if she would campaign with her husband, she said, \"stay tuned.\"\n\nMelania Trump joined her husband at a polling place in Palm Beach, Florida, Tuesday -- making a rare public appearance this election cycle.\n\nAsked by a reporter if she would be joining the former president on the campaign trail, the former first lady simply smiled and said, \"stay tuned,\" but nothing more.\n\nAfter voting, the Trumps walked away from reporters smiling, arm in arm.\n\nRepublican presidential candidate former President Donald Trump and former first lady Melania Trump leave after voting in the Florida primary election in Palm Beach, Fla., on March 19, 2024. Wilfredo Lee/AP\n\nCampaign advisers have previously posted videos of the couple together at Mar-a-Lago during private events, most recently when they hosted Hungary's Prime Minister Viktor Orban.\n\nIn December, Melania Trump delivered remarks at a naturalization ceremony at the National Archives in Washington, but her husband did not attend the event with her.\n\nAt his campaign rallies, Donald Trump often talks about his wife's criticism of his sometimes-vulgar rhetoric and dance moves, saying she calls them \"unprofessional.\"\n\nFormer President Donald Trump and his wife Melania Trump are shown on their wait to vote in the primary election in West Palm Beach, Fla., on March 19, 2024. Pool via ABC News\n\nIn a September interview with NBC News, when Trump was asked about his wife campaigning with him, he said she'd be out there \"soon\" and \"at appropriate time\" but added he likes to \"keep her away.\"\n\n\"She's right now with Barron in school,\" Trump said. \"She loves that boy. She's very popular, she actually is. And she'll be with us. She's very, very supportive.\"\n\n\"Pretty soon, when it's appropriate, but pretty soon,\" he added. \"She's a private person, a great person, very confident person. And she loves our country very much. She'll be -- she'll be at the appropriate time.\"\n\n\"She'll be out there, and honestly, I like to keep her away from it. It's so nasty and so mean,\" Trump said.",
    "title": "Melania Trump makes rare appearance on 2024 campaign trail - ABC News",
    "date": "2024-03-20T07:16:00.000+02:00",
    "url": "https://abcnews.go.com/Politics/melania-trump-makes-rare-appearance-2024-campaign-trail/story?id=108291649",
    "author": "ABC News"
}