{
    "text": "President Joe Biden is taking his reelection pitch to a pair of Western battleground states this week, heading to Nevada and Arizona to shore up support in key states he’s looking to defend against former President Donald Trump in November.\n\nBiden’s pitch will zero-in on efforts toimprove the cost of housing and create jobs in clean energy and manufacturing as he makes the case to Americans that his policies are working for them. He’ll also use the trip to highlight early organizing efforts in these two states that the campaign believes will be “core” to electoral victory.\n\nThe president is also looking to appeal to Latinos, who make up a sizable portion of voters in Arizona and Nevada, as his predecessor has sought to make inroads in a community that has long been key to the Democratic coalition. Biden launched the campaign’s “Latinos con Biden-Harris” organizing initiative during a visit to South Phoenix, Arizona, on Tuesday evening.\n\nWhile the president bested former President Donald Trump in both Nevada and Arizona in 2020, early polling indicates his path to victory in these Western swing states may be a challenge this year. Nevada is expected to be a tight race, and in Arizona, a Fox News poll of the state reflected a slight edge for Trump over Biden, who has also been hampered by low approval ratings nationwide.\n\nBut Biden’s team hopes a number of issues – including reproductive rights and democracy arguments – could work in their favor against Trump, especially with moderate voters.\n\nArizona and Nevada could see abortion rights provisions on their state ballots this November, which the campaign believes will be key to its organizing and can galvanize women and moderate voters.\n\n“Nevadans and Arizonans are gathering signatures for ballot initiative to give voters the opportunity to protect abortion access in their states’ constitution in 2024. Nevada is one of the most pro-choice states in the nation. And the vast majority of Arizonans support abortion access, as well,” said Dan Kanninen, the Biden campaign’s battleground states director.\n\nAlong with issues like job creation and protection for unions, the campaign also plans to make the battle for democracy a key plank of its argument in these states.\n\n“Issues of democracy are particularly potent and top of mind in both states. Trump’s allies in Arizona launched their infamous election audits after his loss in 2020. The state Republican Party in Nevada is literally run by Trump’s indicted fake electors. Democrats, independents, and moderate Republicans have come together to defeat the far-right candidates in these states who have parried Trump’s lies,” Kanninen said.\n\nVictory in both states will require activating Biden’s 2020 coalition and mobilizing new voters. The campaign is looking to both states’ diverse voters, including AAPI, Latino, Black, indigenous, young and women voters, Kanninen said, and Biden also hopes to shore up support from union workers.\n\nIn a pair of interviews with Spanish-language outlets that aired Tuesday, Biden blasted his predecessor’s remarks about migrants and Latinos.\n\n“This guy (Trump) despises Latinos — I understand Latino values,” he said. “You know — we just celebrated St. Patrick’s Day, I hope you’re not offended by me saying this, but you know, the thing about the Irish that came here, they’re about family, they’re about faith, they’re about decency, and that’s exactly what the Latino community is all about,” Biden told Univision’s “El Bueno, La Mala y El Feo.”\n\nHe added, “Latinos were essential to my win in 2020, and again they’re essential, working hard to earn their vote. Earliest ever ad campaign to communicate directly with Latino voters about what we’ve done, in English and Spanish. The campaign is organizing on the ground in our Latino communities.”\n\nThe Sun Belt swing is part of the Biden campaign’s March month of action, building off what his team viewed as a successful State of the Union address with travel to every battleground state. Senior campaign advisers have argued the Western states – along with the so-called blue wall and two Southern states - will be key to their pathway to 270 electoral votes.\n\n“Across the Southwest, Donald Trump and his extreme MAGA agenda have taken over the Republican Party establishment, causing deep divisions among traditional GOP voters and an opening for Democrats that has increasingly become a trendline,” Julie Chavez Rodriguez, Biden’s campaign manager, wrote in a memo.\n\nIn the weeks since the State of the Union, Biden has traveled to Georgia, Michigan, Pennsylvania and Wisconsin, along with New Hampshire, and the president and Vice President Kamala Harris plan on visiting North Carolina, a state the campaign sees as a possible pickup opportunity, next week.\n\nIt comes as the campaign is also scaling up its battleground operation, including expanding its brick-and-mortar presence with more than 100 new offices and 350 new team members – including 40 across Nevada and Arizona, Chavez Rodriguez’s memo said.",
    "title": "Biden seeks to reinvigorate diverse coalition in critical 2024 campaign",
    "date": "2024-03-22T16:24:00.000+02:00",
    "url": "https://www.abc15.com/news/national/biden-seeks-to-reinvigorate-diverse-coalition-in-critical-2024-campaign-swing-out-west",
    "author": "CNN"
}