{
    "text": "President Joe Biden’s move on Wednesday to pump $19.5 billion into Intel’s expanding chip-making business could pay dividends with a critical part of the American electorate his Democrats need to win over: independents in the swing state of Arizona.\n\nThe move will create thousands of jobs in the Southwestern border state that is expected to play a critical role in determining the Nov. 5 elections for president and Congress. Recent polling shows the economy as Arizona voters’ No. 2 concern after immigration.\n\nElevate Your Tech Prowess with High-Value Skill Courses Offering College Course Website Indian School of Business ISB Professional Certificate in Product Management Visit IIM Lucknow IIML Executive Programme in FinTech, Banking & Applied Risk Management Visit MIT MIT Technology Leadership and Innovation Visit\n\nIn addition to the close-fought contest between Biden and Republican challenger Donald Trump, Arizona voters will be choosing a successor to retiring Senator Kyrsten Sinema, a Democrat-turned-independent, and deciding two highly competitive races for House of Representatives seats now held by Republicans.\n\n“The potential could be independent voters,” said Thom Reilly, a professor at Arizona State University’s School of Public Affairs, who noted that independents are the state’s largest voting bloc and represented about 40% of voters in the 2022 midterm elections.\n\n“Independents came out in significant numbers for Democrats in 2022,” said Reilly, who added that Wednesday’s news could carry weight with the state’s large and growing numbers of youth and Hispanic voters, as well as California transplants.\n\nThe funds come from the 2022 CHIPS and Science Act, which slated around $52 billion in federal government subsidies to support the domestic production of semiconductors, coupled with about $24 billion worth of investment tax credits.\n\nDiscover the stories of your interest\n\n\n\nIn addition to Arizona, funds will go to Ohio, home to another key Senate race, New Mexico and Oregon. Intel estimated the new plants will create 3,000 new jobs in the company and another 6,000 spots for the construction workers who build them. Arizona will play a critical role in determining whether Democrats can protect their slim 51-49 majority in the Senate. The race will pit Democratic U.S. Representative Ruben Gallego against Republican former television broadcaster Kari Lake, a vocal Trump supporter.\n\nTight Contest\n\nBiden won Arizona in a tight 2020 race against Trump. A Feb. 22 Emerson College poll of 1,000 registered voters in the state had Trump leading Biden 46% to 43%, which is within the margin of error of 3 percentage points. In that same poll, Gallego led Lake 46% to 39%, with 15% undecided.\n\nIntel said the new, expanded facilities will be in the city of Chandler, about 20 miles (32 km) southeast of Phoenix. That puts it within driving distance of the state’s two most competitive House districts. With Republicans holding a narrow 219-213 majority, a few changes could flip control of the chamber.\n\nBoth those seats are held by Republicans, Representatives David Schweikert and Juan Ciscomani, who are expected to face tough races against Democrats. Republicans and Democrats hold their primary elections on July 30.\n\nOfficials with the two campaigns did not immediately respond to requests for comment.\n\nSchweikert, who won reelection in 2022 by 3,200 votes, voted against the massive semiconductor investment bill, as did most of his House Republican colleagues.\n\nCiscomani is a first-term Republican who was not in Congress in 2022. Gallego voted in favor of the bill.\n\n“Anytime you can deliver actual results to a company and a state … it’s a net positive,” said Jessica Taylor, an editor at the nonpartisan Cook Political Report.\n\nShe added that whether Democrats actually gain votes depends in part on how effective the White House is in communicating going forward. That is an area that the Biden administration has come under criticism for and the president himself has expressed frustrations over.\n\n“What kind of economics are people concerned about? Things like this or more like kitchen-table issues,” Taylor said referring to consumer prices and inflation. “That’s the biggest hurdle that they have with undecided voters.”",
    "title": "arizona joe biden intel chips: Arizona independents in play as Joe Biden pushes big Intel investments",
    "date": "2024-03-21T14:04:00.000+02:00",
    "url": "https://planetconcerns.com/arizona-joe-biden-intel-chips-arizona-independents-in-play-as-joe-biden-pushes-big-intel-investments",
    "author": "salena marshall"
}