{
    "text": "The claim: Post implies judge ended Jack Smith's prosecution of Donald Trump\n\nA March 16 Facebook post (direct link, archive link) shows side-by-side images of former President Donald Trump and Justice Department special counsel Jack Smith.\n\n\"SIGNED SEALED, DELIVERED: Judge ends Jack Smith – Trump WIN,\" reads the post.\n\nSome commenters took the post to mean that Smith's prosecutions of Trump had ended.\n\n\"THEY NEVER intended to win these indictments THEY only wanted to drain President Trumps (sic) assets and take him off the election circuit,\" reads one comment.\n\nPrep for the polls: See who is running for president and compare where they stand on key issues in our Voter Guide\n\nThe post was shared more than 200 times in three days.\n\nMore from the Fact-Check Team: How we pick and research claims | Email newsletter | Facebook page\n\nOur rating: Missing context\n\nThe implied claim here is wrong. Smith is prosecuting Trump in two separate federal cases, one involving Trump's alleged mishandling of classified documents and one involving his alleged attempts to overturn his 2020 election loss. Both cases are still ongoing.\n\nTrump still faces charges in classified documents, election interference cases\n\nThe federal judges responsible have not brought an end to the two criminal cases brought against Trump as a result of Smith's investigations.\n\nTrump faces 40 counts in the classified documents case, including charges of obstructing justice, making false statements and trying to \"alter, destroy, mutilate or conceal evidence.\" More than 300 classified documents were recovered from Trump's Mar-a-Lago estate in Palm Beach, Florida, over a year after he left the White House\n\nJudge Eileen Cannon is expected to postpone a May 20 trial date because of disputes in the case, and she has said it will probably be later than the prosecution's proposal of July 8. Trump’s lawyers suggested Aug. 12, but also urged Cannon to postpone the trial until after the November election.\n\nFact check: Biden had nothing to do with Trump's indictment in classified documents probe\n\nTrump faces another four counts in the election interference case – three for conspiracy and one for obstruction. He is accused of falsely claiming election fraud and trying to overturn the legitimate 2020 election results.\n\nJudge Tanya Chutkan canceled a March 4 trial date as higher courts weigh Trump's claim that a former president is immune from prosecution for official acts. The Supreme Court agreed to hear the appeal and scheduled arguments for the week of April 22.\n\nIn the first comment, the social media user who made the post shared a link to an article published in January about Chutkan barring Smith from filing pretrial motions without permission as Trump's immunity claim is decided. Chutkan, though, rejected a request from Trump's team to hold Smith in contempt, NBC News reported.\n\nUSA TODAY reached out to the social media user who shared the post for comment but did not immediately receive a response.\n\nOur fact-check sources:\n\nThank you for supporting our journalism. You can subscribe to our print edition, ad-free app or e-newspaper here.\n\nUSA TODAY is a verified signatory of the International Fact-Checking Network, which requires a demonstrated commitment to nonpartisanship, fairness and transparency. Our fact-check work is supported in part by a grant from Meta.",
    "title": "Trump still charged in classified docs, Jan. 6 cases | Fact check",
    "date": "2024-03-19T02:00:00.000+02:00",
    "url": "https://www.gainesville.com/story/news/factcheck/2024/03/19/trump-classified-docs-jan-6-cases/73028445007",
    "author": ", Gainesville Sun"
}