{
    "text": "WASHINGTON – Sen. John Kennedy (R-La.) today joined Sen. Tim Scott (R-S.C.) to introduce the Protecting Access to Credit for Small Businesses Act, a bill that would prevent the Biden administration from using the Small Business Administration (SBA) as a direct lender for the 7(a) Loan Program.\n\n“Fraud and inefficiency characterize the Small Business Administration’s history in direct lending. The government shouldn’t crowd out private lenders that are already doing a good job getting funds to the small businesses that need them. I’m proud to partner with Sen. Scott to stop the SBA from replacing private lenders and those in our communities with Washington bureaucrats,” said Kennedy.\n\n“When acting as a direct lender, the SBA has a consistent history of failure and inefficiency when compared to the private sector. The administration’s proposal is just a vehicle for a big government overreach into nearly all aspects of American life and private institutions. There’s simply no reason to use the federal government to funnel tax dollars that will later be loaned back to small businesses,” said Scott.\n\nThe Protecting Access to Credit for Small Businesses Act would block the SBA from issuing direct 7(a) loans and competing with small lenders.\n\nBackground:\n\nThe 7(a) Loan Program provides small businesses with loans of up to $5 million to help job creators grow and maintain their businesses. Today, small business owners work with private lenders in their communities to receive loans through the program.\n\nIn his 2025 budget request, President Biden proposed a small-dollar lending program that would allow the SBA to issue 7(a) program loans directly, forcing small lenders to compete with the federal government.\n\nDemocrats attempted to implement a similar direct lending option for the SBA in 2021. Kennedy, Scott and a dozen other Republicans wrote a letter warning that the federal government has a history of developing botched lending programs. The SBA’s Inspector General, for example, estimated that the government-run Economic Injury Disaster Loan (EIDL) program issued $79 billion in fraudulent loans during the pandemic. Businesses also suffered lengthy delays while waiting for EIDL funding.\n\nPrivate lenders have a far better record of efficiently and safely distributing loans to small businesses. Under the Paycheck Protection Program (PPP), private banks distributed $800 billion in loans to nearly 12 million small businesses. Fraud experts identified fewer than 1% of accounts as potentially fraudulent.\n\nSens. Jim Risch (R-Idaho), Kevin Cramer (R-N.D.), Chuck Grassley (R-Iowa), Steve Daines (R-Mont.), James Lankford (R-Okla.), Joni Ernst (R-Iowa), John Cornyn (R-Texas), Ted Budd (R-N.C.), Tom Cotton (R-Ark.), Rick Scott (R-Fla.) and Mike Braun (R-Ind.) also cosponsored the legislation.\n\nFull text of the Protecting Access to Credit for Small Businesses Act is available here.",
    "title": "Kennedy, Scott introduce bill to protect job creators from Biden admin’s SBA lending plan",
    "date": "2024-03-20T07:00:00.000+02:00",
    "url": "https://www.kennedy.senate.gov/public/2024/3/kennedy-scott-introduce-bill-to-protect-job-creators-from-biden-admin-s-sba-lending-plan",
    "author": null
}