{
    "text": "Secretary of State Antony Blinken told Israeli Prime Minister Benjamin Netanyahu last week that Israel cannot defeat Hamas — that there is no “military solution,” and that Israel will have to accept a Palestinian state.\n\nNetanyahu reportedly rejected the idea.\n\nNBC News reported Wednesday that Blinken, and Biden, are therefore trying to work around Netanyahu — the democratically-elected leader of Israel — in a departure from the Biden administration’s posture as the supposed defender of democratic ideals:\n\nBlinken told Netanyahu that ultimately there is no military solution to Hamas, according to the officials, and that the Israeli leader needs to recognize that or history will repeat itself and violence will continue. But, the officials said, Netanyahu was unmoved. The officials said the Biden administration is trying to lay the groundwork with other Israeli and civil society leaders in anticipation of an eventual post-Netanyahu government. In an attempt to work around Netanyahu, Blinken also met individually with members of his war Cabinet and other Israeli leaders, including opposition leader and former Prime Minister Yair Lapid, officials said.\n\nBut Blinken faces two obstacles: one, that Israelis believe that they are, in fact, capable of winning the war, and that they are doing so; two, that Palestinians themselves do not want a state more than they want to destroy Israel, meaning a state is doomed to fail.\n\nOn the first point, the Israel Defense Forces (IDF) spokesman, Rear Admiral Daniel Hagari, delivered a comprehensive summary Wednesday night of the war’s progress. While fighting in the southern portion of Gaza remains challenging, he said, the IDF had largely destroyed Hamas in the northern and central regions of the territory. The south is where Hamas’s leaders are believed to be hiding underground — surrounded by over 100 Israeli hostages, whom they are using as bargaining chips and human shields.\n\nIsraelis are nearly unanimous in their determination to destroy Hamas — a dramatic shift in attitudes since the October 7 terror attack, when Israelis were largely prepared to ignore Hamas as long as it did not attack them. The mass murder of 1,200 people, along with the abduction of 253 more, mostly civilians, changed attitudes in Israel across the political spectrum.\n\nMany left-wing Israelis who once considered themselves “more Palestinian than the Palestinians” now see all Palestinians as a potential threat.\n\nAccording to Gallup, nearly two-thirds of Israelis now oppose a Palestinian state, given what Hamas did to them, and to Gaza — and given the pro-terror sympathies of the corrupt Palestinian Authority, which governs most Palestinians in the West Bank.\n\nThat is a radical reversal from the position of most Israelis just a decade ago, when “twice as many Israeli adults supported an independent Palestinian state (61%) as opposed one (30%).” Hamas’s rocket and terror attacks are responsible for the change.\n\nBlinken and President Joe Biden are committed to the old, failed model of Middle East peacemaking, in which the Palestinian issue must precede all others. President Donald Trump rejected that idea — and the result was the historic Abraham Accords.\n\nNow, Biden and Blinken are trying to make new peace agreements — such as a Saudi-Israeli peace deal — contingent on the creation of a Palestinian state. And Blinken is casting Israelis as if they are not ready for peace, in contrast to the Arab world.\n\nThat is a total inversion of the truth, according to opinion polls, which suggest that the vast majority of Palestinians support Hamas’s terror attack of October 7. Arab public opinion is similar, though the Abraham Accords have remained intact so far.\n\nNBC News also reports that Blinken is pushing a deal in which Saudi Arabia would agree to normalized relations with Israel in return for a Palestinian state. Ironically, Saudi Arabia was on the verge of a deal without a Palestinian state before October 7.\n\nIt was the Biden administration, according to one report, that actually stalled that deal by insisting on additional concessions to the Palestinians — concessions that the Saudis did not demand and for which the Palestinians did not agree to any compromises.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of the 2021 e-book, “The Zionist Conspiracy (and how to join it),” now updated with a new foreword. He is also the author of the recent e-book, Neither Free nor Fair: The 2020 U.S. Presidential Election. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.",
    "title": "Surrender: Blinken Tells Netanyahu Israel Can’t Defeat Hamas",
    "date": "2024-03-21T15:13:00.000+02:00",
    "url": "https://www.breitbart.com/middle-east/2024/01/17/surrender-blinken-tells-netanyahu-israel-cant-defeat-hamas",
    "author": "BWC"
}