{
    "text": "„Er hat genug Misserfolge hinter sich“: Biden muss Wahl mehr fürchten als das Amtsenthebungsverfahren\n\nDrucken Teilen\n\nDer Vorsitzende des House Oversight Committee James Comer (R-Ky.), rechts, und der ranghöchste Demokrat des Gremiums, Repräsentant Jamie Raskin (Md.), am Mittwoch. © Ricky Carioti/The Washington Post\n\nDie Republikaner wollen Biden aus dem Amt drängen. Doch das Verfahren liegt so gut wie auf Eis – aus Mangel an Beweisen. Die Wahl ist viel gefährlicher.\n\nWashington – Das Verfahren zur Amtsenthebung von Präsident Joe Biden kommt nicht voran. Zwar hielten die Republikaner im Repräsentantenhauses eine Anhörung ab und präsentierten Zeugen, die die dünnen Behauptungen wiederholten, dass Mitglieder der Familie Biden aus dem Namen ihres Vaters finanziell Kapital schlugen. Doch ob das reicht, um den Mann im Weißen Haus auf diese Weise zu Fall zu bringen? Die Zweifel werden immer größer.\n\nAmtsenthebungsverfahren gegen Joe Biden: Republikaner haben Probleme mit Beweisen\n\nDer Vorsitzende des House Oversight Committee, James Comer, hatte die Ermittlungen gegen Biden im vergangenen Jahr mit Anschuldigungen wegen schwerer Verbrechen und Vergehen eingeleitet, die die Republikaner seither nur mit Mühe unterstützen konnten. Fünfzehn Monate später haben die Republikaner im Kongress keine Beweise oder Zeugenaussagen erhalten, die belegen, dass Joe Biden direkt an den Geschäften seines Sohnes Hunter Biden beteiligt war oder davon profitierte.\n\nUnd obwohl einige von Hunter Bidens engen Mitarbeitern seinen Vater in die Nähe der an einigen Geschäften Beteiligten gerückt haben – was die Behauptungen des Präsidenten, er habe nichts von Hunters Aktivitäten gewusst, untergräbt –, entsprach keine der Anschuldigungen den Vorwürfen der Republikaner, Hunter Bidens geschäftliche Aktivitäten hätten eine Einflussnahme ermöglicht, die Joe Biden und seine Familie bereichert habe.\n\nMit ihrer knappen Mehrheit benötigen die Republikaner im Repräsentantenhaus nahezu Einstimmigkeit, um ein Amtsenthebungsverfahren gegen den Präsidenten zu verabschieden, was sie nicht haben. Stattdessen ist die Skepsis unter den Republikanern nur noch gewachsen, seit ein FBI-Informant angeklagt wurde, über die Bidens gelogen zu haben, wodurch das, was als wichtiges Beweisstück präsentiert worden war, ins Wanken geriet.\n\nThe Washington Post vier Wochen gratis lesen Ihr Qualitäts-Ticket der washingtonpost.com: Holen Sie sich exklusive Recherchen und 200+ Geschichten vier Wochen gratis.\n\nDie Zweifel wachsen: Joe Biden muss die Amtsenthebung wohl nicht fürchten\n\nIn Ermangelung dieser Stimmen haben sich Comer und andere Mitglieder der Untersuchungsausschüsse auf die Möglichkeit einer Strafanzeige verlegt. Comer hat gedroht, „mehrere“ Strafanzeigen zu stellen, aber es bleibt unklar, ob die Gesetzgeber Präsident Biden formell eines Verbrechens beschuldigen werden und welche Verbrechen sie ihm vorwerfen.\n\n„Ich bin mir nicht sicher, wie wir den Präsidenten strafrechtlich belangen können, ohne ein Amtsenthebungsverfahren anzustrengen“, sagte Abgeordneter Kelly Armstrong. „Ich meine, das [Justizministerium] wird das sowieso nie in Angriff nehmen.“\n\nArmstrong, Mitglied des Justizausschusses des Repräsentantenhauses, fügte hinzu, dass der Ausschuss gegen mehrere Zeugen, die vor dem Ausschuss ausgesagt haben, Strafverfahren wegen Verstößen gegen den Foreign Agents Registration Act einleiten könnte. Hunter Biden, der es ablehnte, am Mittwoch zu erscheinen, sieht sich neun strafrechtlichen Anklagen in einem seit langem andauernden Bundessteuerfall und Anklagen wegen Waffenbesitzes gegenüber.\n\n„Meine Meinung zu einem Amtsenthebungsverfahren im Allgemeinen? Es ist eine sehr hohe Messlatte, die sie erfüllen müssen, und sie müssen ihre Kollegen davon überzeugen, dass es das Richtige ist“, sagte der Abgeordnete Brian Fitzpatrick. „Wenn sie es ablehnen, ein Amtsenthebungsverfahren einzuleiten, ist das meiner Meinung nach die richtige Entscheidung.“\n\nViele Anschuldigungen der Republikaner gegen Biden verpuffen\n\nDem offensichtlichen Zusammenbruch einer der wichtigsten Ermittlungen der Republikaner im Repräsentantenhaus ging eine Reihe von Vorfällen voraus, bei denen Comer, der sogar von einigen republikanischen Kollegen für seine Fox-News-zentrierte Herangehensweise an die Ermittlungen kritisiert wurde, Anschuldigungen gegen Biden und seinen Sohn erhob, bevor sie öffentlich verpufften. Abgeordneter Jamie Raskin, der ranghöchste Demokrat im Oversight Committee, nannte die Anhörung in seiner Eröffnungsrede am Mittwoch „das Ende des vielleicht spektakulärsten Scheiterns in der Geschichte der Untersuchungen des Kongresses“.\n\nTony Bobulinski, ein ehemaliger Geschäftspartner von Hunter Biden, sagt am Mittwoch vor dem House Oversight Committee aus. © Ricky Carioti/The Washington Post\n\n„Unsere Kollegen bereiten sich jetzt offenbar darauf vor, ihr Gesicht zu wahren, indem sie die Amtsenthebungsfarce mit Strafanträgen beenden“, sagte Raskin. „Aber strafrechtliche Verweise erfordern Beweise für Verbrechen. Und die einzigen Verbrechen, die wir gesehen haben, sind die der eigenen Kronzeugen der Grand Old Party.“\n\nJede Strafanzeige, die der Kongress an das Justizministerium richtet, wäre ein symbolischer Akt, der für sich genommen kein rechtliches Gewicht hat und den Staatsanwälten die Entscheidung überlässt, ob sie Anklage erheben. Aber eine strafrechtliche Verweisung könnte die Feststellungen des Oversight Committee so deutlich wie möglich zum Ausdruck bringen und den Republikanern, die versucht haben, unbegründete Behauptungen und Theorien über Biden und seine Familie zu legitimieren, als Kommunikationsmittel dienen.\n\nEinige Mitglieder deuteten an, dass sie bereit seien, alle neuen Beweise, die die Ermittler des Repräsentantenhauses in der Zwischenzeit ans Tageslicht bringen könnten, zu prüfen. Der Abgeordnete Mike Garcia merkte jedoch an, dass den Republikanern vor dem Rückkampf zwischen Biden und dem ehemaligen Präsidenten Donald Trump die Zeit davonlaufe - und dass Biden vor größeren Herausforderungen bei den Wahlen stehe als vor einem möglichen Amtsenthebungsverfahren, das in einem von den Demokraten kontrollierten Senat scheitern dürfte.\n\nDie Wahl gegen Donald Trump ist für Biden das viel größere Problem\n\n„Letztendlich wird das amerikanische Volk im Oktober oder November darüber abstimmen, ob dieser Präsident für das Amt geeignet ist oder nicht“, sagte Garcia. „Ich denke, er hat schon genug andere Herausforderungen und Misserfolge hinter sich, so dass ein Amtsenthebungsverfahren wahrscheinlich nicht einmal das Wahlergebnis beeinflussen würde“.\n\nTony Bobulinski, ein ehemaliger Geschäftspartner von Hunter Biden, und Jason Galanis, der wegen mehrfachen Betrugs eine fast 16-jährige Haftstrafe in Montgomery, Alabama, verbüßt, sagten beide bei der Anhörung am Mittwoch auf Geheiß der Republikaner aus. Sie behaupteten beide, dass Joe Biden in die geschäftlichen Aktivitäten seiner Familienmitglieder verwickelt war, bevor sie Details über begrenzte Interaktionen mit Joe Biden angaben, um die Behauptungen zu untermauern.\n\nBobulinski verwies auf ein Treffen mit Joe Biden im Mai 2017, das von Hunter Biden und dem Bruder des Präsidenten, James, arrangiert worden war, als Beweis dafür, dass Joe Biden von den Geschäften seines Sohnes mit ausländischen Unternehmen wusste. Doch als Bobulinski am Mittwoch zu dem Treffen befragt wurde, erwähnte er bei der Beschreibung des 45-minütigen Treffens in Los Angeles nicht ausdrücklich das Streben nach einem Geschäft mit CEFC, einem chinesischen Energiekonglomerat.\n\n„Wir sprachen über meinen Hintergrund, den militärischen Hintergrund meiner Familie, die verschiedenen geschäftlichen Unternehmungen, die ich auf der ganzen Welt unternommen hatte, die Familie, mit der ich zusammenarbeitete - Joe verbrachte Zeit damit, über seine Familie zu sprechen, über einige der Tragödien, die sie durchlebt hatten“, beschrieb Bobulinski das Gespräch mit Joe Biden, der zu diesem Zeitpunkt nicht im Amt war.\n\nRepublikaner präsentieren zweifelhafte Zeugen im Amtsenthebungsverfahren\n\nGalanis, der per Zoom vom Gefängnis aus aussagte, beschrieb auch eine „relativ kurze Diskussion“ mit dem damaligen Vizepräsidenten Biden im Mai 2014, nachdem Hunter Biden auf einer Party Galanis und eine kleine Gruppe von Personen - darunter die russische Milliardärin Jelena Baturina und ihr Ehemann Juri Luschkow sowie Hunter Bidens ehemaliger Geschäftspartner Devon Archer – beiseite genommen und Joe Biden über den Lautsprecher angerufen hatte. Galanis behauptete, dass es in dem Gespräch um den bevorstehenden Besuch von Baturina und Luschkow in Washington ging und „sie darüber sprachen, gut zu seinem Jungen zu sein“. Auf die Frage, ob es bei diesem Anruf darum ging, dass Hunter Biden potenziellen Investoren „Zugang zur Marke Biden“ verschaffte, antwortete Galanis, dass dies der Fall sei.\n\nDer Abgeordnete Gary Palmer (R-Ala.) nannte während der Anhörung Unstimmigkeiten zwischen den Aussagen von Mitgliedern der Familie Biden und den Aussagen von Bobulinski und Galanis als mögliche Grundlage für eine weitere strafrechtliche Verweisung: Lügen gegenüber dem Kongress. Nach der Anhörung verteidigte Palmer den Prozess des Oversight Committee und warnte, dass die Mitglieder noch Zeit hätten, ein Amtsenthebungsverfahren in Betracht zu ziehen.\n\n„Ich denke, wir müssen sehr überlegt und sorgfältig vorgehen, denn es geht um das Leben vieler Menschen. Mein Ziel ist es nicht, jemanden zu erwischen, mein Ziel ist es, die Wahrheit herauszufinden“, sagte Palmer.\n\nDie Anhörung wurde zeitweise sehr kontrovers geführt. Als die Abgeordnete Lisa C. McClain versuchte, den Ruf von Hunter Biden zu schmälern, indem sie ihn spöttisch als „goldenes Kind“ bezeichnete, lachte die Abgeordnete Ayanna Pressley und murmelt, dass McClains Kommentar „reich“ sei. „Schauen Sie sich Ihre Partei an“, fügte Pressley hinzu. „Gönnen Sie mir eine Pause.“\n\nAn einem Punkt forderte der Abgeordnete Jared Moskowitz Comer auf, einen Antrag auf ein Amtsenthebungsverfahren gegen Biden zu stellen. „Wann können wir dem amerikanischen Volk sagen, dass Sie aufhören werden, Ihr Geld zu verschwenden und einfach die Abstimmung über ein Amtsenthebungsverfahren beantragen?“, sagte Moskowitz.\n\n„Wir machen keine Schnellabstimmungen wie ihr“, entgegnete der Vorsitzende des Justizausschusses Jim Jordan.\n\nDemokraten bezichtigen die Republikaner der Lüge\n\nMehrere Demokraten warfen den Republikanern vor, eine Anhörung zu einem Amtsenthebungsverfahren abzuhalten, das zum Teil auf der Grundlage einer Behauptung eingeleitet wurde, von der die Behörden inzwischen sagen, sie sei unwahr. Der Sonderstaatsanwalt David Weiss, der zuvor Strafanzeige gegen Hunter Biden erstattet hatte, kündigte im vergangenen Monat eine Anklage gegen einen FBI-Informanten an, dessen Behauptungen Comer als grundlegendes Beweisstück in der Amtsenthebungsuntersuchung angepriesen hatte, weil er angeblich das FBI angelogen hatte.\n\nComer und Senator Chuck Grassley hatten im vergangenen Frühjahr unbegründete Behauptungen von Alexander Smirnow - einer ehemaligen vertraulichen Quelle des FBI - aus dem Jahr 2020 aufgedeckt, wonach Biden in ein Bestechungsprogramm verwickelt gewesen sei, und das FBI aufgefordert, das Dokument mit Smirnows Behauptungen vorzulegen. Die von Smirnov erhobenen Behauptungen wurden zuvor vom FBI unter dem damaligen Generalstaatsanwalt William P. Barr geprüft und für nicht stichhaltig befunden und anschließend fallen gelassen.\n\nComer und andere Republikaner im Kongress argumentierten jedoch monatelang, dass Smirnovs Behauptungen ein Beweis dafür seien, dass die Bidens in korrupte Geschäfte verwickelt gewesen seien, und dass das FBI diesen Behauptungen nicht nachgegangen sei. Die Saga fand in den Medien großen Widerhall; Sean Hannitys Show auf Fox News strahlte mindestens 85 Beiträge über die unbegründete Behauptung aus, Biden habe eine Bestechung angenommen, so eine Aufstellung von Media Matters for America.\n\n„Diese gesamte Untersuchung basiert auf einer bahnbrechenden Information, die sich in einem geheimen SCIF-Raum befand, und in diesem Raum befand sich ein Dokument, das Präsident Biden direkt eines 10-Millionen-Dollar-Bestechungsschemas bezichtigte“, sagte Abgeordnete Alexandria Ocasio-Cortez. „Was ist vor einem Monat passiert? Das FBI verhaftete die Person, die diese Anschuldigungen vorbrachte, weil sie ihre Aussage gegenüber dem FBI gefälscht hatte. Das gesamte Amtsenthebungsverfahren basiert auf einer tatsächlich nachweisbaren Person, die gelogen hat.“\n\nWas haben russische Agenten mit dem Verfahren gegen Biden zu tun?\n\nDie Demokraten befragten auch Lev Parnas, einen ehemaligen Mitarbeiter von Rudy Giuliani, der in einem Fall von Wahlkampf-Finanzbetrug verurteilt wurde und am Mittwoch erschien, über seine Zeit der Zusammenarbeit mit Giuliani in den Jahren 2018 und 2019, um schädliche Informationen über Joe Biden aufzuspüren. Der ukrainisch-amerikanische Geschäftsmann rief die Kohorte von Pro-Trump-Gesetzgebern auf den Plan, die Fehlinformationen über die Bidens und ihre Arbeit in der Ukraine verbreiteten.\n\n„Die einzigen Informationen, die jemals über die Bidens und die Ukraine verbreitet wurden, stammen aus einer Quelle und nur aus einer Quelle: Russland und russischen Agenten“, sagte Parnas aus.\n\nAm Ende der Anhörung sagte Comer, er lade den Präsidenten ein, vor dem Kongress auszusagen, eine Einladung, die ein Sprecher des Weißen Hauses in den sozialen Medien mit einem Lachen quittierte.\n\nZur Autorin Jacqueline Alemany ist Reporterin für Kongressuntersuchungen bei The Washington Post. Zuvor war sie Autorin von „The Early 202“, dem Flaggschiff der Post, das am frühen Morgen die wichtigsten Nachrichten für die zahlreichen Machtzentren des Landes liefert. Alemany ist auch als Gastredakteurin bei NBC News und MSNBC tätig.\n\nWir testen zurzeit maschinelle Übersetzungen. Dieser Artikel wurde aus dem Englischen automatisiert ins Deutsche übersetzt.\n\nDieser Artikel war zuerst am 21. März 2024 in englischer Sprache bei der „Washingtonpost.com“ erschienen – im Zuge einer Kooperation steht er nun in Übersetzung auch den Lesern der IPPEN.MEDIA-Portale zur Verfügung.",
    "title": "Amtsenthebungsverfahren gegen Biden liegt auf Eis",
    "date": "2024-03-21T11:35:00.000+02:00",
    "url": "http://www.wasserburg24.de/politik/amtsenthebungsverfahren-gegen-biden-liegt-auf-eis-usa-republikaner-trump-zr-92904649.html",
    "author": "wasserburg24.de"
}