{
    "text": "February 15, 2024. President Joe Biden and Israeli Prime Minister Benjamin Netanyahu have a long phone conversation. The communiqué published by the White House briefing room says they spoke about humanitarian assistance to civilians in Gaza and Israeli military operations.\n\nA few hours later, Netanyahu posted a message on X, saying bluntly:\n\n“Israel will continue to oppose the unilateral recognition of a Palestinian state. Such recognition in the wake of the October 7 massacre would give a huge reward to unprecedented terrorism and prevent any future peace settlement”.\n\nIt seems clear that the Biden administration would like to see the rapid creation of a Palestinian state or at least a “Palestinian unity government” — unfortunately composed of the Palestinian Authority and the terrorist group Hamas — and, abracadabra, recognize it.\n\nAccording to The Washington Post:\n\n“The Biden administration and a small group of Middle East partners are rushing to complete a detailed, comprehensive plan for long-term peace between Israel and Palestinians, including a firm timeline for the establishment of a Palestinian state”.\n\nThe article suggests that the US State Department is conducting a review of options for recognizing the “Palestinian state” as soon as the war ends.\n\nThe article also says that there is an “elephant in the planning room”: the talks are taking place without any Israeli participation. As Netanyahu’s message shows, they are taking place against the will of Israel’s prime minister and his government. They are even taking place against the will of almost all members of the Israel’s parliament (the Knesset): they voted 99-to-11 on February 21 to back the government’s decision to reject “international dictates regarding a permanent settlement with the Palestinians and the establishment of a Palestinian state” and its “unilateral recognition”.\n\nHow can members of the Biden administration think it will achieve any kind of “peace” between Israel and Palestinians under these conditions? They probably do not. They probably are just looking at the election polls in Michigan, where many Democrats who are likely pro-Hamas recently voted “uncommitted” in the party’s presidential primary. How can officials in the administration even imagine being able to create a Palestinian state without Israel’s acceptance? They are probably hoping — as with three years of US open borders, stifling US energy production and appeasing US adversaries such as Russia, China and Iran — that they can get away with it.\n\nHow can the Biden administration fail to see that creating an essentially unrevitalized Palestinian state or a terrorist “Palestinian Unity Government” just months after the October 7 massacre would constitute a huge reward for terrorism?\n\nThe Biden administration also appears ready to reward terrorists. It already does. On October 18, the Biden administration gave $100 million in “humanitarian aid” to Gaza and the West Bank, just 11 days after the October 7 massacre — knowing full well that Gaza was controlled by Hamas and that the money and aid would end up with Hamas.\n\nThe Biden administration, to its great credit, sent US Navy aircraft carriers to the area, munitions to Israel and has verbally supported it — but they are also apparently trying not to lose the “Arab-American vote.”\n\nOn January 26, 2021, six days after Biden was sworn in, acting US Ambassador to the United Nations Richard Mills said that the Biden administration would “restore aid” to the Palestinian Authority (PA). A few weeks later, without the Biden administration even asking the PA to stop funding terrorism , aid was restored.\n\nIn 2021, when Hamas attacked Israel, the Biden administration pressured the Israeli government to stop the Israeli response. When a ceasefire was implemented, Biden promised to provide rapid humanitarian assistance for the Gaza population and aid for the reconstruction of Gaza. Even then, it was clear that the aid would help the ruling terrorist group Hamas, whatever denials Biden stated at that time, such as: “We will do this in full partnership with the Palestinian Authority — not Hamas”.\n\nTo “manage” the situation, Biden sent Hady Amr, a man who had written that the terrorist group Hamas should be included in the negotiations; Biden then named Amr the US Special Representative for Palestinian Affairs.\n\nOn January 19, 2021, Antony Blinken, who was not yet sworn in as Secretary of State, pledged that the Biden administration would negotiate a new agreement with Israel’s main enemy in the region, Iran. Nine days later, having become Secretary of State, he appointed as Special Envoy to Iran Robert Malley, a man reportedly sympathetic to Iran and later suspended for activity currently under investigation – if the investigation has not been secretly dropped.\n\nThe Biden administration then lifted various sanctions on Iran’s regime and gradually unfroze billions of dollars of Iranian funds. Although the main funder of Hamas has been Qatar – which provide “protection money” “without protection” — Iran has reportedly been giving Hamas $100 million a year, part of which was likely used to finance Hamas’s October 7 massacre and war machine.\n\nIn a move no one ever talks about, the Palestinian Authority — in a move recommended by the 2009 Fayyed Plan and implemented with the inordinately generous help of the European Union — have been rushing as fast as they can to build “facts on the ground” in disputed areas, thereby bypassing the direct negotiations to which both sides had agreed. These “facts”” now include at least “close to 10,000” illegal Arab construction sites. All the same, under the Israeli government of then PM Naftali Bennet, the Biden administration, published statements hostile to Israel and to the Jewish “settlements” on the West Bank. Many Palestinians, nevertheless, appear to view all of Israel as “one big settlement”.\n\nAs soon as Netanyahu won the Israeli elections on November 1, 2022, the Biden administration’s hostility intensified — not for the first time — against Netanyahu himself. The State Department helped to fund months-long anti-Netanyahu protests that were essentially aimed at bringing down his government — first, so Iran could get a nuclear weapon and then to agree to a ceasefire, or a “Palestinian State”, or a terrorist unity government or, one assumes, whatever the Biden administration requests.\n\nImmediately after the October 7 massacre, Blinken and Biden showed their support for Israel but even then began started to pressure Israel — not Hamas or Iran or Hamas’s sponsor, Qatar. Blinken reportedly made the supply of munitions to the Israeli military conditional on Israel’s acceptance of the payment of a hundred million dollars in aid to the Palestinians from the United States. “[D]on’t be consumed by rage”, Biden cautioned. Since then, for the most part, pressures have continued to increase.\n\nOn November 30, Blinken denounced the “massive loss of civilian lives” resulting from Israeli military action in Gaza and added that Israel must “respect international humanitarian law”, implying that Israel was not. Israel, meanwhile, has been going to extraordinary lengths to protect the citizens of Gaza. Israelis made thousands of calls to Gazans’ cell-phones and blanketed Gaza by air with leaflets in Arabic telling them where to flee to safety — while their own leaders from Hamas shot at them to keep them from leaving, and, later, to stop them from taking humanitarian aid.\n\nThe Biden administration, while having been immensely helpful in sending aircraft carriers to the region –presumably as a deterrent to keep the war from spreading — now appears to be trying to dictate to Israel how it should fight its war. Secretary of Defense Lloyd Austin, however, assured Israel that the US will not limit the timeline it needs to complete is mission.\n\nBiden has also helpfully ignored requests from “Democratic Senators” to withhold military support for Israel if it does not approve humanitarian aid for Gaza, unfortunately meaning for Hamas, who appropriate it (here, here , here , here and here).\n\nTrying to establish a “peace plan” that is bound to bring more war — especially against the will of the country, Israel, that would be directly affected by a “peace plan” — is acting against Israel. Attempting to create a Palestinian state against the will of Israel is not helpful to anyone – least of all the Palestinians who would be condemned to live under a corrupt and dismissive leadership. Recent Palestinian opinion polls show that nearly 90% say they want Palestinian Authority President Mahmoud Abbas, now in the 19th year of his four-year term in office, out.\n\nAny peace plan established in this way is destined to fail: peace, as agreed to by both the Israelis and the Palestinians in the 1993 Oslo Accord, can only be achieved by agreement between the two parties involved. Israeli leaders have offered peace many times as well as immense concessions. Each time, the Palestinian leaders have refused, without even a counteroffer.\n\nThe attempt to create a Palestinian state is also, unfortunately, destined to fail: Israeli leaders have proposed the creation of a Palestinian state several times, and each time the Palestinian leaders were offered one, they refused. The Palestinian leaders have, in fact, been admirably clear: They do not want a state alongside Israel, they want a state instead of Israel.\n\nEven now, according to the journalist Daniel Greenfield, Palestinian terrorists in Moscow are working to create a “technocratic government”: “a front for the terrorists and composed of nonprofit executives, academics, economists and others who have experience dealing with the international community and extracting foreign aid from them”:\n\nHamas, will not officially be part of the puppet regime, but will control the puppets.” Husam Zomlot, the Palestinian Authority’s ambassador to the United Kingdom told The Financial Times. “About Hamas — there are ongoing discussions . . . but this government is a technocratic government, it’s not made of any political factions, because this is not the time for political factions.” That’s what the Biden administration and the EU want to hear, but while Qatar is helping assemble a new ‘technocratic’ front for the terrorists, the Moscow summit made it clear that the real agenda of the new government would be terror against Israel and the U.S. The Moscow summit revealed that a technocratic government will not end terrorism, it will disguise it, and it will not end the conflict, it will escalate it. A “Palestinian” state, the terrorist groups have already announced, will be a terror state.\n\nThe Biden administration, regrettably, sometimes seems to have a way of ignoring what they do not want to hear or see (as with America’s open borders), and apparently all past failures (Afghanistan, inflation, immigration) and their consequences.\n\nIn the Middle East, every time Israeli leaders have had illusions about Palestinian leaders or given in to foreign pressure, devastating terrorist acts have followed: hijacked airliners , the Munich Olympics massacre, hijacking the Achille Lauro ship, where the Palestinians pushed the elderly, wheelchair-bound Leon Klinghoffer into the sea; the Sbarro pizzeria bombing , the Café Hillel bombing, the Park Hotel bombing, and several murderous intifadas (uprisings). The so-called “peace process” that followed the Oslo Accords led to the creation of the Palestinian Authority which quickly became a base for continuous anti-Israeli terrorism, and a wave of bloody attacks that, until October 7, was interrupted only by constructing a security barrier.\n\nIf elections were held today, polls show, Palestinians would vote overwhelmingly for Hamas. Any Palestinian Arab leader that signs a peace treaty with Israel today would only be seen as a traitor and be lynched. The aim of the Palestinian leadership at the moment, as Greenfield points out, is probably how to keep the money coming in.\n\nOn February 23, Blinken said that Israeli settlement expansion in the West Bank is “inconsistent with international law” — a clear step back from the position expressed by then Secretary of State Mike Pompeo in 2019: “Judea and Samaria are rightful parts of the Jewish homeland, and Israelis have a right to live there”.\n\nThree weeks earlier, Biden signed an executive order allowing sanctions on Israeli settlers (and potentially Israeli politicians) alleged to have been involved in violence against Palestinians — after 5,600 terrorist attacks were carried out against Israelis in 2023. During the same period, Israelis carried out 60 acts of violence against Palestinians, largely to defend themselves against aggressors. The Biden administration punished the defensive acts of Israelis who were attacked, not their attackers.\n\nThe Biden administration, citing the risks of famine, has been insisting on sending more humanitarian aid to Gaza even though most of it is captured by Hamas and given to its terrorists, enabling them to prolong the war. When civilians come near the aid supplies, Hamas shoots. More aid just means more aid for Hamas.\n\nThe US is about to build a pier in Gaza to bring in more humanitarian aid with the help of the United Arab Emirates. However it is not clear how they plan to prevent Hamas from commandeering the additional aid.\n\nGaza hospitals are overcrowded. Many Gazan civilians could be treated if they could get out of the Gaza Strip. The Egyptian government opposes this. It has had its own run-ins with terrorists and additionally can recall all too well how in 1970, the Palestinians showed their appreciation for the hospitality of King Hussein of Jordan. In a slaughter called Black September, they tried to overthrow and assassinate him.\n\nEgypt depends largely on American financial aid and the Biden administration has leverage on its government, but the Biden administration has not pressured the Egyptian government. It appears as if the US has been bending to the wishes of Iran and Hamas, who refuse to allow Gaza civilians to leave the Gaza Strip and instead keep them in the zone of conflict as human shields. If they are killed, Israel will wrongly be blamed, not Hamas. Several countries have offered to welcome civilians from Gaza: Turkey, Canada, Chechnya. “The United States,” Blinken announced, “unequivocally rejects any proposals advocating for the resettlement of Palestinians outside of Gaza.”\n\n“To survive”, President Biden said on February 26, “Israel must take opportunity for peace, security with Palestinians…. I think that if we get that temporary ceasefire, we’re going to be able to move in a direction where we can change the dynamic”.\n\nPolls show that most Israelis know that the survival of Israel is at stake. They do not think for a moment that there is any opportunity for peace and they definitely do not want to “change the dynamic”. Israelis have not forgotten October 7 which Netanyahu has compared to “twenty 9/11s” . The Israeli people, according to reports, are unified in seeing that that without the destruction of Hamas as a political and military threat, Israel will not be safe.\n\nThey understand that if Hamas survives the war, its leaders will declare victory and the threats to Israel will only worsen.\n\nIsraelis are also well aware that the real threat to Israel is the regime of Iran, which, despite denials, clearly helped plan the attack. Even though its proxy militias in Iraq and Syria have since Oct. 7 launched more than 150 attacks on American troops, the Biden administration still refuses to hold Iran to account. Another of Iran’s proxies, Hezbollah, which boasts at least 150,000 missiles aimed at Israel, a country the size of New Jersey, continues to fire missiles into the north of Israel — 100 in one recent day — to make life there unlivable.\n\nThe Biden administration just gave up trying to put in place a ceasefire lasting six weeks in exchange for just some of the hostages held by Hamas – the women and children — and the release of 10 terrorists imprisoned in Israel for each freed hostage. When Hamas refused to provide the names of the hostages still alive, the deal collapsed .\n\nAny ceasefire would just give Hamas the opportunity to resupply and reorganize itself , and the released terrorists would quickly go back to being terrorists again. Hamas’s demands to free the remaining hostages would undoubtedly keep growing higher.\n\nThe Biden administration could easily rescind the 10-year lease of America’s Al Udeid Airbase in Qatar tomorrow — it renewed the lease in January, presumably in exchange for nothing — and see all the hostages home by this weekend.\n\nConcerned groups could also demonstrate against Qatar as a state sponsor of terrorism, as advised by Yigal Carmon, the founder and president of the Middle East Media Research Institute (MEMRI):\n\n“They [families of the hostages] can raise hell for the release of their loved ones – in media, in Congress, and by demonstrating in front of the Embassy of Qatar on M Street in Washington, D.C. Qatar is extremely and incredibly sensitive to being exposed in any way as a terror-sponsoring state… “Many Americans believe that they owe Qatar for its hosting of the U.S. CENTCOM base. The truth is precisely the opposite: It is Qatar that owes the U.S., for locating this base there. Without this base’s presence in the country, Qatar would disappear within less than a week – its neighbors would eat it up. “A single statement by a U.S. Department of Defense official, about relocating – or even considering relocating – this base from Qatar to another country that is not a state sponsor of terrorism is all it would take to get the American hostages released. Even indicating that the U.S. has other options besides Qatar would do it.”\n\nAlthough purportedly negotiating the release of the hostages, Qatar is not an honest broker. Far from being a “Major Non-NATO Ally”, as Biden quixotically anointed it, Qatar is a state sponsor of terrorism, from Al-Qaeda to Al Shaabab to the Taliban to the Al Nusra Front “and even ISIS,” according to former US Rep. Ileana Ros-Lehtinen. Qatar should be designated as such. Qatar has backed Hamas since it ousted the Palestinian Authority from the Gaza Strip in 2007. Qatar has been Hamas’s main funder, providing more than $1.8 billion since 2007. Hamas is Qatar’s pet; Qatar most likely does not want Hamas to lose the war and is sure to do all it can to secure that result.\n\nIsrael’s government, which reportedly continues to receive valuable intelligence from the interrogation of terrorists it has apprehended so far, says it still needs go into Rafah, the last part of southern Gaza. It is believed Hamas’s terrorist leaders might be hiding there, moving through the endless tunnels, and keeping hostages with them as human shields.\n\nThe Biden administration, for its part, sometimes seems frustrated by Israel’s determination to act as a sovereign nation in deciding what is best for its security, rather than being a vassal of the US. On January 7, CNN’s Jake Tapper reported that a Biden administration official told him that Netanyahu will have to choose between his coalition and his ties to the United States.\n\nThe Biden administration has tried to circumvent Netanyahu and create political divisions in Israel during the war. Last month, a political rival of Netanyahu, Benny Gantz, whom Netanyahu had brought into his war cabinet, made an unauthorized visit to Washington, at the invitation of the Biden administration, for “policy meetings” — without Netanyahu’s agreement and without coordinating his plans with the Israeli government.\n\nNBC’s Andrea Mitchell wrote that senior U.S. officials said that the Biden administration is looking past Netanyahu to try to achieve his goals in the region. It appears that the Biden administration would like to trade Netanyahu in for a doormat who would agree to a terrorist Palestinian state next door, a Hamas victory in Gaza and Iran having nuclear weapons.\n\nOn March 14, US Senate Majority Leader Chuck Schumer (D-NY) actually called for ousting the democratically elected Prime Minister Netanyahu and proposed new elections – as if it were his prerogative to tell the government of another sovereign nation how to conduct its internal affairs. The impropriety shocked even the usually shock-resistant Washington DC. “Chuck Schumer’s demand for new Israeli elections is inappropriate and offensive”, Senator Tom Cotton. (R-Arkansas) shot back. “The last thing Israel needs is the ‘foreign election interference’ that Democrats so often decry here”.\n\nNetanyahu, meanwhile, is not giving in, and his governing coalition is solid. Israel also benefits from strong support from the American people. A recent poll shows that 82% of Americans support Israel in its fight against Hamas, 67% think that a ceasefire should happen only after the release of all hostages and Hamas being removed from power, and 78% think that Hamas must be removed from running Gaza.\n\nBiden’s most recent comment, after saying that he would have a “come-to-Jesus meeting” with Netanyahu, later emphasized that there is “no red line” and that he will “never leave” Israel without support.\n\nSince then, however, the Daily Mail noted:\n\n“I have been asked by a serious administration figure what it is that will force the Netanyahu coalition to collapse,” the Israel expert told New York Magazine. “They were interested in the mechanics, what can we demand which will collapse his coalition.”\n\nSchumer said that Netanyahu, democratically elected by a sovereign nation, must step down and Israel must hold new elections. Biden immediately agreed with him.\n\nThe incident reportedly served to unite more Israelis behind Netanyahu. According to columnist Caroline Glick:\n\n“To win, Israel must do three things. It must remain politically stable. Schumer’s broadside from the Senate floor was just the latest salvo in an all-out effort by the administration to destabilize Israel politically and replace Netanyahu with his chief rival Benny Gantz, whom they believe will agree to capitulate and accept the formation of a Palestinian state. Minister-without-Portfolio Gideon Sa’ar’s decision on Tuesday to ditch Gantz’s party and take his faction’s four Knesset seats into the coalition speaks to the near consensus view in Israel that Netanyahu is the only leader that will fight to victory despite U.S. opposition. Last Wednesday, a new Direct Polls survey showed that U.S. hostility has strengthened Netanyahu and the right. Netanyahu leads Gantz 47 % to 37% in public support. His right-religious bloc of parties, (including Sa’ar) is polling a 62 seat-majority to Gantz’s leftist bloc of parties’ 48 seats.”\n\nThat item, however, was followed shortly by another assessment by Greenfield in “Biden’s ‘Trojan Pier’ for Gaza”: that a new, “temporary” pier being built by the US to help humanitarian aid into Gaza, is actually anything but:\n\n“The temporary pier setup is about bypassing Israel to provide long term access to Gaza. “While administration officials describe the pier as “temporary”, a senior official also admitted that “we look forward to the port transitioning to a commercially operated facility over time.” “That means it’s not actually meant to be temporary, but a permanent port for the terrorists… “The Pentagon spokesman emphasized, however, that American forces would not be on the ground, would not be in a position to secure the aid deliveries or stop Hamas from taking them….. “The Biden administration claims that it personally will not put troops on the ground in Gaza, but there’s no word on whether other nations might do so. The Pentagon has claimed that security arrangements are still being discussed with partner nations. And some of those partner nations could include Hamas allies like Qatar or Turkey. Any armed foreign nation entering Gaza would amount to an invasion of Israeli territory with the ultimate aim of aiding the terrorists living on it… “Beyond any immediate MREs, the causeway will be inevitably used to move supplies for the “reconstruction” of Gaza as part of a new “Palestinian State”. “The Biden administration is creating a gateway to Gaza that Israel isn’t supposed to control. “The Trojan pier is not only about bypassing Israel, but also Egypt. The administration’s vision is that the new arrangement will allow it to directly move materials into Gaza without having to get permission from either Israel or Egypt. And that’s a major victory for the terrorists…. “Once the system is in place and if Israel has been pressured into withdrawing, it gives the terrorists a direct connection to their allies on the outside. And that includes so-called humanitarian groups…”Biden’s actions are a violation of Israel’s sovereignty.”\n\n“At a certain point in the not-so-distant future, wrote Glick, “Netanyahu will need to say ‘no’ to the administration. It can only be hoped that the vast majority of Americans, who stand with Israel against its enemies, will stand with Israel when we arrive at that point”.",
    "title": "Israel Betrayed? by Guy Millière",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "http://www.ruthfullyyours.com/2024/03/21/israel-betrayed-by-guy-milliere",
    "author": null
}