{
    "text": "1. Tony Bobulinski Hunter Biden deposition\n\n2. Hunter Biden perjury accusation\n\n3. Bobulinski statement on Biden deposition\n\nTony Bobulinski has accused Hunter Biden of committing perjury during his deposition, in a breaking development. This revelation comes amidst ongoing scrutiny surrounding the Biden family’s business dealings. Bobulinski’s claim adds another layer of controversy to the already contentious situation. The allegations made by Bobulinski are sure to further fuel speculation and investigation into the actions of the Biden family. Stay tuned for more updates on this story as it continues to unfold. For the latest developments, follow ALX on Twitter.\n\nBREAKING: Tony Bobulinski says Hunter Biden perjured himself in his deposition pic.twitter.com/ZXwblsvWTo RELATED STORIES — ALX (@alx) March 20, 2024\n\nRelated Story.\n\nRELATED STORIES\n\nIn a recent development, Tony Bobulinski, a former business associate of Hunter Biden, has made a shocking claim that Hunter Biden perjured himself during a deposition. This revelation has sent shockwaves through the political landscape, raising questions about the integrity and honesty of the son of President Joe Biden.\n\nThe allegations made by Bobulinski are serious and could have far-reaching implications for Hunter Biden and his family. Bobulinski claims that Hunter Biden lied under oath during a deposition related to his business dealings, which could potentially lead to legal consequences for him.\n\nThe timing of these allegations is particularly significant, as they come at a time when Hunter Biden is already under scrutiny for his business dealings and potential conflicts of interest. The Biden family has faced criticism in the past for their involvement in foreign business dealings, and these latest allegations only serve to further fuel the controversy surrounding them.\n\nIt remains to be seen how these allegations will impact Hunter Biden and his family, as well as the broader political landscape. If the claims made by Bobulinski are true, it could have serious implications for the Biden administration and their reputation.\n\nIn response to these allegations, Hunter Biden has denied any wrongdoing and has stated that he did not perjure himself during the deposition. However, Bobulinski has provided evidence to support his claims, including documents and text messages that he says prove Hunter Biden lied under oath.\n\nThe credibility of both parties involved will be crucial in determining the truth behind these allegations. The American public will be watching closely as this story unfolds, eager to learn more about the potential implications of Bobulinski’s claims.\n\nIt is important to note that these allegations have not been proven in a court of law, and both parties are entitled to their day in court to present their case. However, the seriousness of the accusations made by Bobulinski cannot be ignored, and they are sure to have a significant impact on the ongoing political discourse in the country.\n\nAs more information comes to light, it will be interesting to see how this story develops and what implications it may have for Hunter Biden, his family, and the Biden administration as a whole. The American people deserve transparency and honesty from their elected officials, and it is crucial that these allegations are thoroughly investigated to determine the truth.\n\nIn conclusion, the allegations made by Tony Bobulinski that Hunter Biden perjured himself in his deposition are serious and could have significant implications for the Biden family and the broader political landscape. It is important that these claims are thoroughly investigated to determine the truth and hold those responsible accountable. The American people deserve transparency and honesty from their elected officials, and it is crucial that these allegations are taken seriously. Stay tuned as this story continues to unfold.",
    "title": "Bobulinski Hunter Biden Perjury: Tony Bobulinski Accuses Hunter Biden of Perjury – County Local News",
    "date": "2024-03-20T02:00:00.000+02:00",
    "url": "https://countylocalnews.com/2024/03/20/bobulinski-hunter-biden-perjury-tony-bobulinski-accuses-hunter-biden-of-perjury",
    "author": null
}