{
    "text": "Biden's campaign said at the weekend that it had raised more than $53 million in February.\n\nWashington:\n\nJoe Biden may be struggling against Donald Trump in the polls ahead of November's US presidential election but his numbers are looking good in one department: campaign cash.\n\nThe Democrat holds a widening lead over his Republican rival in the fundraising stakes, while Trump is burning through legal fees as he battles multiple criminal and civil cases.\n\nThe cash crunch has also given 81-year-old Biden a new line of attack on the campaign trail, as he mocks the self-proclaimed billionaire tycoon for his mounting financial woes.\n\n\"Just the other day, a defeated-looking guy came up to me and said, 'Mr President, I need your help, I'm being crushed with debt, I'm completely wiped out,'\" he told a fundraising event in Dallas, Texas on Wednesday.\n\n\"Donald, I'm sorry, I can't help you,\" Biden said he responded, in a punchline that drew laughs and applause from an audience of supporters.\n\nBiden's financial advantage may help calm Democratic nerves as America's oldest president suffers from record low approval ratings less than seven months from his rematch with Trump.\n\nBiden's campaign boasted $71 million of cash in hand at the end of February -- more than double Trump's $33.5 million, filings with the US Federal Election Commission showed on Wednesday.\n\nThe incumbent's campaign raised $21.3 million in February alone, again nearly double Trump's $10.9 million. Biden meanwhile spent $6.3 million in the month but Trump spent more -- $7.8 million.\n\nThose figures however don't show the complete picture for either candidate as filings from their various fundraising committees won't be made until April.\n\nBiden's campaign said at the weekend that it had raised more than $53 million in February, leaving it with a \"historic\" total of $155 million, which it said was the most by any Democrat at this stage in the election cycle.\n\n- 'Dumpster fire' -\n\nPerhaps the most worrying element for Trump are his giant legal fees, as he faces criminal cases including for trying to subvert his 2020 election loss and keeping secret documents.\n\nLawyers' bills accounted for a huge $5.6 million of the money spent in February by Trump's Save America political action committee -- money that could otherwise be going towards campaigning and TV spots.\n\nThe figures add to Trump's woes as he struggles to raise a $464 million bond to appeal a fine by a New York court for fraudulently inflating his wealth.\n\nThe 77-year-old now faces having his assets seized in a humiliating blow to his carefully cultivated image as a dealmaker and self-made tycoon.\n\nTrump cast the fraud case as a \"witch hunt,\" seeking as he often does to use the legal cases against him to whip up his supporters -- and get them to open their wallets.\n\n\"I'm calling on ONE MILLION Pro-Trump patriots to chip in and say: STOP THE WITCH HUNT AGAINST PRESIDENT TRUMP!\" a campaign message on Wednesday said.\n\nThe message was titled \"KEEP YOUR FILTHY HANDS OFF TRUMP TOWER,\" his flagship New York property that could be at risk from the court case.\n\nEarlier this month Trump managed to put together a separate bond for $91.6 million as he appeals a sexual assault and defamation judgment in a lawsuit brought by New York writer E. Jean Carroll.\n\nBiden's campaign described Trump's finances as a \"dumpster fire.\"\n\n\"Trump's filings paint a bleak picture for Republicans,\" Biden campaign spokesman Ammar Moussa wrote on Thursday.\n\nBut with a tight election looming and Trump leading Biden in key swing states in recent polls, Democrats will be trying to keep their war chest as full as possible.\n\nBiden will be joined at a fundraiser in New York on March 28 by Barack Obama and Bill Clinton, the first event of its kind to feature three Democratic presidents and among the most lucrative in party history.\n\nThe gala show is set to raise $10 million for Biden's campaign, with guests having to fork out $100,000 each to pose in a photo with the 42nd, 44th and 46th US presidents, NBC News reported.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
    "title": "\"Sorry, Donald\": Biden Takes Jibe At Trump Over Campaign Cash Lead - kamumedya",
    "date": "2024-03-22T06:53:53.000+02:00",
    "url": "http://kamumedya.com/sorry-donald-biden-takes-jibe-at-trump-over-campaign-cash-lead-512574.html",
    "author": null
}