{
    "text": "To hear the Biden Administration tell it, U.S. agriculture represents a shining beacon for the world’s farms at a time of accelerating climate chaos. In December 2023, Agriculture Secretary Tom Vilsack made the case in Dubai at COP28, the latest iteration of the United Nations’ annual climate talks. Hailing the success of his country’s “incentive-driven and market-based” policy mechanisms for keeping farmers on a “climate-smart” path, Vilsack insisted that “there’s no need for us to be defensive” about the American way of growing food. “We can articulate proactive leadership in the climate space—leadership that I think is reflected in a number of opportunities for us to showcase what U.S. farmers and ranchers are doing to mitigate and adapt to a changing climate and doing it in a sustainable, substantive way.”\n\nVilsack’s rosy view likely found a welcome audience among participants from COP28’s host country. Back in 2021, the U.S. Department of Agriculture (USDA) and the United Arab Emirates launched the Agriculture Innovation Mission for Climate (AIM for Climate), a public-private effort to generate “innovative, science-based solutions to increase food security and help agriculture and food systems mitigate and adapt to climate change.” Vilsack vowed the project would “lead to rapid and transformative climate action across the world.” In a USDA forum earlier that year, he presented the project as a “market-oriented, incentive-based, voluntary” alternative to the European Union’s then-newly hatched “Farm to Fork” strategy, which called for cuts to pesticide and fertilizer use as well as reduced meat consumption as a response to climate change and biodiversity loss.\n\nAt the 2023 COP meeting, Vilsack shared a stage with Mariam bint Mohammed Almheiri, the petrostate’s minister of climate change and environment, to extol AIM for Climate. By then, most of the globe’s biggest pesticide, seed, fertilizer, and meat companies—whose lobbyists swarmed the conference in Dubai—had signed on to the project as partners. In an interview with reporters at the confab, Vilsack made clear his vision for a climate-smart food future did not include ramping down production of meat, the source of most of agriculture’s greenhouse gas emissions. Instead, he insisted, technical fixes would enable industrial-scale meat production to expand without cooking the planet—a position not unlike Big Oil’s pitch that carbon-capture technologies can enable fossil fuel combustion indefinitely. (U.S. eaters stand near the top of the global food chain in terms of per capita meat consumption, and only Brazil exports more meat than the United States.)\n\nOn the surface, the United Arab Emirates makes an odd comrade in an effort to define best practices for farming in a warming world. Situated in a desert, the UAE imports nearly 90 percent of its food supply, meaning that its domestic farming sector is minimal. But the UAE does possess massive oil and natural gas reserves—and natural gas is the main feedstock for producing synthetic nitrogen fertilizer, the lifeblood of industrial-scale agriculture and the main water pollutant in the ag-intensive regions of the United States and Europe. Back in 2019, to diversify its profit streams away from just selling oil and gas, the UAE’s state-owned fossil fuel conglomerate, the Abu Dhabi National Oil Company, jumped into the fertilizer business by launching Fertiglobe, a joint venture with the Dutch firm OCI Global. These days, Abu Dhabi National Oil owns an 86 percent stake in Fertiglobe, which calls itself the world’s “largest nitrogen fertilizer and ammonia exporter.” In other words, the USDA has aligned itself on the global stage with a nation that stands to profit from the proliferation of the very kind of chemical-intensive agriculture that reigns in the United States.\n\nOne glimmer of hope for more environmentally friendly farming lies in the Inflation Reduction Act. It provides $17 billion in funding for conservation practices over the next seven years; spending this money wisely, and not using it to merely greenwash the status quo, is going to be crucial. Because while our agriculture secretary conducts his affable marketing blitz on behalf of current American farming methods, the land where they have most completely taken root—the upper Midwest—tells a different story. Rather than representing a triumph of climate resiliency and wise agricultural policy, the once-glorious cache of topsoil that blankets the U.S. heartland is quietly withering away. Vilsack’s sunny view aside, if we have any hope of thriving in a climate that’s warmer and more volatile than humans have ever experienced before, we’ll have to steer sharply away from, not hew to, the agricultural path we’re on.\n\nIn 2021, a team of University of Massachusetts Amherst scientists, led by geomorphologist Isaac Larsen, began publishing a series of papers examining the scale of soil erosion in the U.S. corn belt—a broad swath of land stretching from Nebraska to Ohio and as far south as Missouri. They didn’t choose the region casually. It accounts for around 90 percent of U.S. corn production, and about 80 percent of soybeans. Iowa, the heart of the corn belt and the state Vilsack once served as governor, devotes more than 85 percent of its land to farming—of which 95 percent is planted in corn and soybeans. (“[I]n Iowa, Indiana, and Illinois, less than 0.1 percent of the original tallgrass prairie remains,” Larsen et al. note.) In turn, these corn belt crops suffuse the U.S. food supply, providing the feed for the factory-scale livestock farms that deliver nearly all of our meat (as well as ample exports) and the bulk of the sweeteners and oils that make America’s ultra-processed diet so palatable. They also help move us around, literally. By government mandate—a policy long championed by Vilsack—more than a third of U.S. corn output gets burned in our gas tanks in the form of ethanol, a gasoline additive that provides about 7 percent of the energy consumed in internal combustion cars. Soybean-derived biodiesel has a growing share of the much smaller U.S. diesel market.\n\nGiven our reliance on the corn belt for sustenance and transportation, it would be comforting to think, as Vilsack suggests, that its soil is being managed in a way that ensures future bumper harvests. Robust soil health in our heartland would support Vilsack’s pitch on the global stage: We’ve cracked the code for sustainable agriculture amid climate change—so farm as we farm, and the food supply is safe. The work of Larsen and his team exposes this idea as a dangerous delusion.\n\nIn their first paper, published in 2021 in the Proceedings of the National Academy of Science, they used satellite imagery to gauge the presence of what’s called A-horizon soil, the carbon-rich, loamy, dark stuff. It’s the plum resource the United States claimed when it seized the region from indigenous people in the nineteenth century. Settler-farmers encountered—and quickly flattened, drained, and plowed—tallgrass prairies, wetlands, and riparian savannas, characterized by hundreds of species of perennial wild grasses and legumes. Flowers and grasses towered over the newcomers’ heads, their roots plunging just as deep into the earth, burying carbon snatched from the atmosphere. Vast herds of bison ate their way through meadows, stimulating new plant growth, recycling nutrients, and feeding soil-borne microbes with their manure. Native American peoples played an active role in managing the ecosystem: They periodically set fires that quickly freed nutrients and prevented trees from establishing, allowing prairie plants to thrive without being shaded out. These interactions among people, plants, animals, microbes, and climate—building on silt deposited by melted glaciers at the end of the Ice Age—left behind one of the planet’s largest accumulations of top-quality soil. It’s what allowed the corn belt to emerge as a breadbasket in the first place, and it’s what we’ll need in place as the climate warms, because its water-holding capacity makes it more resilient to increasingly frequent droughts and heatwaves.\n\nOur most important farming region is an ecological wasteland in the making.\n\nLarsen and his team found that fully one-third of the U.S. heartland’s A-horizon soil has already washed away, leaving behind much lower-quality subsoil. These degraded swaths of land require higher doses of synthetic nitrogen fertilizer to keep churning out crops, increasing water pollution and food production costs, the paper states. Already, the researchers estimate, this widespread erosion is pinching overall corn belt crop yields by around 6 percent and causing nearly $3 billion in annual economic losses.\n\n“I was surprised at how visually striking the erosion can be,” Larsen told me in an interview. “There can be a drop of several feet between native prairie remnants and the farm fields that are next to them. When you look at the satellite imagery, the soil on the hilltops is a light-tan color that is nothing like the dark, organic-matter-rich soil that is what the Midwest is known for.”\n\nIn a later paper, published in 2022, the group came out with an even more startling finding. Understanding it requires a brief dive into science geekery. The soil that blankets a landscape is a dynamic system—even under pristine conditions, it’s always washing away at the surface under pressure from rain, wind, and tillage, and generating anew down below, as bedrock weathers and releases inorganic material that binds with organic matter to become soil. When soil erodes at a higher rate than it regenerates, your farming system is essentially mining a resource that took millennia to form. Scientists refer to the rate at which a landscape’s soil naturally regenerates as “T,” short for tolerable soil loss rate. In most of the corn belt, the USDA considers T to stand at roughly 5 tons per acre annually. According to the department’s own tracking, Iowa’s farmland is eroding at about 5.8 tons per acre annually. This rate suggests that the region is surrendering soil about 1.16 times faster than it naturally forms. Most experts would say that situation isn’t something to tout as a global agricultural model, perhaps, but also that it’s probably nothing requiring immediate policy attention.\n\nBut experts have long warned that the USDA’s T value is dubious. While I was researching my 2020 book Perilous Bounty, veteran Iowa State University soil scientist Richard Cruse told me the USDA had based its T assumption on “not much at all.” The calculation behind a tolerable loss rate of 5 tons per acre rested on a misunderstanding of a flawed paper published in the journal Agricultural Engineering way back in 1941, he said. Cruse noted that there has been little research on T specific to the corn belt, but that he suspected the real number to be closer to 0.5 tons per acre.\n\nLarsen and his team have filled the research void. Analyzing the presence of a rare element called beryllium-10 in soil samples taken throughout the region (an established method for gauging historical erosion rates) for a paper published in the journal Geology in 2022, they came up with an estimate for the rate at which corn belt soils eroded before settlement. This figure provides a solid proxy for the region’s actual T, Larsen told me, because before it came under the plow, the landscape’s soil cache remained in rough balance: Lost soil didn’t exceed new soil formation. Their finding: The region’s median pre-agriculture erosion rate—and thus its real T—is about 0.2 tons per acre per year. That’s one-twenty-fifth of the USDA’s assumption of 5 tons per acre. So rather than eroding at 1.16 times the rate of natural replenishment, Iowa’s soil is disappearing nearly 30 times faster than it replenishes. This is why Larsen’s team could see drops of several feet into farmland. “Our results indicate that tolerable soil erosion, as currently defined [by the USDA], will lead to the depletion of midwestern soils,” the paper dryly concludes. In other words, we’re looking at a mounting crisis, not a mere concern. A third of the corn belt’s soil has vanished; what’s left is rapidly moving toward the same fate. Rather than representing an advertisement for agricultural resilience in the face of climate change, our most important farming region is an ecological wasteland in the making.\n\nI asked Larsen whether anyone in U.S. farm policy circles—from the USDA, or the staffs of the lawmakers who make up the House and Senate agriculture committees—had contacted him about his research. No one had, he said.\n\nWhen Vilsack speaks of the United States’s “incentive-driven,” “voluntary” approach to agriculture policy, he’s giving an accurate appraisal. It didn’t start that way. The current U.S. policy regime developed during the Great Depression, after a boom in demand for crops like wheat and corn triggered by World War I ultimately went bust, causing prices to tumble. Farmers responded in a way that made sense for individual players but proved disastrous for the overall farm economy: by pushing their land to churn out more crops, hoping to make up on volume what they were losing on price. The result was a spiral of overproduction and soil erosion on a grand scale, leading to the twin catastrophes of mass farm failures and the Dust Bowl.\n\nNew Deal farm legislation sought to address the situation with a policy known as “supply management.” To prevent chronic overproduction, the USDA would annually set limits for the number of acres farmers could devote to staple crops like corn and wheat, hoping to stabilize farmer incomes at a level on par with the salaries of urban workers while keeping food prices affordable for consumers. But the post-World War II era also marked the advent of industrial agriculture: the rise of petroleum-powered tractors and high-yielding hybrid seeds, along with the synthetic fertilizers and pesticides (byproducts of war technology) the seeds needed to thrive. This technological revolution caused crop yields to soar and prices to plunge. As the USDA tried to manage supply with its acreage limits, it also hotly promoted the new technologies by offering farmers subsidized loans to finance the purchase of advanced farm machinery, hybrid seeds, and chemicals. (The systemic denial of such credit to African American farmers essentially led to a net transfer of millions of acres from Black to white landowners, as historian Pete Daniel showed in his great 2013 book Dispossession: Discrimination against African American Farmers in the Age of Civil Rights.) In short, the farm-tech boom swamped the USDA’s ability to help farmers make a living. Crop prices fell steadily between 1945 and 1970, over which time the number of U.S. farms plunged from over five million to under three million.\n\nAround that time, U.S. ag policy took a turn. In place of acreage limits, Nixon’s Agriculture Secretary Earl Butz urged farmers to “plant fencerow to fencerow,” without fear of overproduction and price drops. Butz vowed to find foreign markets for any excess—and in 1972, he could point to a massive deal to sell corn and wheat to the Soviet Union, which caused prices to spike the following year. Following Butz’s advice to “get big or get out,” many farmers took on debt to buy more land and bigger combines and apply more chemicals to maximize yield. What followed, predictably, was a crash in prices (the famous 1980s farm crisis) and a surge in soil erosion so severe that the General Accounting Office (now the Government Accountability Office) saw fit to issue a scathing report calling attention to it.\n\nIn the decades since, in deference to an emerging agribusiness lobby that benefited from booming sales of pesticides, fertilizers, high-tech seeds, and farm equipment, Congress and successive administrations cobbled together the current policy regime, the one Vilsack extolls. Through the farm bill—the twice-per-decade omnibus federal legislation that governs agriculture policy—we dole out billions of dollars annually (in the form of cash payments and subsidized crop insurance) to incentivize farmers to maximize output of a few commodity crops, including corn and soybeans. Butz’s promise that exports would sop up any surpluses and stabilize prices never panned out. Since a 1975 peak, corn and soybean prices have drifted steadily downward in inflation-adjusted terms, a trend only interrupted by the government-induced corn ethanol boom of the late aughts and, more recently, the pandemic and the Russian invasion of Ukraine, both of which goosed prices for a time. Subsidies (and subsidized crop insurance) keep farmers pumping out corn and soybeans in down years.\n\nSince 1985, the farm bill has also included a “conservation title.” As University of Illinois professor and former USDA official Jonathan Coppess shows in his forthcoming book Between Soil and Society: Legislative History and Political Development of Farm Bill Conservation Policy, the provision emerged in direct response to the jump in erosion caused by the 1970s boom. As a result, the USDA now dangles money to encourage farmers to adopt practices that soften the ecological damage of all-out production—stuff like off-season cover crops, whose foliage buffers soil from the erosive impact of spring rains, and whose roots help hold it in place. The voluntary nature of these programs made them palatable to the agribusiness lobby, and to the farmers whose operations got big enough to survive the post-World War II shakeout. The American Farm Bureau Federation—an insurance juggernaut that’s tightly allied with the agribusiness industry and wields a potent lobbying arm—has helped cultivate a dominant ideology among the corn belt’s large-scale growers wherein subsidies and below-market crop insurance are birthright, while regulation denotes the overreach of jack-booted government scoundrels.\n\nFor every dollar the USDA flashed to entice farmers to grow all-out, it offered less than 13 cents’ worth of incentives to clean up their messes.\n\nUnsurprisingly, the farm bill’s two conflicting policy impulses—dumping dollars on maximized production and pennies on voluntary conservation—don’t come close to balancing out. According to an Environmental Working Group analysis of USDA farm bill spending, between 1995 and 2021, the federal government spent almost $400 billion on production incentives versus $49.4 billion on conservation. That means that over the past quarter-century, for every dollar the department flashed to entice farmers to grow all-out, it offered less than 13 cents’ worth of incentives to clean up their messes. It’s no wonder that the USDA’s two most important conservation programs, the Environmental Quality Incentives Program and the Conservation Stewardship Program, are “routinely oversubscribed and have more applicants than available funding, leaving many producers without critical support,” as a 2023 study by the Bipartisan Policy Center found.\n\nThe case of cover crops illustrates how U.S. farm policy’s skew toward all-out production plays out on the corn belt landscape. In 2021, despite years of being a main emphasis of USDA conservation funding, cover crops had been planted on just 7.2 percent of the Midwest’s acres, a 2022 analysis of satellite data by University of Illinois researchers found. An underfunded, voluntary conservation effort will never be able to rein in the corn-soybean behemoth underwritten by the farm bill’s vast production incentives. As Vilsack likes to point out, the 2022 Inflation Reduction Act bolstered farm bill conservation funding by adding $15.2 billion to the USDA’s budget over the years 2024 to 2031, a bump of an average of $1.9 billion annually over that time frame. That’s a welcome increase, but it’s not nearly enough to put conservation dollars on par with, much less solve, the programs’ oversubscription problem.\n\nI have been hard on Tom Vilsack in this essay, but he’s hardly to blame for the form of agriculture that’s destroying the corn belt’s most crucial resource. After his stint as an agribusiness-friendly governor of Iowa, Vilsack served for eight years as President Barack Obama’s agriculture secretary, and then swished through the revolving door between the USDA and the agribusiness giants it regulates by taking a post as a marketing executive for the dairy industry. He held that job (annual salary: nearly $1 million) until he returned to lead Biden’s USDA. He’s a functionary—a servant to, not a shaper of, the agricultural status quo. But he embodies the Democratic center’s deep inertia on matters of farm policy, and its longstanding alliance with the agribusiness interests that extract profits from the corn and soybean trade. The three dominant providers of seeds and pesticides (Bayer, Syngenta, and Corteva) and the big fertilizer firms (Nutrien, CF Industries, and Mosaic) are like shovel suppliers during a gold rush: They flourish as long as the diggers (in this analogy, farmers) can stay in the game, and farm subsidies ensure that a solid core of them do. Other beneficiaries of the resulting mountains of inexpensive corn and soybeans are the meatpacking titans that turn cheap feed into profitable nuggets, chops, and burgers (Tyson, JBS, and Smithfield).\n\nVilsack and his wing of the party help prop up the Democrats’ end of a bipartisan consensus with old-school GOP legislators like South Dakota Senator John Thune that maintains the soil-ruining status quo. During his presidency, Donald Trump smashed many norms, but the tendency to parachute cash into the corn belt was not among them. “Look, I did get you [farmers] $28 billion, in all fairness, right?” the former President boasted to an Iowa audience ahead of the caucuses in January. “Who the hell else would get you $28 billion from China?” The figure was accurate, Politico reported, but the China bit was a lie. Under Trump, the USDA (not China) paid farmers a $28 billion windfall as compensation for lost business from the then-President’s trade war. Even so, the publication noted, farmers got the same total amount in federal subsidies in Biden’s first three years in office as they did in Trump’s.\n\nAnd yet, Vilsack isn’t wrong in wanting to present the world with a vision for a robust policy for managing agricultural resources in a time of climate change. What would such a thing look like?\n\nAn excellent first step would be to phase out corn-based ethanol, which, as I noted above, now consumes 30 percent of the U.S. corn crop to generate a gasoline additive for internal-combustion cars. If the Biden Administration’s push to make gas-burning cars obsolete by incentivizing a transition to electric vehicles succeeds, ethanol’s days are numbered anyway. As I recently argued in a piece for The New Republic, putting solar panels on just 3 percent of corn belt acres now devoted to corn for ethanol would generate more net energy. Such a move (no easy lift given the lobbying weight behind ethanol) would open vast swaths of land to new uses besides corn.\n\nFrom there, it’s no major puzzle to identify farming methods that preserve soil while also maintaining a bountiful food supply. No-till farming, when combined with cover crops, reliably prevents erosion. Then there’s simple crop biodiversity. At Iowa State University, a group of scientists has been running field experiments since 2001 on the effect of broadening crop rotations beyond just corn and soybeans. Adding oats combined with red clover to the mix, they have shown in a series of papers, slashes erosion and requires a fraction of the water-fouling fertilizer and herbicides needed by the corn-soybean duopoly.\n\nAgroforestry—combining stands of nut or fruit trees with crops or livestock pasture—provides another proven way of holding soil in place while delivering plenty of food. The idea of trees rising from the Midwest’s carpet of corn and soybeans might sound fanciful. But amid the tall-grass prairies and wetlands early settlers encountered, forests covered much of the region. In its eastern part, “open oak woodlands and savannas climbed the hills and lined ridgetops,” and “[d]enser floodplain forests filled river bottoms everywhere,” reports Cornelia Mutel in her book The Emerald Horizon: The History of Nature in Iowa. Restoring some of that could bring dramatic benefits. A 2018 paper by University of Illinois researchers found that growing black walnut groves in rows between annual field crops would deliver more profits to landowners than field-crop-only farming on nearly a quarter of the region’s land.\n\nThe climate and soil-preserving benefits of widespread adoption of agroforestry in the corn belt would be profound. Tree roots dig deep beneath the soil surface and fan out laterally, providing an anchor for soil during heavy rain. They also soak up nutrients all year long, keeping fertilizer from leaching away and polluting water, and their canopy shields crops and soil from the ravages of wind and rains. Meanwhile, they trap carbon in the soil as their leaves fall and decompose and store it in their roots, trunks, and branches.\n\n“If you take government subsidies, you should do something for them.”\n\nDespite mounting evidence of the benefits of diversifying crop rotations and adding trees and solar panels to the corn belt landscape, such practices remain vanishingly rare. Silvia Secchi, a natural resource economist at the University of Iowa, fixates on a policy tweak that could conceivably unleash such innovation. Rather than allowing conservation to be swamped by subsidies, make it a condition for receiving subsidies (a concept I floated in a column for the March/April 2024 edition of Mother Jones). If you’re a farmer and expect support from the USDA, then show the agency your plan for preserving topsoil, minimizing chemical runoff, and slashing greenhouse gas emissions. That way, federal farm programs can achieve their New Deal aims: provide a safety net for farmers, while also helping preserve the soil on which agriculture relies. Participation would be voluntary—farmers could continue to run their operations as they please—meaning the Farm Bureau would have a hard time painting it as a power grab by zealous regulators. The basic principle: “If you take government subsidies, you should do something for them,” Secchi says.\n\nThe idea of tying ecological conditions to farm aid is not novel in the history of U.S. farm policy. Jarred by the erosion crisis of the 1970s, Congress and President Ronald Reagan (over the objections of budget director David Stockman, who wanted to slash funding for all farm programs, Coppess reports) passed the 1985 farm bill, which decreed that if farmers wanted to receive aid to grow crops on land deemed “highly erodible” by the USDA, they had to come up with a plan to retain soil on their fields. “Conservation compliance,” as the policy is known, had to overcome “strong resistance from farm interests” to make it into the farm bill, Coppess writes.\n\nToday, requirements for “highly erodible” land remain in effect, but they are routinely ignored, mainly because of spotty USDA enforcement. A scathing 2003 General Accounting Office report found that the USDA had “not consistently implemented the 1985 [farm bill’s] conservation provisions,” and as a result, “some farmers receive federal farm payments although their soil erodes at higher rates than allowed.” A 2016 report by the USDA’s Office of the Inspector General found much the same situation more than a decade later. And research from Secchi and colleagues found the 1985 compliance rule did little to slow the surge in corn production triggered by the government-backed ethanol boom that began in 2007. The USDA’s own data bring the policy’s failure into view. In Iowa, soil erosion on land deemed “highly erodible” dropped from about 19 tons per acre in 1982 to just over 11 in 1997. Since then, however, the rate has hovered around 12 tons per acre a year—60 times the tolerable rate calculated by Larsen and his team.\n\nThis abject policy failure doesn’t mean the USDA couldn’t in theory successfully enforce conservation compliance for all acres. But doing so would require expanding the agency’s enforcement budget and imposing rigorous congressional oversight, Secchi says.\n\nIt’s impossible to imagine getting there in the current political landscape, dominated by Vilsackian Democrats and Trumpy Republicans. But in the last decade, a new tendency has emerged to challenge this ill-conceived bipartisan consensus. In the 2020 primaries, Senators Elizabeth Warren, Bernie Sanders, and Cory Booker ran for the Democratic presidential nomination on ag-policy platforms promising to bust up the dominant agribusiness behemoths and restore crop diversity in the heartland. In the campaign, Joe Biden took a gentler approach to corporate power in farming, in line with the wisdom of his top rural adviser—none other than Vilsack. Nearly a year before the Iowa caucus, the once and future USDA chief argued on a podcast that the bust-’em-up approach wasn’t a “winning message” in rural areas, because of the “substantial number of people hired and employed by those businesses here in Iowa.” (This was nonsense: Agribusiness firms employ a tiny number of workers in farm states, and actual farmers make up a tiny percentage of the population.) In the end, Sanders finished in a virtual tie for first place in that year’s Iowa caucus, and Warren ended a strong third. Together, they claimed 44 percent of the state’s delegates, nearly three times Biden’s haul.\n\nThese days, Sanders and Warren are formidable players in the Senate, and Booker has a seat on the upper chamber’s agricultural committee, which has a big role in shaping the farm bill, the next version of which is due by September 30, 2024. (The deadline was extended for a year after negotiations around it collapsed in the fall of 2023, a victim of a House Freedom Caucus uprising.) It’s highly unlikely that a more soil-friendly farm bill will emerge this year, but the 2024 election will reshuffle the deck, dealing our soil resources an even worse hand if Trump retakes the White House and/or Republicans gain ground on Capitol Hill.\n\nMeanwhile, there’s that extra $17 billion from the Inflation Reduction Act directed to “climate-smart” farming over the next seven years. It’s not enough to solve the soil crisis, but it’s better than nothing. Already, congressional Republicans are predictably scheming to redirect it to boost no-strings-attached payments to farmers in the farm bill now being hammered out in Congress. Democrats on the Hill have to defend it, and the USDA should make sure that it’s directed toward practices proven to hold soil in place, like the ones described above. As University of Washington geomorphologist David Montgomery noted in his magisterial 2007 book Dirt: The Erosion of Civilizations, “With just a couple feet of soil standing between prosperity and desolation, civilizations that plow through their soil vanish.”",
    "title": "Farm Bill of Goods",
    "date": "2024-03-22T16:30:00.000+02:00",
    "url": "https://democracyjournal.org/magazine/72/farm-bill-of-goods",
    "author": "Delphine d'Amora"
}