{
    "text": "Judge allows appeal of Fani Willis decision Judge allows Trump, others to appeal Fani Willis decision 02:56\n\nWashington — The Fulton County superior court judge overseeing the 2020 election case involving former President Donald Trump will allow the former president and a group of his co-defendants to appeal his decision allowing District Attorney Fani Willis to continue prosecuting the case if special prosecutor Nathan Wade resigned.\n\nSuperior Court Judge Scott McAfee's decision granting the request from Trump and eight of his allies gives them the green light to seek the Georgia Court of Appeals' review of his ruling, which he issued Friday. McAfee said in a brief \"Certificate of Immediate Review\" that he intends to \"continue addressing the many other unrelated pending pretrial motions,\" regardless of whether the appellate court agrees to take up the case.\n\nMcAfee last week rejected a bid by Trump and his co-defendants to disqualify Willis and her office from prosecuting the case because of a romantic relationship she had with Wade, whom she hired as special prosecutor in November 2021. The judge said Willis and her office could stay on the case if Wade stepped aside, which he did hours after McAfee issued his ruling.\n\nMcAfee said in his order Wednesday that the \"state has informed the court that it has complied with the order's demands.\"\n\nSteven Sadow, Trump's lawyer, said in a statement that the defense team is \"optimistic that appellate review will lead to the case being dismissed and the DA being disqualified.\"\n\nThe bombshell revelation that Willis and Wade were romantically involved was first raised by Michael Roman, a longtime GOP operative charged alongside Trump, in a court filing in January. He claimed the two began dating before Wade was hired to work on the investigation into Trump's alleged efforts to overturn the results of the 2020 election in Georgia, and alleged that Willis financially benefited from the relationship. Trump and seven others joined Roman's effort to remove Willis and her office from the case and have the charges against them dismissed.\n\nFulton County District Attorney Fani Willis testifies during a hearing on the Georgia election interference case, Thursday, Feb. 15, 2024, in Atlanta. Alyssa Pointer / AP\n\nWade and Willis admitted they were romantically involved, but denied any wrongdoing. Willis said their relationship ended last summer.\n\nWhile McAfee allowed Willis to remain on the case so long as Wade withdrew, he offered a scathing rebuke of the pair. The judge chided the district attorney for what he said was a \"tremendous lapse in judgment\" and criticized the \"unprofessional manner\" of her testimony during an evidentiary hearing last month, during which Wade and Willis separately answered questions from prosecutors and defense attorneys about their relationship.\n\nMcAfee said that while he was not able to \"conclusively establish\" when Wade and Willis' relationship turned romantic, \"an odor of mendacity remains.\"\n\n\"Reasonable questions about whether the District Attorney and her hand-selected lead [special assistant district attorney] testified untruthfully about the timing of their relationship further underpin the finding of an appearance of impropriety and the need to make proportional efforts to cure it,\" McAfee wrote.\n\nWade offered his resignation to Willis on Friday afternoon, writing in a letter to her that he was stepping down from his role as special prosecutor \"in the interest of democracy, in dedication to the American public, and to move this case forward as quickly as possible.\"\n\nWillis accepted his resignation and praised Wade in her own letter for his \"patriotism, courage and dedication to justice\" in the face of threats against himself and his family, \"as well as unjustified attacks in the media and in court on your reputation as a lawyer.\"\n\nTrump faces 10 counts in the sprawling racketeering case brought by the Fulton County district attorney, who claims the former president and his allies engaged in a scheme to reverse the outcome of the last presidential election in Georgia. He has pleaded not guilty to all charges. Eighteen others were charged alongside Trump, though four accepted plea deals from prosecutors. All of the remaining 14 co-defendants have pleaded not guilty.\n\nJared Eggleston contributed to this report.",
    "title": "Trump can appeal decision keeping Fani Willis on Georgia 2020 election case, judge says - CBS Colorado",
    "date": "2024-03-20T16:23:00.000+02:00",
    "url": "https://www.cbsnews.com/colorado/news/trump-can-appeal-keeping-fani-willis-on-georgia-election-case",
    "author": "@@MelissaQuinn97"
}