{
    "text": "Here’s a mind-numbing, are-you-for-real-asking-this question that Donald Trump should not be asking, so of course he’s asking it—in all caps, naturally.\n\n“ARE YOU BETTER OFF THAN YOU WERE FOUR YEARS AGO?” he posted Monday on his Twitter-knockoff site Truth Social.\n\nTake a moment to check your calendar, do the math, count on your fingers and yes, that’s right: Four years ago was right smack dab in the middle of March 2020, when we—as in, every single literal one of us in the country—were locked in our homes, hiding from a deadly pandemic.\n\nNow take another moment to appreciate the Biden campaign’s answer to that question.\n\nx Donald, I’m glad you asked. pic.twitter.com/janV4f4L3p — Joe Biden (@JoeBiden) March 21, 2024\n\nAre we better off than we were four years ago? When we had empty shelves in supermarkets? The toilet paper and mask shortages? Constant, soul-crushing fear?\n\nAnd the death. So much death. One thousand people a day. There were mobile morgues in New York City desperately trying to keep up with all the dead bodies.\n\nAnd there was Trump, callously, viciously not giving a damn, insisting it was all going swimmingly, snapping at reporters who wanted to know what the president of the United States had to say to terrified Americans.\n\nBiden’s ad brings it all back.\n\n“Yeah, no, I don’t take responsibility at all,” Trump said four years ago. “We’re doing, I think, really, really well.”\n\nBut most of us were not doing really, really well. And those of us who remember are the lucky ones because we’re the ones who survived.\n\nBut none of that mattered to Trump four years ago.\n\nAsked about all that death, he said, “It is what it is.”\n\nNow, four years later, Trump thinks it’s a great idea to remind people of where they were four years ago. Biden’s ad suggests it’s really, really not.",
    "title": "Biden gives blistering answer to Trump's very dumb question",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.dailykos.com/stories/2024/3/21/2230803/-Biden-gives-blistering-answer-to-Trump-s-very-dumb-question",
    "author": "@kailijoy"
}