{
    "text": "Gov. DeSantis signed bill that prevents homeless camping in public spaces Gov. DeSantis signed bill that prevents homeless camping in public spaces 02:28\n\nMIAMI BEACH - Florida's homeless will be banned from sleeping on sidewalks and in parks and other public spaces under a law signed Wednesday by Republican Gov. Ron DeSantis. It also promises the homeless greater access to services for issues such as substance abuse and mental health problems.\n\nThe state Department of Children and Families would oversee local governments that set up designated areas for the homeless to camp for up to a year under the new law, which takes effect Oct. 1. Anyone using those encampments would be prohibited from using alcohol or illegal drugs, with sanitation and security to be provided.\n\nThe encampments would be created if local homeless shelters reach maximum capacity. The law requires regional entities to provide necessary behavioral treatment access as a condition of a county or city creating an encampment.\n\nAllowing the homeless to camp in public spaces affects the local quality of life, can be a nuisance for businesses and makes it more difficult to deliver them needed services because they're scattered, DeSantis and other supporters of the measure said at a news conference in Miami Beach.\n\n\"I think this is absolutely the right balance to strike,\" DeSantis said. \"We want to make sure we put public safety above all else.\"\n\nMiami Beach passed a similar resolution back in October of last year. Miami Beach Mayor Stephen Meiner called the ordinance passionate legislation.\n\n\"It helps people. It's increasing funding for shelters. It's increasing funding for mental health treatment. It's increasing funding for substance abuse treatment. This will absolutely help people,\" he said.\n\nRon Book with the Miami-Dade County Homeless Trust said the county has done a good job of managing the homeless population.\n\n\"The numbers of individuals experiencing homelessness all across America are going up, except in Miami-Dade County, where we continue to manage the population, moving people in and off the street in an expeditious fashion,\" he said.\n\nBook said the legislation needs to go one step further.\n\n\"This is but one piece to the puzzle. Hopefully, shortly, the governor will also sign the changes that were made to the Baker Act that begin to address behavioral health issues that we know we have with homeless individuals in our state,\" he said.\n\nDuring the Legislature's latest session, Florida's homeless population was estimated to be about 30,700 in 2023. That's a fraction of the homeless populations in many large U.S. cities, but the law's sponsors said it could worsen because of Florida's rapid population growth.\n\n\"This bill will not eliminate homelessness. But it is a start,\" said Republican state Rep. Sam Garrison. \"And it states clearly that in Florida, our public spaces are worth fighting for.\"\n\nOpponents of the law say it is meant to round up the homeless and hide them from public view.\n\n\"This bill does not and it will not address the more pressing and root cause of homelessness,\" said Democratic state Sen. Shevrin Jones during a debate this year. \"We are literally reshuffling the visibility of unhoused individuals with no exit strategy for people who are experiencing homelessness.\"\n\nDeSantis, however, said the new law is a unique approach in pledging to provide the services that homeless people often need.\n\n\"This is going to require that the services are there to help people get back on their feet,\" the governor said. \"I think it's important that we maintain the quality of life for the citizens of Florida.\"\n\nBeginning in January 2025, the law will allow residents, local business owners and the state attorney general to file a lawsuit to stop any city or county from allowing the homeless to camp or sleep on public property.",
    "title": "Gov. DeSantis signs measure banning homeless from sleeping in public spaces",
    "date": "2024-03-20T20:16:00.000+02:00",
    "url": "https://www.cbsnews.com/news/florida-homeless-to-be-banned-from-sleeping-in-public-spaces-under-desantis-backed-law",
    "author": null
}