{
    "text": "Republicans in the U.S. House of Representatives seeking to chart a part forward in their impeachment probe of President Joe Biden will on Wednesday question two former associates of his son Hunter.\n\nHouse Republicans say the president and members of his family improperly profited from policy decisions in which Biden, a Democrat, participated while vice president from 2009-17.\n\nADVERTISEMENT\n\nBut they have yet to produce evidence to show that the president personally benefited from the actions of the family. The White House has said the investigation is baseless and politically motivated.\n\nYour subscription could not be saved. Please try again. Your subscription has been successful. Subscribe to our daily newsletter SIGN ME UP\n\n“It is obviously time to move on, Mr. Speaker. This impeachment is over. There is too much important work to be done for the American people to continue wasting time on this charade,” White House counsel Edward Siskel wrote in a letter to House Speaker Mike Johnson, a Republican, last week.\n\nThe House Oversight Committee summoned two former business associates of Hunter Biden’s, Tony Bobulinski and Jason Galanis.\n\nGalanis, who is serving a prison sentence related to fraud charges, was expected to appear virtually. Both have previously appeared for closed-door interviews with the panel.\n\nThe panel had invited Hunter Biden and business associate Devon Archer, but both declined. In a lengthy back-and-forth with the committee, Hunter Biden initially insisted on a public hearing before finally submitting to a closed-door interview.\n\nDemocrats on the House panel had invited Lev Parnas to the hearing.\n\nA businessman, Parnas worked with former President Donald Trump’s then-lawyer, Rudy Giuliani, to try to uncover evidence of wrongdoing by Biden and his family in Ukraine ahead of the 2020 election in which Biden defeated Trump, a Republican.\n\nADVERTISEMENT\n\nIt was unclear when House Republicans would decide on next steps in their probe. James Comer, the Oversight Committee chair, said publicly that he was considering making criminal referrals instead of drafting articles of impeachment, though he has yet to say who or what crimes those referrals would target.\n\nThe Republicans’ slim House majority will likely make impeachment difficult. The chamber held a second vote last month to impeach Alejandro Mayorkas, the administration’s top border official, after a first vote failed.\n\nThe Democratic-led Senate, which has yet to take it up, will almost certainly vote to acquit Mayorkas.",
    "title": "US House panel holds Biden impeachment hearing",
    "date": "2024-03-20T07:55:00.000+02:00",
    "url": "https://usa.inquirer.net/146561/us-house-panel-holds-biden-impeachment-hearing-but-next-steps-unclear",
    "author": "Reuters/INQUIRER.net U.S. Bureau"
}