{
    "text": "United Auto Workers President Shawn Fain testified to a Senate committee on March 14 that a four-day workweek would benefit his members and millions of other workers.\n\nG. Roger King, a lawyer with the lobbying organization for big corporate human resources officers, assured the members of the Senate Health, Education, Labor and Pensions Committee that he and his colleagues were fully on board with the concept of a four-day work week.\n\nHis HR colleagues, he told the senators at a March 14 hearing, are “not opposed to 32-hour work weeks or other nontraditional work week configurations” ... in principle.\n\nUnfortunately, he said, a four-day week would only exacerbate existing labor shortages, would be a “backdoor” increase in the minimum wage, and in any case should be driven by “traditional market forces,” not mandated by federal law.\n\nAdvertisement\n\nWhen my members look back on their lives, they never say ‘I wish I had worked more.’ ... They say, ‘I wish I had more time.’ — United Auto Workers President Shawn Fain\n\nAre you surprised that big employers would fight a shorter work week for their employees? Me neither.\n\n“As a general rule,” says labor historian Erik Loomis of the University of Rhode Island, “employers are opposed to every labor reform. They always say it’s going to be a disaster for the economy, and it never is.”\n\nNewsletter Get the latest from Michael Hiltzik Commentary on economics and more from a Pulitzer Prize winner. Enter email address Sign Me Up You may occasionally receive promotional content from the Los Angeles Times.\n\nThat’s been true of every increase in the minimum wage, and it was true of the last government-mandated contraction of the workweek — the Fair Labor Standards Act of 1938, which established the minimum wage, banned child labor in factories and mandated an eight-hour workday and 40-hour workweek, after which rank-and-file workers are entitled to time-and-a-half pay.\n\nThe workweek is now back on the front burner, in part because unions are feeling their oats lately, and also because Sen. Bernie Sanders (I-Vt.), the HELP Committee chairman, has introduced a bill to mandate a 32-hour workweek with no loss of pay for those transitioning from the traditional 40 hours.\n\nAdvertisement\n\n“As a result of the extraordinary technological transformations that we have seen in recent years, American workers are now over 400% more productive than they were in the 1940s,” Sanders said in opening the hearing. “Almost all of the economic gains of that technological transformation have gone straight to the top, while wages for workers have remained stagnant, or even worse.”\n\nHe’s right. Rank-and-file worker wages have barely kept up with inflation, while CEO pay has rocketed into the stratosphere. In 1965, the average chief executive’s pay at the 350 largest U.S. companies was about 20 times the average wage of their rank-and-file workers, according to the labor-affiliated Economic Policy Institute. In 2022, it was 344.5 times as much.\n\nWhat paid for that run-up in executive pay was a massive increase in U.S. worker productivity. But as Sanders observed, the average worker received barely a taste of the gains.\n\nAs for King’s hand-wringing about a “backdoor” increase in the minimum wage, would that it were so. The federal minimum wage was last raised in 2009, to $7.25 per hour from $6.55. Since then, Congress hasn’t mustered the votes for a further increase while the wage has been devastated by inflation.\n\nThe value of the wage in 2022 dollars peaked at $13.46 in 1968, when the nominal wage was $1.60. In other words, the hourly wage of workers earning the federal minimum has been cut almost in half in the last 56 years.\n\nViewing the four-day workweek exclusively as an employer cost is the wrong way to think about it, however. Indications are that it can be a boon to employers.\n\nAdvertisement\n\nPilot programs in the U.S., Europe, South Africa and Brazil have found that worker productivity rises — in other words, employers get more out of their workers for the same pay.\n\nIn the U.S. and Canada, according to Boston College sociologist Juliet Schor, who studied pilot programs established by the nonprofit 4 Day Week Global, more than two-thirds of workers showed less job burnout; anxiety and fatigue declined for 40%; and 60% reported more success achieving a work-family balance. Almost every participant wanted to continue the program.\n\n“Workers tell us about improvements in mental and physical health, ability to spend time with family, and finally getting a chance for time for themselves,” Schor told the HELP Committee. The changes persisted through the end of the yearlong study period.\n\nBusiness Column: American unions have finally remembered how to win The UAW’s great new contracts with GM, Stellantis and Ford show that union solidarity and concrete goals bring major victories for workers for the first time in decades.\n\nMore than 90% of the 202 companies in Schor’s sample continued the program past the one-year mark. And why not? Among the U.S. and Canadian companies in the sample, turnover fell by more than 20% and absenteeism by 39%.\n\nNone of that might stem the knee-jerk opposition to the four-day week among businesses and their water carriers on Capitol Hill.\n\n“A 32-hour workweek with no loss in pay? Who wouldn’t want this?” asked Sen. Bill Cassidy (R-La.), the ranking Republican on Sanders’ committee. “But unfortunately, we live in reality.”\n\nAdvertisement\n\nCassidy did the raw math and declared that “the government mandating a 32-hour workweek while requiring businesses to increase pay at least an extra 25% per hour of labor will destroy employers, forcing them to either ship jobs overseas or dramatically increase prices to try and stay afloat.” Naturally, he blamed President Biden: “The Biden administration has been dumping gasoline on his inflation fire. This would be napalm.”\n\nCassidy talked as though Americans’ average workweek derived from some sort of immutable law that could be tampered with only at our economic peril.\n\nThat’s nonsense. On average, American workers spend 400 more hours on the job per year than Germans — that works out to about 1½ hours more per working day. Americans work 200 hours a year more than workers in France, the Netherlands and Britain, Schor testified.\n\nThe result, she said, is “extraordinary levels of stress, burnout and exhaustion for American workers.”\n\nCassidy also called the four-day workweek a “fringe proposal.” But it’s nothing of the kind. A 32-hour, four-day workweek has been talked about for decades. Even Richard Nixon, as vice president in 1956, said he foresaw a four-day workweek “in the not too distant future.”\n\nTo be fair, Nixon made his prediction as a way to boast about economic growth under Eisenhower and make the case that the Democratic presidential candidate, Adlai Stevenson, would institute policies that would hobble the “unbelievably prosperous” future that would unfold in a second Eisenhower term.\n\nAdvertisement\n\nAs it happens, by the time Nixon entered the White House on his own in 1969, he was no longer promising a four-day week.\n\nHistory tells us that employers always view changes in work conditions to benefit workers as unimaginably radical — “fringe” proposals, to use Cassidy’s term.\n\nThat was the case in the 1870s and 1880s, when the eight-hour day became the rallying cry for the Knights of Labor, the first truly national industrial labor union.\n\nThe eight-hour campaign contributed to the Knights’ massive expansion, which in turn fostered a misimpression that it could launch and win a strike against the railroad network controlled by financier Jay Gould.\n\nBut Gould outmaneuvered the union leadership into reaching a settlement with major union concessions. The strike collapsed, followed by the Knights themselves.\n\nThe eight-hour day came off the front burner. A major restructuring of the workweek didn’t occur until 1914, when Henry Ford shocked the nation’s industrial establishment by instituting a $5 daily wage at his factories — along with a cut in the workday to eight hours from nine.\n\nAdvertisement\n\nEmployee turnover fell and factory productivity soared, in part because Ford could now run three shifts instead of two, which enabled him to fill more orders for his popular mass-market Model T.\n\nIt’s true that a shift to a four-day, 32-hour week will cause some disruption in the employment world; Sanders’ bill would provide for a four-year transition period.\n\nAmong the important but often overlooked considerations yet to be worked out, Loomis says, is the impact on service workers. As white-collar and industrial workers receive an extra day of leisure, demand for services will obviously increase.\n\n“It makes a ton of sense for the white-collar class and traditional factory workers,” he told me. “But what needs to be worked out is how it will affect the service sector, where there’s already a shortage of workers. Where do those workers come from? Do they get a 32-hour week?” Increased pay would be likely, Loomis says — “they would have even more power to fight for higher wages.”\n\nAnother source would be immigrants by reopening the border. That’s impossible just now, because border politics have lost any semblance of sanity.\n\n“Even today, the service economy is an afterthought,” Loomis says. “That doesn’t make a lot of sense, given the reality of what the labor market actually looks like today.” If the advent of a four-day week prompts policymakers to pay attention to this all-important sector, that wouldn’t be a bad thing.\n\nAdvertisement\n\nIt looks as if the American labor movement is beginning to take on the four-day workweek as its cause for the present day.\n\n“When my members look back on their lives,” United Auto Workers President Shawn Fain told Sanders’ committee, “they never say ‘I wish I had worked more.’” They never say, ‘I wish I’d made more money.’ They say, ‘I wish I had more time.’”\n\nPaying for it means directing more of the productivity gains that have fattened top executives and Wall Street financiers to the working class.\n\nFain is right to cast the goal of a four-day workweek in the context of economic inequality. “We know with technology, we can do more with less,” he said. “It is the mantra we hear from management every day, and yet it never benefits the worker.”\n\nHe concluded, “Those who profit off of the labor of others have all the time in the world. While those who make this country run, who build the products and contribute the labor, have less and less time for themselves, for their families, and for their lives.”",
    "title": "Hiltzik: Why do Americans work so much? - Los Angeles Times",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.latimes.com/business/story/2024-03-21/column-the-8-hour-work-day-was-the-paramount-goal-of-unions-in-the-1800s-will-they-make-the-four-day-week-their-cause-today",
    "author": "Michael Hiltzik"
}