{
    "text": "CNN —\n\nFani Willis, the embattled Fulton County District Attorney, plans to press ahead with her goal of putting Donald Trump on trial before the November election, and intends to ask the judge presiding over the Georgia criminal case to schedule a trial date as soon as this summer, according to three people familiar with her thinking.\n\nIt’s a bold move considering the hurdles Willis faces in getting the case back on track after a two-month detour revealed embarrassing details of her personal life, damaging her credibility in the eyes of Judge Scott McAfee and leaving her politically vulnerable ahead of her own reelection bid in November.\n\nWillis narrowly avoided being disqualified over her romantic relationship with lead prosecutor, Nathan Wade, who resigned last Friday following a blistering rebuke from McAfee, publicly questioning both Wade and Willis’s decision-making. On Wednesday McAfee granted requests from Trump and his co-defendants to seek an appeal, meaning the threat of disqualification still hangs over Willis.\n\nGeorgia Republicans continue to investigate allegations that Willis benefitted financially from her relationship with Wade. A state Senate committee could use its subpoena power to unearth new information and plans to meet several more times to hear from additional witnesses.\n\nRepublican Gov. Brian Kemp last week signed changes into law that give a state commission the power to investigate Willis and authority to remove or sanction state prosecutors.\n\nWillis’s rock-solid political standing has also been shaken. This month, Democrat Christian Wise Smith, a former Fulton County prosecutor and Atlanta solicitor, launched a campaign challenging Willis in the May 21 primary. Republican lawyer Courtney Kramer, an attorney who worked in the Office of the White House Counsel under Trump, has also joined the race.\n\nAnd then there’s the Supreme Court’s looming decision on whether the former president enjoys absolute immunity from special counsel Jack Smith’s election subversion charges, one that could affect various criminal proceedings against Trump. Any ruling in favor of the former president from the high court could be a major blow to both criminal cases against Trump related to the 2020 election, including in Georgia. Hearings begin in April, with a decision expected by the end of June.\n\nSources close to the Fulton County DA’s office say the uncertainty of the federal case does not prevent McAfee from setting a trial date. Fulton County prosecutors said in a recent email to defense attorneys they planned to respond to Trump’s immunity claim within two weeks of the Supreme Court’s decision, according to a source familiar with the correspondence.\n\nProsecutors believe McAfee can put the immunity issue to the side until the Supreme Court rules while, in the interim, ensuring the Georgia case is as close to ready as possible if the justices decide Trump can be prosecuted, multiple sources familiar with the thinking inside Willis’s office tell CNN.\n\nMultiple sources close to Willis acknowledge the last two months have been a major distraction, one they admit was brought on by her own actions but also enabled, they argue, by how much leeway McAfee gave defense attorneys to attack Willis during the disqualification proceedings.\n\n“Basically, this is a two-month sideshow that the judge should have not even let happen,” one Willis ally told CNN. “But it’s over and the judge finally came to the right decision … and so now we’re back to where we never should have left, which is these people were under felony indictment. Let’s get a trial date.”\n\nSources close to Willis tell CNN that the DA’s office is effectively ready to go to trial. Willis has said she needs only 30 days to prepare once a date is set. Defense attorneys have had since September to review the evidence and prepare their own arguments.\n\nWillis had previously asked for a trial to start in August 2024. Sources tell CNN she plans to re-up the request now that she has survived the chaotic two months – which saw the entire Fulton County DA’s office face disqualification and threatened to derail the entire case.\n\nIt’s unclear exactly when Willis will make her second request of McAfee to set a trial date. The Fulton County District Attorney’s office has declined to comment to CNN for this story.\n\nAshleigh Merchant, the defense attorney who led the effort to disqualify Willis, was asked by CNN’s Laura Coates on Wednesday night if the defense was trying to delay the trial until after the upcoming 2024 election.\n\n“I would very much like to go to trial,” Merchant said, adding that the defense has a right for a “fair and impartial” prosecutor to evaluate the case. “That didn’t happen in this case,” Merchant said.\n\nWillis and her team are aware of the political damage caused by the last two months but argue that their job is to prosecute the facts of the criminal case against Trump and his co-defendants, not worry about the political reverberations it causes.\n\nNathan Wade attends a hearing on February 27 in Atlanta. Brynn AndersonPool/Getty Images\n\n“There was definitely damage done,” said former Dekalb County District Attorney Robert James, who watches the case closely and told CNN that even if Willis can get the case to trial before November’s election, picking a jury alone could take months, especially with so many defendants involved.\n\n“Ultimately some of the prospective jurors that watched those hearings have formed negative opinions of the DA and this case,” said James. “It was always going to be difficult to get a fair and impartial jury. The hearing on the motion to disqualify just made it more difficult.”\n\nOne source told CNN that Willis and her team realize the damage inflicted could diminish the public’s perception of the Georgia case ahead of what is likely to be a polarizing 2024 election. But that person also betrayed a sense of anger over the spectacle that was made of the televised hearings.\n\n“You have people covering this, frankly, like it was sports or politics,” the person said. “It deals with political activity, but there’s not an election going on in court. There are elections going on, but not in court.”\n\nJudge ‘rolling up his sleeves’\n\nSince his disqualification ruling, McAfee has indicated he is ready to continue moving forward, with sources familiar with the case saying he has asked attorneys on both sides about how to proceed with pre-trial motions.\n\nRecent communications from McAfee include questions about which motions needs oral argument and what needs more briefing before he can rule on them, one source told CNN.\n\nFulton County Superior Judge Scott McAfee Alex Slitz/Pool/Getty Images/File\n\n“He’s rolling up his sleeves,” one source said about McAfee.\n\nThat’s not to discount the fallout from last week’s 23-page opinion from McAfee, which amounted to a highly-critical rebuke of Willis’s actions, describing her relationship with Wade being the result of “bad choices.”\n\nMcAfee wrote that Willis’s comments at an Atlanta-area church in January about the case were “legally improper.”\n\nHe also warned of the potential for a future gag order against Willis, but said her church comments were far enough removed from a jury trial that it would not “establish a permanent taint of the jury pool.”\n\nMichael Moore, a CNN legal analyst and former US attorney in Georgia, questions whether Willis should even remain on the case, and says if she does, she will need to show McAfee and the public that she is in complete “control.”\n\n“There is no question that the progress of the case has been impeded by unnecessary speed bumps and detours,” Moore said. “She simply cannot afford another unforced error that results in additional unfavorable comments questioning her candor or judgment.”",
    "title": "Exclusive: Georgia DA plans to press ahead in effort to put Trump on trial before election",
    "date": "2024-03-21T19:21:00.000+02:00",
    "url": "https://edition.cnn.com/2024/03/21/politics/fani-willis-trump-georgia-trial/index.html",
    "author": "Zachary Cohen,Jason Morris"
}