{
    "text": "President Biden is using the anniversary of the passage of the Affordable Care Act (ACA) to bash former President Donald Trump’s record on health care and capitalize on his threat to repeal the law.\n\nIn a new digital ad released Friday ahead of the 14thth On the anniversary of the law’s enactment, the Biden campaign sought to highlight Trump’s repeated threats to repeal it and emphasize the consequences if he wins a second term.\n\nThe video, titled “Flatline,” includes audio of Trump criticizing Obamacare, with on-screen text detailing what would happen if the law was repealed.\n\n“Donald Trump tried to take away our health care,” the ad read. “He failed. But he comes back for it.”\n\nThe message is played over a heart monitor image that eventually flattens out.\n\nAs president, Trump is one vote away from repealing the law and has said he would like to try again.\n\n“If he succeeds…45 million Americans could lose their health insurance,” the ad said. “And you just might be one of them.”\n\nThe campaign says the ads will air across battleground states in English and Spanish on digital platforms including Meta, YouTube and connected TV.\n\nIn addition to the ad, the campaign will hold a digital rally this weekend featuring former President Barack Obama and former House Speaker Nancy Pelosi (D-Calif.). The nationwide appeal is aimed at “mobilizing supporters and volunteers to protect the ACA from President Trump’s attacks,” the campaign said.\n\nThe Democratic National Committee is also running digital ads in battleground states denouncing President Trump’s efforts to repeal the ACA.\n\nThe ads will be displayed on local newspaper websites in Pennsylvania, Arizona, Nevada, North Carolina, Georgia, Michigan and Wisconsin, which will be carried over to digital homepages.\n\nThe Biden campaign and its Democratic allies are eager to take on President Trump over Obamacare after the Republican nominee resurfaces with a view to repealing the law.\n\nMore than 40 million people have health insurance through Obamacare, and this law is more popular than ever. Biden campaign officials believe maintaining the system is a key political challenge as press requests reach a record high of 21.3 million in 2024.\n\nBiden and Democrats have long felt that health care is a win-win issue for them, and the president has turned to the pocketbook of cutting payroll costs amid broader concerns about the economy.\n\n“We cannot take this progress for granted. Extreme MAGA Republicans have voted to repeal the Affordable Care Act more than 50 times. Just this week, President Trump’s allies in the House of Representatives has proposed a budget that guts this lifesaving bill,” Biden said in a statement Friday, referring to the Republican Study Committee’s budget proposal.\n\n“It is no exaggeration to say that millions of people will have affordable health care in November. I will repel the attacks of MAGA Republicans and make health care in America a right, not a privilege. We are more determined than ever to do so,” Biden said.\n\nThe Biden campaign is also trying to capitalize on President Trump’s “am I better” argument.\n\nOn Friday, Biden’s team highlighted a clip from a press conference held at the beginning of the coronavirus pandemic exactly four years ago. At the time, President Trump said he wanted to “end” Obamacare and reiterated his support for a lawsuit seeking to repeal the law. .\n\n“Taking health care coverage away from millions of Americans is always a bad idea, but President Trump’s attempt in March 2020, when thousands of Americans were dying, could not have come at a worse time.” said the camp. “Donald Trump and his campaign continue to ask the country if we are better off today than we were four years ago. The answer, as we repeat, is yes.”",
    "title": "Biden campaign uses Obamacare anniversary to grill President Trump on health care issues",
    "date": "2024-03-22T17:48:00.000+02:00",
    "url": "https://independantexpress.com/biden-campaign-uses-obamacare-anniversary-to-grill-president-trump-on-health-care-issues",
    "author": "INDEPENDANT EXPRESS"
}