{
    "text": "Biden Campaign Distances Itself From Mysterious Big Dem Donor ‘Chairman G’\n\nAuthored by Soobin Kim and Bradley Hope via whalehunting.projectbrazen.com,\n\nLast fall, we reported on a man named Gaurav Srivastava who pretended to be a CIA operative to allegedly fleece the sanctioned Dutch oil trader Niels Troost. The ruse was simple, according to extensive recorded conversations: hand over half your company to me, a secret spy, and I’ll protect you from the US government because … I’m a secret spy.\n\nIn the following months since our original article, it emerged that Srivastava – or “Chairman G,” as he likes to be called – is a big time political donor in the United States.\n\nWhale Hunting can exclusively reveal that FBI agents in Los Angeles have been interviewing Srivastava’s current and former associates about his campaign donations, claims of being a federal officer and other financial affairs.\n\nWe also confirmed from a staff member for the Washington State Democratic Party that the Biden campaign is in the process of quietly refunding thousands of dollars of his political donations.\n\nThe FBI inquiries — ongoing for last several months — may lead nowhere, but the Biden campaign’s decision to start refunding donations suggests there are deeper issues afoot for Srivastava.\n\n“All allegations raised in this story are false,” a spokesman for Srivastava told us (full statement and more details on the news after the jump).\n\nSource: Sponsored content on LA Weekly\n\nThe culmination of Srivastava’s rise to public life came alongside a more than $1 million donation in 2022 to the Atlantic Council, a DC-based think tank. The money underwrote a conference in Bali, where he was a “co-host” and rubbed shoulders with business magnates, political honchos and John Legend.\n\nBut that relationship isn’t going smoothly. The Atlantic Council terminated its relationship with Srivastava, Politico reported last month, and returned additional funds donated by Srivastava in 2023.\n\n“We made the decision to terminate our relationship with Mr. Srivastava in May 2023 upon learning new information because of our donor review process. For example, we learned that The Gaurav & Sharon Srivastava Family Foundation was not an established 501C3 in April of 2023, despite Mr. Srivastava’s representation to the Council that this was a registered foundation,” the spokesperson told Politico.\n\nSrivastava’s lawyer told Politico the Atlantic Council made the decision after they “disagreed” about how a gift would be implemented. (Small note: Recipients of gifts usually try very hard to implement the handover of gifts.)\n\nAlongside his campaign to solve global food security he also became a big spender on political campaigns. Among Srivastava’s key advisors for how to best disperse funds for political purposes were Greg Schultz (Biden’s 2020 campaign manager) and Ret. General Wesley Clark. They didn’t respond to requests for comment.\n\nThe Federal Election Commission’s database of individual contributions shows that Srivastava contributed at least $1 million to political campaigns and committees in the United States. As an Indian national he is eligible to donate to political campaigns as a Green Card holder. Lo and behold, the donations led to a photo op with Biden which you can find here.\n\nSince 2022, Srivastava has made sizeable donations – including over $500,000 to the Democratic Congressional Campaign Committee and $500,000 to Senate Majority PAC.\n\nOne mystery we are continuing to investigate: Whale Hunting discovered publicly available evidence suggesting Srivastava contributed over $116,000 using the personal details of an individual with the same name who resides in the same city. The funds were donated under the previous employer, occupation and mailing address of the namesake, who denies making the donations.\n\nIt’s unclear how those donations were made. Impersonating another individual to make a political contribution is strictly prohibited by law.\n\nThe single biggest recipient for the donations made with the namesake’s personal details was the Biden Victory Fund, a joint fundraising committee for Joe Biden’s 2024 re-election, which received $50,000. About a dozen state Democratic parties across the U.S. also received funds through the Biden Victory Fund.\n\n“The Biden campaign is aware of the issue and the donation is in the process of being refunded,” a staff member with Washington State Democratic Party, which received these funds, told Whale Hunting in an email.\n\nIt’s unclear the exact allegations the FBI is investigating, but among the questions they’ve presented current and former associates of Srivastava have been queries about his political spending, source of funds, involvement in international money transfers and other topics related to the allegations already aired publicly about Srivastava in a litany of lawsuits.\n\nSrivastava’s spokesman’s full comment here:\n\nAll allegations raised in this story are false. The source for this story and others, including 87 paid stories on obscure websites, is tied to a Russian asset facilitating the unfettered trade of Russian oil as made clear by the U.K. sanctions. There’s a direct through-line between Russia, a barrel of oil and the high price of gas at the pump squeezing the American consumer. The slanderous suggestion of a fabricated relationship between Mr. Srivastava and a U.S. intelligence agency was orchestrated by the same Russian asset relied on as a source for your stories and designed by that Russian asset to put a target on his back, threatening the safety of him, his friends and family.\n\nSo if your year is off to a bad start, think about what Srivastava is now dealing with: being on the Feds’ radar, juggling a glut of lawsuits brought on by all the people he’s allegedly stiffed – from his former interior designer to former landlord to former business partners – and witnessing the collapse of his carefully crafted reputation.\n\nIn the meantime, Whale Hunting will be chasing this story to fill its gaping plot holes, one among them being where on earth Chairman G got the funds to make the donations in the first place. If you have any insight, please get in touch!",
    "title": "Biden Campaign Distances Itself From Mysterious Big Dem Donor 'Chairman G' — THE MILLENNIAL PRESS",
    "date": "2024-03-21T02:44:00.000+02:00",
    "url": "https://themillennialpress.com/2024/03/20/biden-campaign-distances-itself-from-mysterious-big-dem-donor-chairman-g",
    "author": "@Milennial_con"
}