{
    "text": "Izuba, c’est une maison d’édition.\n\nC’est également un portail d’information, récupérant les articles de nombreux sites internet, et un site participatif, sur lequel vous pouvez proposer des articles.\n\n« Nous nous efforçons de publier et de diffuser des informations fiables et pertinentes sur la région des Grands Lacs africains (RDCongo, Rwanda, Ouganda, Burundi, ...), l’Afrique et le monde. »\n\nNous veillons à ne pas référencer de sites aux contenus négationnistes, racistes, ethnistes, homophobes, diffamatoires, ..., mais nous attirons l’attention de nos visiteurs sur le fait que nous ne pouvons pas surveiller en permanence le contenu de la totalité des sites que nous référençons et que nous en appelons ainsi à leur vigilance pour nous signaler tout contenu problématique.\n\nNous encourageons toutes les personnes intéressées par les problématiques et thématiques que nous traitons à s’inscire sur ce site et/ou à nous faire parvenir des informations, des textes d’analyse, des documents, ... que nous ne manquerons pas de publier sur cet espace participatif.\n\nVous êtes inscrit-e sur Izuba\n\nSi vous êtes inscit-e sur ce site, vous avez le statut d’invité-e (visiteur identifié).\n\nVous pouvez :\n\n✔ commenter les sites, les rubriques et les articles ;\n\n✔ partager les articles, sites et articles référencés les plus intéressants ;\n\n✔ créer votre propre portail, votre espace dédié, avec vos sites et rubriques favorites, constamment mis à jour avec les derniers articles qui y sont publiés ou syndiqués.\n\nParticipez !\n\nNous invitons tous ceux qui veulent participer plus activement à la création d’un outil de communication participatif à nous contacter.\n\nSi vous voulez participer plus activement à la vie du site, vous pouvez demander le statut de rédacteur ou d’administrateur.\n\nVous pourrez alors, en plus :\n\n✔ proposer des brèves et des articles mais aussi des sites à référencer ;\n\n✔ administrer une ou des rubriques (thématique, pays, ...) ;\n\n✔ proposer de nouvelles thématiques, des dossiers à ajouter au site ;\n\n✔ proposer et modérer des discussions (Forum) ;\n\n✔ proposer et modérer des discussions en direct (Tchat) ;\n\n✔ administrer un blog personnel.",
    "title": "Trump told Pence certifying election would be ‘political career killer', valet says - The Guardian (Europe)",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://izuba.info/trump-told-pence-certifying-election-would,12726910.html?lang=fr",
    "author": "The Guardian (Europe)"
}