{
    "text": "Biden, Lenin, And Immigration Language: Gingrich\n\nAuthored by Newt Gingrich via RealClear Wire,\n\nAs an historian, it has been fascinating to watch the left try to impose new language to describe people in the country illegally.\n\nThe left has gradually pushed accepted language away from “illegal aliens” (the term in law), to “illegal immigrants” (the most common term), to “undocumented immigrants” (the left’s current favorite term), and now to “newcomers” (the Joe Biden White House’s latest experiment in gaining language dominance).\n\nIt all reminds me of Vladimir Lenin’s great language coup of 1903.\n\nThe Russian Social-Democratic Labour Party met secretly in Brussels. (The Czar’s secret police made it impossible to meet openly in Russia). At the meeting there was a split between Lenin’s hardline revolutionary faction and a more moderate democratic wing. Lenin’s faction was the smaller group, but they claimed the title Bolshevik (which means “greater faction” or majority). Group with the most votes were foolish enough to accept the title Lenin gave them, which was Menshevik, meaning minority. That language dominance and branding gave Lenin an enormous advantage in the following two-decade struggle to overthrow the Czar and create Soviet Russia.\n\nAt least as far back as the French Revolution, the left has had a passion for labeling things and ideas to gain language dominance.\n\nThis process as applied to illegal immigration began at least 25 years ago for me. That’s when I first remember being lectured that using the term “illegal immigrants” was wrong, and I should learn to say “undocumented.”\n\nI thought this was nuts then, and I still do now. By definition, the people we were describing are illegal. Their first act on entering the United States is to break the law. Their decision to do so is an insult to every legal immigrant who patiently followed the rules and entered the United States legally.\n\nIn late February, the Biden White House had a handout which said, “The bill also includes $1.4 billion for cities and states who are providing critical services to newcomers.” The reaction to replacing “illegal immigrant” with “newcomer” was so harsh that the Biden team dropped it. But their goal was clear.\n\nThis process of normalizing weird and radical ideas goes on constantly on the left. Think of pushing transgenderism on children, kneeling during the pledge of allegiance, ignoring the destruction caused by the Black Lives Matter riots, etc.\n\nThe problem for the left is that illegal immigration may be the battlefield on which they can’t win.\n\nThe latest absurdity began when Biden responded to jeers from Rep. Marjorie Taylor Greene during his State of the Union Address. He said, “Lincoln (sic) Riley, an innocent young woman who was killed by an illegal. That’s right. But how many of thousands of people are being killed by legals?”\n\nNote that even in acknowledging a young woman who was killed by an illegal immigrant, Biden had to immediately cover it with thousands being killed by legal immigrants and citizens. The illegal immigrant could not be the focus.\n\nOf course, he got Riley’s name wrong, but the left immediately attacked him for using the term “illegal.” This includes former Speaker of the House Nancy Pelosi. Biden promptly began trying to backtrack. In an interview with MSNBC's Jonathan Capehart on Saturday, Biden acknowledged his sin of language, \"I shouldn't have used ‘illegal,’ it's ‘undocumented.’\"\n\nBut Biden couldn’t stop there. He had to be pro-illegal immigrant. “I’m not going to treat any, any, any of these people with disrespect. Look, they built the country. The reason our economy is growing,” he said.\n\nBiden’s defense of illegal immigration hurt him with the average American – and his use of “illegal” hurt him with his leftwing allies.\n\nHis confusion made him look weak. So, in another act of language dominance, the White House simply decided he really never apologized for saying “illegal” in the first place.\n\nAs The Hill reported:\n\n“White House deputy spokesperson Olivia Dalton attempted to clarify on Monday, telling a reporter that ‘the president absolutely did not apologize’ despite his expression of regret.\n\n“‘There was no apology anywhere in that conversation,’” Dalton told reporters on Air Force One. ‘He did not apologize. He used a different word. I think what we should be really clear about is the facts.’”\n\nBiden (and his press team) may be confused, but the American people are not. As Scott Rasmussen reported:\n\n“Our recent polling found that 55% of voters believe ‘illegal immigrant’ is the proper term and another 8% prefer ‘illegal alien.’ While 63% favor use of ‘illegal,’ just 24% prefer ‘undocumented migrant.’\n\n“Among traditional Democrats, 54% prefer ‘illegal’ and 33% ‘undocumented.’ But [Bernie] Sanders Democrats prefer ‘undocumented’ by a 48% to 30% margin. It is the progressive Democrats who forced Biden to apologize. This just moves him even further from the mainstream.”\n\nLet’s be clear: Laken Riley was reportedly killed by an illegal immigrant. That illegal immigrant was in Athens, Ga. because of Biden’s insane policies which favor an open border and prioritize illegal immigrants over American citizens.\n\nNo word games can overcome those facts.\n\nFor more commentary from Newt Gingrich, visit Gingrich360.com. Also, subscribe to the Newt’s World podcast.",
    "title": "Biden, Lenin, And Immigration Language: Gingrich",
    "date": "2024-03-21T10:00:00.000+02:00",
    "url": "https://freedombunker.com/2024/03/20/biden-lenin-and-immigration-language-gingrich",
    "author": "Chris Future"
}