{
    "text": "As Democrats expand their lead in one crucial metric…\n\nPresident Biden is going for his predecessor's jugular.\n\nIt seems the Biden campaign is trying to goad former President Trump into responding after reports that Trump's campaign has hemorrhaged money to keep pace with the former president's legal fees. (RELATED: Trump's Attorneys Drop Bombshell News)\n\nAccording to FEC filings reviewed by The New York Times, “Biden's re-election campaign had $71 million on hand at the end of February, more than double the $33.5 million in former President Donald J. Trump's campaign account.” Despite trailing Trump by an average of 3.6 points in battleground states, Biden's advisers are confident that they can overcome this deficit with the Democrats' increasing financial advantage.\n\nAs The Hill reports:\n\n“If Donald Trump put up these kinds of numbers on ‘The Apprentice,' he'd fire himself,” Biden campaign communications director Michael Tyler said in a statement. “But here's why he ain't got it: his extreme, toxic agenda of banning abortion, slashing Social Security, and promoting political violence is repelling donors and doing exactly *nothing* to earn support from the voters who will decide this election.” “Even if he had the money, it's not a message the voters would buy,” Tyler added. Ammar Moussa, another Biden campaign spokesperson, wrote on X, formerly known as Twitter, “I'm not a mathematician but I think we have A LOT more cash.” Trump, who became the GOP's presumptive nominee earlier this month, could see a fundraising boost as he merges his operations with the Republican National Committee. The RNC reported Wednesday it had about $11 million in cash on hand at the end of February, trailing the Democratic National Committee's $26 million cash on hand.\n\nAt the beginning of March, Trump's campaign had $42 million in cash on hand, while Biden's operation reported $155 million.\n\nREAD NEXT: Study Reveals Death By Stroke And Heart Attack Up 450%! Blame This?",
    "title": "Biden Ridicules Trump's Financial Difficulties - American Liberty News",
    "date": "2024-03-21T19:26:00.000+02:00",
    "url": "https://americanliberty.news/politics/biden-ridicules-trumps-financial-difficulties/alnstaff/2024/03",
    "author": "ALN Staff"
}