{
    "text": "By nearly 2-to-1, voters believe President Joe Biden is using the Justice Department to hobble former President Donald Trump and jail him so that he can’t win the fall election.\n\nIn the latest McLaughlin and Associates survey shared with Secrets on Wednesday, 56% said they believe that “Joe Biden wants to stop President Trump from winning the election by putting him in jail.” Some 30% disagreed.\n\nRepublicans, 86% to 8%, agreed, as did independent voters, 50% to 33%. But so did many Democrats — 32% agreed to 48% who didn’t.\n\nWhat’s more, voters said they believe Biden is playing a key role in driving the investigations of his rival. Some 58% said Biden has a role. Of that, 40% called his role “major.”\n\nThe former president faces dozens of charges in several cases as he enters the heat of the 2024 election. He has often decried the Biden effort as something Third World dictators try. One Trump insider also compared what Biden’s Justice Department is doing to Russian President Vladimir Putin’s campaign against his foes.\n\nThe Trump pollster also asked voters if Biden should pull his prosecutors back and let the election play out. Voters, by an even bigger margin, said they would applaud such a move, 58% to 34%.\n\nPollsters John and Jim McLaughlin’s latest survey showed that despite the punishing criminal and civil cases facing Trump, the Republican has expanded his lead over Biden in the last month.\n\nTrump now leads nationally at 49% to 43%, up from 47% to 43% last month.\n\nIn addition to feeling that Biden is persecuting his foe, voters also feel that “Bidenomics” is sinking them. A majority of voters said they are struggling under inflation, and 83% said the president’s economic program has “impacted” them.\n\nIn national polls, Trump has generally held a lead and one far bigger than he did in any 2020 or 2016 survey. More importantly than the national popular vote, he has also started to expand his leads in battleground states that will determine the Electoral College outcome.\n\nSEE THE LATEST POLITICAL NEWS AND BUZZ FROM WASHINGTON SECRETS\n\nOn Wednesday, for example, two more polls showed that Trump has a lead over Biden in Arizona and Nevada. Both are from an Emerson College Polling/Hill survey.\n\nIn Arizona, Trump leads Biden 48% to 44%. In Nevada, it’s Trump over Biden, 44% to 41%.",
    "title": "Voters charge Biden wants to ‘jail’ Trump before election, 56%-30%",
    "date": "2024-03-20T16:03:00.000+02:00",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/2929533/voters-charge-biden-wants-to-jail-trump-before-election-56-30",
    "author": "EdJenner"
}