{
    "text": "President Biden is using the anniversary of the passage of the Affordable Care Act (ACA) to improve former President Trump’s record on health care and capitalize on his threats to repeal the law.\n\nIn a new digital ad published on Friday before 14th anniversary of the law, the Biden campaign sought to highlight Trump’s repeated threats to repeal it and highlight the consequences if he wins a second term.\n\nThe video, titled “Flatline,” features audio of Trump’s criticism of ObamaCare as on-screen text describing what repealing the law would do.\n\n“Donald Trump tried to rob our health care,” the ad said. “He failed. But he comes back for it.\n\nThe messages play over an image of a heart monitor that eventually flattens out.\n\nAs president, Trump came just one vote away from repealing the law and has said he wants to try again.\n\n“If he succeeds … 45 million Americans could lose their health insurance,” the ad said. “And you might be one of them.”\n\nThe campaign said the ad will run on digital platforms including Meta, YouTube and affiliate TV in English and Spanish in battleground states.\n\nIn addition to the ad, the campaign is holding a digital rally this weekend with former President Obama and former Speaker Nancy Pelosi (D-Calif.). The national appeal aims to “mobilize supporters and volunteers around defending the ACA from Trump’s attacks,” the campaign said.\n\nThe Democratic National Committee is also running digital battleground ads criticizing Trump for his efforts to repeal the ACA.\n\nAds will appear as digital front pages on local newspaper websites in Pennsylvania, Arizona, Nevada, North Carolina, Georgia, Michigan and Wisconsin.\n\nThe Biden campaign and Democratic allies enthusiastically jumped into battle with Trump over ObamaCare after the presumptive GOP nominee emerged seeking to repeal the law.\n\nMore than 40 million people have health insurance through ObamaCare, and the law is more popular than ever. Biden campaign officials see keeping it as a major political issue as enrollments for coverage in 2024 hit a record 21.3 million.\n\nBiden and Democrats have long seen health care as a winning issue for them, and the president has targeted the pocketbook issue to cut people’s costs amid broad concerns about the economy.\n\n“We cannot take this progress for granted. Extreme MAGA Republicans have voted over 50 times to repeal the Affordable Care Act. Just this week, Trump’s allies in the House of Representatives proposed a budget that would gut this life-saving legislation,” Biden said in a statement Friday, referring to the budget proposal from the Republican Study Committee.\n\n“It is not hyperbole to say that affordable health care for millions of people is on the line in November. I am more determined than ever to fight back against the Republican attacks on MAGA and make health care a right, not a privilege, in America,” Biden said.\n\nCoverage of the 2024 election\n\nThe Biden campaign is also trying to use Trump’s “are you better” argument against him.\n\nOn Friday, Biden’s team played a clip from a news conference exactly four years ago in the early days of the COVID-19 pandemic, when Trump said he wanted to “end” ObamaCare and reiterated his support for a lawsuit to end the law.\n\n“Taking health care away from millions of Americans is always a bad idea, but Trump’s efforts in March 2020 — when thousands of Americans were dying — couldn’t have come at a worse time,” the campaign said. “Donald Trump and his campaign keep asking the country if we are better off now than we were four years ago. Time and time again, the answer is yes.”",
    "title": "The Biden campaign used the anniversary of ObamaCare to hit Trump on health care",
    "date": "2024-03-22T17:42:00.000+02:00",
    "url": "https://getaboutcolumbia.com/the-biden-campaign-used-the-anniversary-of-obamacare-to-hit-trump-on-health-care",
    "author": "admin"
}