{
    "text": "Donald Trump on Tuesday filed a U.S. Supreme Court brief in his bid for criminal immunity for trying to overturn his 2020 election loss, arguing that a former president enjoys \"absolute immunity from criminal prosecution for his official acts.\"\n\nThe case is due to be argued before the justices on April 25. Trump has appealed a lower court's rejection of his request to be shielded from the criminal case being pursued by Special Counsel Jack Smith because he was serving as president when he took the actions at the center of the case.\n\nThe filing advances arguments similar to ones Trump's lawyers previously have made and echoes statements he has made on the campaign trail as he seeks to regain the presidency.\n\n\"The president cannot function, and the presidency itself cannot retain its vital independence, if the president faces criminal prosecution for official acts once he leaves office,\" the filing said.\n\nTrump, the first former president to be criminally prosecuted, is the Republican candidate challenging Democrat President Joe Biden in the Nov. 5 election. Biden defeated Trump in 2020.\n\n\"A denial of criminal immunity would incapacitate every future president with de facto blackmail and extortion while in office, and condemn him to years of post-office trauma at the hands of political opponents. The threat of future prosecution and imprisonment would become a political cudgel to influence the most sensitive and controversial presidential decisions, taking away the strength, authority and decisiveness of the presidency,\" according to Trump's filing.\n\nSmith was appointed by U.S. Attorney General Merrick Garland in November 2022. In August 2023, Smith brought four federal criminal counts against Trump in the election subversion case, including conspiring to defraud the United States, obstructing the congressional certification of Biden's electoral victory and conspiring to do so, and conspiring against right of Americans to vote.\n\nIn a filing to the justices in February, Smith sought to make the case against presidential immunity.\n\n\"The nation has a compelling interest in seeing the charges brought to trial,\" Smith said in the filing, adding that \"the public interest in a prompt trial is at its zenith where, as here, a former president is charged with conspiring to subvert the electoral process so that he could remain in office.\"\n\nSmith said Trump's criminal charges reflect an alleged effort to \"perpetuate himself in power and prevent the lawful winner of the 2020 presidential election from taking office. The charged crimes strike at the heart of our democracy.\"\n\nThe Supreme Court's decision to hear arguments on Trump's immunity bid next month postponed the trial, giving him a boost as he tries to delay prosecutions while running to regain the presidency. Trump has three other pending criminal cases. He has pleaded not guilty in all four cases, seeking to paint them as politically motivated.\n\nTrump last October sought to have the charges dismissed based on his claim of immunity. U.S. District Judge Tanya Chutkan rejected that claim in December.\n\nOn appeal, the U.S. Court of Appeals for the District of Columbia Circuit on Feb. 6 ruled 3-0 against Trump's immunity claim, rejecting his bid for \"unbounded authority to commit crimes that would neutralize the most fundamental check on executive power - the recognition and implementation of election results.\"\n\nThe case once again thrusts the nation's top judicial body, whose 6-3 conservative majority includes three justices appointed by Trump, into the election fray.\n\nTrump and his allies made false claims that the 2020 election was stolen and devised a plan to use false electors to thwart congressional certification of Biden's victory. Trump also sought to pressure then-Vice President Mike Pence not to allow certification to go forward. Trump's supporters attacked the U.S. Capitol on Jan. 6, 2021, in a bid to prevent the certification.\n\nIf Trump regains the presidency, he could seek to use his powers to force an end to the prosecution or potentially pardon himself for any federal crimes.",
    "title": "Trump Urges Supreme Court to Adopt 'Absolute Immunity' for Ex-Presidents | Newsmax.com",
    "date": "2024-03-19T23:37:00.000+02:00",
    "url": "https://www.newsmax.com/newsfront/trump-brief-supreme/2024/03/19/id/1157866",
    "author": "@newsmax"
}