{
    "text": " No place in the US is safe from the climate crisis, but a new report shows where it’s most severe\nCNN  —  none\nThe effects of a rapidly warming climate are being felt in every corner of the US and will worsen over the next 10 years with continued fossil fuel use﻿, according to a stark new report from federal agencies.\n\nThe Fifth National Climate Assessment, a congressionally mandated report due roughly every five years, warned that even though planet-warming pollution in the US is slowly decreasing, it is not happening nearly fast enough to meet the nation’s targets, nor is it in line with the UN-sanctioned goal to limit global warming to 1.5 degrees Celsius – a threshold beyond which scientists warn life on Earth will struggle to cope.\n\nThis year’s assessment reflects the reality that Americans can increasingly see and feel climate impacts in their own communities, said Katharine Hayhoe, a distinguished climate scientist at Texas Tech University and contributor to the report.\n\n“Climate change is affecting every aspect of our lives,” Hayhoe told CNN.\n\nSome of the report’s sweeping conclusions remain painfully familiar: No part of the US is truly safe from climate disasters; slashing fossil fuel use is critical to limit the consequences, but we’re not doing it fast enough; and every fraction of a degree of warming leads to more intense impacts.\n\nBut there are some important new additions: Scientists can now say with more confidence when the climate crisis has made rainstorms, hurricanes and wildfires stronger or more frequent, long-term drought more severe and heat more deadly.\n\nThe remains of a vehicle in a burned neighborhood after wildfires in Lahaina in Maui, Hawaii, on August 18.\nThis summer alone, the Phoenix area baked through a record 31 consecutive days above 110 degrees, a shocking heatwave that was partly responsible for more than 500 heat-related deaths in Maricopa County in 2023 – its deadliest year for heat on record.\n\nIn July, a torrential rainstorm deluged parts of Vermont in deadly floodwaters. Then in August, Maui was devastated by a fast-moving wildfire and Florida’s Gulf Coast was slammed by its second major hurricane in two years.\n\nPresident Joe Biden will deliver remarks on Tuesday and is expected to unveil more than $6 billion in funding to strengthen climate resilience “by bolstering America’s electric grid, investing in water infrastructure upgrades, reducing flood risk to communities, and advancing environmental justice for all,” an administration official said.\n\nThe US needs “a transformation of the global economy on a size and scale that’s never occurred in human history” to “create a livable future for ourselves and our children,” White House senior climate adviser John Podesta told reporters.\n\nHere are five significant takeaways from the federal government’s sweeping climate report.\n\nIt’s easier to pinpoint which disasters were made worse by climate change\n\nThe latest report contains an important advancement in what’s called “attribution science” – scientists can more definitively show how climate change is affecting extreme events, like heatwaves, droughts to hurricanes and severe rainstorms.\n\nClimate change doesn’t cause things like hurricanes or wildfires, but it can make them more intense or more frequent.\n\nFor instance, warmer oceans and air temperatures mean hurricanes are getting stronger faster and dumping more rainfall when they slam ashore. And hotter and drier conditions from climate change can help vegetation and trees become tinderboxes, turning wildfires into megafires that spin out of control.\n\n“Now thanks to the field of attribution, we can make specific statements,” Hayhoe said, saying attribution can help pinpoint certain areas of a city that are now more likely to flood due to the effects of climate change. “The field of attribution has advanced significantly over the last five years, and that really helps people connect the dots.”\n\nWhat's the weather forecast for 2050?\n\n04:18 - Source: CNN\nAll regions are feeling climate change, but some more severely\n\nThere is no place immune from climate change, Biden administration officials and the report’s scientists emphasized, and this summer’s extreme weather was a deadly reminder.\n\nSome states – including California, Florida, Louisiana and Texas – are facing more significant storms and extreme swings in precipitation.\n\nLandlocked states won’t have to adapt to sea level rise, though some – including Appalachian states like Kentucky and West Virginia – have seen devastating flooding from rainstorms.\n\nAnd states in the north are grappling with an increase in tick-borne diseases, less snow, and stronger rainstorms.\n\n“There is no place that is not at risk, but there are some that are more or less at risk,” Hayhoe told CNN. “That is a factor of both the increasingly frequent and severe weather and climate extremes you’re exposed to, as well as how prepared (cities and states) are.”\n\nClimate change is exacting a massive economic toll\n\nClimate shocks on the economy are happening more frequently, the report said, evidenced by the new record this year for the number of extreme weather disasters costing at least $1 billion. And disaster experts have spent the last year warning the US is only beginning to see the economic fallout of the climate crisis.\n\nClimate risks are hitting the housing market in the form of skyrocketing homeowners’ insurance rates. Some insurers have pulled out of high-risk states altogether.\n\nStronger storms wiping out certain crops or extreme heat killing livestock can send food prices soaring. And in the Southwest, the report’s researchers found that hotter temperatures in the future could lead to a 25% loss of physical work capacity for agricultural workers from July to September.\n\nThe US is cutting planet-warming pollution, but not nearly fast enough\n\nUnlike the world’s other top polluters – China and India – planet-warming pollution in the US is declining. But it’s not happening nearly fast enough to stabilize the planet’s warming or meet the United States’ international climate commitments, the report explains.\n\nThe country’s annual greenhouse gas emissions fell 12% between 2005 and 2019, driven in large part by the electricity sector moving away from coal and toward renewable energy and methane gas, the latter of which is still a fossil fuel that has a significant global warming effect.\n\nThe decline is good news for the climate crisis, but look at the fine print and the picture is mixed.\n\nThe report finds US planet-warming emissions “remain substantial” and would have to sharply decline by 6% annually on average to be in line with the international 1.5-degree goal. To put that cut into perspective, US emissions decreased by less than 1% per year between 2005 and 2019 – a tiny annual drop.\n\nLeading scientist explains how cities can help solve climate change\n\n03:13 - Source: CNN\nWater – too much and not enough – is a huge problem for the US\n\nOne of the report’s biggest takeaways centers on the precarious future of water in the US, and how parts of the country are facing a future with either extreme drought and water insecurity, or more flooding and sea level rise.\n\nDrought and less snowpack are huge threats to Southwest communities in particular. The report’s Southwest chapter, led by Arizona State University climate scientist Dave White, found the region was significantly drier from 1991 to 2020 than the three decades before.\n\nWhite said that’s an ominous sign as the planet continues to warm, with significant threats to snowpack in California’s Sierra Nevada mountains and the Rockies – both of which provide crucial freshwater in the West.\n\nWhite added that a lack of freshwater in the region also has significant economic and agricultural impacts, as it supports cities, farms, and Native American tribes.\n\n“Mountains are our natural reservoirs in the region,” White told CNN. “Climate impacts on that mountain snowpack have really significant negative effects for the way our infrastructure operates. It’s just critical for us to protect those resources.”\n\nCNN’s Donald Judd contributed to this report.\n        ",
    "title": "No place in the US is safe from the climate crisis, but a new report shows where it’s most severe",
    "date": "2023-11-14T15:11:00.000-05:00",
    "url": "https://www.cnn.com/2023/11/14/us/national-climate-assessment-extreme-weather-costs/index.html",
    "author": "Ella Nilsen, CNN"
}