{
    "text": "People are seen among the rubble of a destroyed building in the southern Gaza Strip city of Rafah, on March 19, 2024. (Photo by Yasser Qudih/Xinhua)\n\nJERUSALEM, March 19 (Xinhua) -- Israeli Prime Minister Benjamin Netanyahu on Tuesday rejected the U.S. call to cancel a ground operation in Rafah city, where about 1.5 million displaced Palestinians resided, but agreed to send a delegation to Washington for discussions.\n\nThe White House confirmed in a statement that Netanyahu and U.S. President Joe Biden agreed in a phone call on Monday, that their teams would meet \"soon\" in Washington to \"exchange views and discuss alternative approaches\" to a major ground operation in Rafah.\n\nNetanyahu's office said in a statement that the delegation, led by Strategic Affairs Minister Ron Dermer, will be dispatched next week \"for the sake of the continuation of the fighting.\"\n\nEarlier on Tuesday, Netanyahu said in an address to the parliament's Foreign Affairs and Defense Committee that a ground assault is the only way to defeat Hamas militants in Rafah. He said he \"made it as clear as possible\" to Biden that Israel is \"determined to complete the elimination of (Hamas) battalions in Rafah, and there is no way to do this without a ground incursion.\"\n\nPeople wait to get free food in the southern Gaza Strip city of Rafah, on March 18, 2024. (Photo by Rizek Abdeljawad/Xinhua)\n\nMeanwhile, Israeli troops have continued their raid on the al-Shifa Hospital compound in Gaza City for the second day, attacking the enclave's largest hospital with tanks and airstrikes.\n\nThe Israel Defense Forces (IDF) said in a statement that the troops killed more than 50 Palestinian militants and about 300 have been detained during the raid, which targeted \"senior\" Hamas militants. Two Israeli soldiers were killed during the raid, IDF announced.\n\nIsrael launched its offensive on Gaza on Oct. 7 in response to Hamas's attack and immediately implemented a blockade on water, food, electricity, and medicine, creating acute shortages.\n\nPeople inspect a destroyed building after an Israeli airstrike in the southern Gaza Strip city of Rafah, March 19, 2024. (Photo by Khaled Omar/Xinhua)\n\nUN agencies and aid organizations assert that the quantity of aid permitted by Israel to enter Gaza falls short of the desperate needs required to prevent the imminent spread of famine.\n\n\"Projected imminent famine in Gaza can be prevented,\" UN High Commissioner for Human Rights Volker Turk said in a video statement.\n\n\"The extent of Israel's restrictions on entry of aid, together with the manner in which it conducts hostilities, may amount to use of starvation as a method of war,\" he warned.\n\nHis remarks came a day after the Integrated Food Security Phase Classification (IPC) released a report alarming that \"famine is imminent in the northern governorates and projected to occur anytime between mid-March and May 2024.\"\n\nThe war has left about 1.1 million people, about half of Gaza's population, experiencing \"catastrophic\" hunger, according to the report.\n\nThe UN Relief and Works Agency for Palestine Refugees (UNRWA) warned on social media platform X that at least 23 children have already died of acute malnutrition and an increasing number of children are on the brink of death due to starvation, mainly in northern Gaza.\n\nA volunteer distributes free food in the southern Gaza Strip city of Rafah, on March 18, 2024. (Photo by Rizek Abdeljawad/Xinhua)\n\nIsrael has denied it was obstructing aid trucks. Commenting on the report on X, the office of Coordination of Government Activities in the Territories, a governmental body, said that more than 200,000 tons of food entered Gaza since the start of the war, over 1,250 packages were airdropped and over 150 aid trucks reached northern Gaza in the last two weeks.\n\nThe Palestinian toll in Gaza has reached 31,819, the Hamas-run Health Ministry said Tuesday.\n\nEditor: GSY",
    "title": "Netanyahu rejects U.S. plea to halt Rafah attack, agrees to talk in Washington _Guangming Online",
    "date": "2024-03-20T02:00:00.000+02:00",
    "url": "https://en.gmw.cn/2024-03/20/content_37213857.htm",
    "author": "GSY"
}