{
    "text": "The House impeachment inquiry into President Joe Biden has hit a crossroads, lacking the political appetite from within Republican ranks to go forward with an actual impeachment, but facing political pressure to deliver after months of work.\n\nThe Republican chairman of the House Oversight Committee, James Comer, has signaled an interest in another direction. He is stopping short of drawing up articles of impeachment against the president, but eying criminal referrals of Biden family wrongdoing to the Justice Department for possible prosecution.\n\nWith the panel’s star witness, Hunter Biden, not expected to appear for Wednesday’s public hearing after having testified privately last month, Comer telegraphed what was coming next.”If he does not show up, then it’s not going to end well for the Bidens,” Comer said over the weekend on Fox News. He said, “There’s going to be multiple criminal referrals.”\n\nAdvertisement\n\nIt’s the start of a potential wind-down for the lengthy GOP-led probe that was launched after Republicans seized control of the House in January, eager to hold Biden to the high bar of impeachment that twice reprimanded Donald Trump during his presidency.\n\nAs Trump and Biden face another likely rematch this November, Comer is weighing whether to keep the impeachment inquiry going through Hunter Biden’s often complicated business dealings and his storied, but troubled life, or wrap up work even if that falls short of a historic presidential impeachment.\n\nThe White House has called the inquiry a “charade” and told Republicans to “move on.” Wednesday’s hearing will delve deeper into Hunter Biden’s business dealings as Republicans seek testimony from Jason Galanis, who is serving a lengthy federal prison sentence in Alabama for fraud schemes and is expected to appear remotely, and Tony Bobulinski, a one-time business associate of Hunter Biden who took his claims against the family public during the first Trump-Biden presidential debate in 2020.\n\nThe Democrats have called witness Lev Parnas to testify, relying on the convicted businessman who was central to Trump’s first impeachment as a Rudy Giuliani associate working to dig up political dirt on Joe Biden ahead of the 2020 election. Parnas has since played a key role in dispelling the House GOP’s main claim of bribery against the Bidens as simply not true.\n\nAdvertisement\n\n“Who better than Lev Parnas himself — Rudy Giuliani’s right-hand man on the original mission to smear Joe Biden — to tell the story of how this campaign of lies and slander works?” said Rep. Jamie Raskin of Maryland, the top Democrat on the Oversight Committee, in a statement.\n\nRaskin said Parnas can “debunk the bogus claims at the heart of the impeachment probe and, in the process, explain how the GOP ended up in this degraded and embarrassing place.”\n\nSo far, the impeachment inquiry’s public hearings have often devolved into all-day spectacles as scores of lawmakers take their turn grilling the witnesses.\n\nHunter Biden, who is facing firearm and tax charges in separate matters, testified behind closed doors last month in a committee deposition that filled more than 200 pages but left Comer’s panel without the hard evidence it was seeking of wrongdoing by the president or his son.\n\nAdvertisement\n\nThe committee asserts that the Bidens traded on the family name, an influence-peddling scheme that seeks to link a handful of phone calls or dinner or lunch meetings between Joe Biden, when he was vice president, and Hunter Biden and his business associates.\n\nBut their slim majority narrowed by early retirements, House Republicans may not have enough support within their ranks to pursue articles of impeachment against President Biden, especially since Democrats would likely vote against any such charges.\n\nInstead, Comer has been looking into potential criminal referrals to the Justice Department, which would likely be symbolic, but could open the door to prosecutions in a future administration. It’s unclear who would exactly be charged, and over what offenses, and Comer has also discussed drafting ethics-related legislation to tighten influence peddling or foreign lobbying among officials.\n\nRead more | Hunter Biden indicted on nine tax charges, adding to gun charges in special counsel probe\n\nA House committee spokesperson said that the impeachment inquiry is ongoing without a predetermined outcome. The committee will issue a final report with its recommendations once the inquiry has concluded.\n\nAdvertisement\n\nGalanis, who was initially interviewed by the committee last month from prison, has told the panel that he expected to make “billions” with Hunter Biden and other associates, using the Biden family name in their foreign business dealings.\n\nHe has told the panel of a particular time when Hunter Biden put his dad on speakerphone for a brief minute-long chat during a birthday party at a New York restaurant for the 1-year-old child with potential foreign business partners. He acknowledged that he unsuccessfully sought a pardon in the final days of the Trump presidency.\n\nHunter Biden, in his own deposition to the panel, said he met Galanis for about 30 minutes 10 years ago.\n\nBobulinski who has gone public with his allegations has told the panel in his interview that he met briefly with Joe Biden when he was vice president through Hunter Biden. The Democratic witness, Parnas, had been a central figure in Trump’s first impeachment over withholding aid to Ukraine. He helped Giuliani with the false claims that Joe Biden, as vice president, had intervened in the firing of a Ukrainian prosecutor as a favor to Hunter Biden’s work on the board of the Ukrainian energy firm Burisma.\n\nAdvertisement\n\nWestern allies also wanted the prosecutor fired over allegations of corruption.\n\nLast summer, Senate Republicans released unverified claims from an FBI informant who disclosed more such details, including allegations of payments to the Bidens that became central to the House GOP probe. At the time, Parnas sent Comer a lengthy later dispelling those claims, saying it was all talk and the money was not paid to the Bidens.\n\nThe now former FBI informant Alexander Smirnov was arrested last month and pleaded not guilty to charges that he fabricated the bribery allegations.",
    "title": "Biden impeachment inquiry is at a crossroads. As Hunter Biden declines to appear, GOP eyes next move",
    "date": "2024-03-20T07:30:00.000+02:00",
    "url": "https://indianexpress.com/article/world/biden-impeachment-inquiry-hunter-biden-declines-appear-gop-eyes-next-move-9223925",
    "author": null
}