{
    "text": "Tracker program finds python mating balls, Florida team says Miami Herald (furzy). Perversion in Florida! Who’d have thunk it?\n\nWho’s going to win the next financial plumbing test? The US, of course FT\n\nAmerican Manufacturers Seek Perfection as Quality Issues Mount WSJ\n\nClimate/Environment\n\nEat food, not too much, mostly plants? Not exactly:\n\nWater\n\n#COVID19\n\nHold Your Horses, Health Workers With COVID Still Must Isolate MedPage. But HICPAC will fix that!\n\nChina?\n\nChina discovers oilfield with over 100M tons of reserve in Bohai Sea Anadolu Agency\n\nThis is William C. Kirby, easily one of the most knowledgeable Western experts on the topic. He is Professor of China Studies at… pic.twitter.com/OH8Y2wU2G4\n\nEVERYONE interested in the economic relationship between the U.S. and China should watch this, as it is sure to challenge many beliefs you may have.\n\nMyanmar\n\nNo bids as house of Myanmar’s Aung San Suu Kyi auctioned Channel News Asia. The junta put it on the market, so not a vote of confidence in them. –lambert\n\nIndia\n\nGaza\n\nJared Kushner says Gaza’s ‘waterfront property could be very valuable‘ Guardian (Kevin W). And he’s not the only one:\n\nRecently, in a Montreal synagogue, real estate agents held an event to market properties in occupied Palestine. A journalist from independent Quebec media outlet @PivotQc infiltrated the event and secretly recorded the real estate agents. The agents flagrantly misrepresented… — Dimitri Lascaris (@dimitrilascaris) March 16, 2024\n\n* * *\n\nWhat Biden Would Do if He Were Serious About Ending the War in Gaza Mother Jones. Robert Ford, a former US ambassador to Algeria and Syria who is now a senior fellow at the Middle East Institute “has called the airdrops the greatest humiliation of the United States by Israel he has ever seen. He is struck by the fact that the US is acting as if it is ‘trying to get supplies into besieged people surrounded by an enemy of the United States.'”\n\nTrudeau government to stop sending arms to Israel once details are worked out, Foreign Affairs Minister Mélanie Joly says Toronto Star\n\n* * *\n\nThe War in Gaza Exposes a Disintegrated Israeli Army Haaretz\n\nThe Israeli settlers shrugging off sanctions to menace the West Bank FT\n\nCensorship is a crucial complement of genocide Al Jazeera",
    "title": "Links 3/20/2024",
    "date": "2024-03-20T13:04:00.000+02:00",
    "url": "https://www.nakedcapitalism.com/2024/03/links-3-20-2024.html",
    "author": "nakedcapitalism.com"
}