{
    "text": "CNN —\n\nThe White House defended its response to the asylum seeker influx facing New York Friday, arguing that without congressional action, the administration is limited in what it can do, following a letter from New York Gov. Kathy Hochul urging more action.\n\nThe growing number of migrants at the US-Mexico border has posed a steep challenge for the Biden administration. It’s a delicate issue for a White House dogged by fierce criticism from the left and right over its handling of the US southern border and remains a political vulnerability amid Republican attacks as the 2024 presidential election approaches and Democratic local officials face pressures at home.\n\nHochul’s announcement this week is the latest salvo in the ongoing migrant saga that has bedeviled local and state officials struggling to navigate the crisis that they have said needs a more robust federal response. “The reality is we’ve managed thus far without substantive support from Washington,” Hochul said in an address from Albany Thursday.\n\nIn a letter to the White House, Hochul urged Biden to take executive action to expedite work authorizations for asylum seekers, provide more financial aid to the city and the state and make more federal land available to house migrants, among other asks.\n\nIn what may have been her most direct call for assistance, Hochul said she and New York City Mayor Eric Adams have been sounding the alarm for expedited work authorization for migrants and additional federal funds to manage the crisis since July 2022.\n\n“In our first meeting with the President, Mayor Adams and I have championed the idea of a federal designation that would allow the individuals already here in New York, the ability to work to support themselves and their families,” Hochul said. “The mayor and I said that and in countless meetings with Congress, the White House, Cabinet members and rallies with labor, press conferences and working with business. What we’ve said all along is just let them work and help us out financially.”\n\nNew York City has been the recipient of millions of dollars in federal funding to address the growing number of migrant arrivals. The administration also expects over $100 million of that support to be made available in the coming weeks.\n\nThe process for applying for asylum and a work permit is based on current immigration laws – and in recent years, has been made more difficult because of an immense backlog. Immigrant advocates argue that the Biden administration should expand the number of Venezuelans – who make up many of the migrant arrivals in New York – eligible for a form of humanitarian-relief known as Temporary Protected Status. That, they say, is perhaps the easiest form of action, without congressional action, the administration could take to satisfy the ask from New York. The Department of Homeland Security secretary has discretion to designate a country for TPS.\n\nIn a statement to CNN, a White House spokesperson said: “Without Congressional action, this Administration has been working to build a safe, orderly, and humane immigration system and has worked to identify ways to improve efficiencies and maximize the resources the federal government can provide to communities across the country to support the flow of migrants.”\n\n“We will continue to partner with communities across the country to ensure they can receive the support they need. Only Congress can provide additional funding for these efforts, which this Administration has already requested, and only Congress can fix the broken immigration system,” the spokesperson added.\n\nTom Perez, the director of the White House Office of Intergovernmental Affairs, recently spent time in New York to try to smooth over tensions over the migrant crisis and coordinate with state and city partners, according to multiple sources. And DHS dispatched an assessment team to work with state and local officials, according to an administration official.\n\nTensions rise in New York\n\nThe situation has also caused a divide between Hochul and the Adams’ administrations, with the mayor having previously asked for asylum seekers to be sent to other municipalities throughout the state, not just stay in New York City.\n\n“Although we’re disappointed that the state today appears to minimize the role that they can – and must – play in responding to this crisis, the state must fulfil its duty to more than 8 million of the state’s residents who call New York City home,” Adams said in a press release Thursday afternoon.\n\n“Whatever differences we all may have about how to handle this crisis; we believe what is crystal clear is that whatever obligations apply under state law to the City of New York apply with equal force to every county across New York state. Leaving New York City alone to manage this crisis – and abdicating the state’s responsibility to coordinate a statewide response – is unfair to New York City residents who also didn’t ask to be left almost entirely on their own in the middle of a national crisis.”\n\nHochul, meanwhile, has been steadfast in saying she would not use her executive powers to force other counties to take in asylum seekers, citing the city’s right-to-shelter law, which has been the backdrop of an ongoing legal back-and-forth between the city and the state.\n\n“This is an agreement that does not apply to the state’s other 57 counties, which is one of the reasons we cannot and will not force other parts of our state to shelter migrants,” Hochul said. “Nor are we going to be asking migrants to move to other parts of the state against their will.”\n\nShe said that the state is working with the Department of Labor to connect migrants with jobs once the federal government approves their work authorizations. There have been 2600 families that have applied for asylum over the past 7 weeks, according to New York State Homeland Security Commissioner Jackie Bray. In a survey from this past May, 10% of people being sheltered have previously applied for asylum, Bray said.\n\nHochul said the plan, which hinges on asylum seekers being allowed to work, would help the migrant crisis, as well as businesses, which have struggled to find people to work.\n\n“This is a national and a federal issue, but New York has shouldered this burden for far too long,” Hochul said.",
    "title": "White House defends response to asylum seeker influx following criticism from New York governor",
    "date": "2024-03-21T21:21:00.000+02:00",
    "url": "https://www.cnn.com/2023/08/25/politics/white-house-new-york-asylum/index.html",
    "author": "Priscilla Alvarez,Polo Sandoval,Mark Morales"
}