{
    "text": "Mark Cuban of the Dallas Mavericks walks onto the court before a game against the Boston Celtics at the TD Garden on March 01, 2024 in Boston, Massachusetts. (Brian Fluharty/Getty Images)\n\n(DALLAS) — Billionaire businessman Mark Cuban, who voted for former South Carolina Gov. Nikki Haley in the 2024 GOP primary and is now supporting President Joe Biden, attended the president’s second fundraiser in Dallas, Texas, on Wednesday night.\n\nBiden’s appearance Wednesday night with Cuban, the former majority owner of the Dallas Mavericks, is part of the president’s larger effort to court donors and supporters of Nikki Haley following her exit from the race.\n\nCuban is one of the main sharks of the ABC reality television series Shark Tank and will exit the show in 2025.\n\nHe confirmed his attendance late Wednesday night, telling ABC News he “wanted to show my support and say hi to the President.”\n\nAt the fundraiser in the backyard of a sprawling home in a wealthy Dallas neighborhood, Biden dug into his differences with former President Donald Trump and asked the iconic question coined by Ronald Reagan: “Are you better off now than four years ago?”\n\n“Let me ask you – does anyone here want to go back to 2020? When fear ruled our lives and Trump was president? I don’t think so,” Biden said, calling on “Democrats, independents and Republicans,” to join together to defeat Trump once again.\n\nA source familiar told ABC News the Biden campaign has also been hosting Zoom calls with former donors of Haley since she suspended her campaign on March 6.\n\nCuban, who says he cast his ballot in Texas for Haley, told Bloomberg earlier this month that he would vote for Biden over Trump.\n\nBiden’s re-election campaign has said they are confident they’ll be able to persuade Haley supporters who oppose a second Trump term to cross party lines and back the president in the fall.\n\n“Donald Trump made it clear he doesn’t want Nikki Haley’s supporters. I want to be clear: There is a place for them in my campaign,” Biden said in a statement minutes after Haley suspended her presidential campaign.\n\nThe Biden-Harris campaign has pointed to Haley still receiving a sizable share of votes in primary elections even after she dropped out of the race to argue Trump will have trouble uniting Republicans in November.\n\n“Nikki Haley is describing to the world exactly where and with whom Donald Trump is weak, and our campaign is paying attention to that and will be engaging voters very intentionally, to draw that contrast and invite them in,” a campaign aide said on a press call Monday.\n\nAides point to exit polling as well to show there are Republican primary voters who say they would support Biden in the general election. In Ohio, for instance, as reported by ABC News, exit polling Tuesday found eight in 10 Haley supporters said they wouldn’t vote for Trump in the general, with nearly half saying they’d back Biden — a figure the Biden campaign blasted to reporters.\n\nAt least half a dozen former Haley bundlers have opted to help Biden’s campaign rather than Trump’s, according to reporting from CNBC that was distributed to reporters on Tuesday by Biden’s team. Veteran media executive and former Haley donor Harry Sloan was one of those donors recruited to help reelect Biden and raise money for his campaign.\n\nCuban visited the White House earlier this month for a roundtable on lowering prescription drug costs, something Cuban is passionate about — he started Cost Plus Drug Company, which provides medication at low costs to consumers. Biden has touted his own efforts to tackle the high costs of prescription drugs — namely capping the cost of insulin at $35 for seniors.\n\nCopyright © 2024, ABC Audio. All rights reserved.",
    "title": "Mark Cuban attends fundraiser for Biden in Dallas",
    "date": "2024-03-21T13:00:00.000+02:00",
    "url": "https://www.regionalmedianews.com/news/national/politics/mark-cuban-attends-fundraiser-for-biden-in-dallas",
    "author": "ABC News"
}