{
    "text": "His team has set up two new joint fundraising committees to help close the gap.\n\nFormer President Donald Trump and the Republican National Committee are, right now, facing a serious financial disadvantage in the early stages of the general election fight against President Joe Biden and his $100 million war chest, new filings show.\n\nBut with Trump becoming his party's 2024 presumptive presidential nominee earlier this month, he and the RNC are full steam ahead to make up for their fundraising lag -- launching a joint operation and planning a high-dollar event with GOP megadonors.\n\nFebruary financial filings for the Biden and Trump campaigns and respective Democratic and Republican parties, released on Wednesday, illustrate how much more money Biden has raised and currently has on hand compared to Trump, funds that can be used toward advertising, staffing and organizing.\n\nFinancial filings also detail the extent to which Trump's legal bills have eaten into the cash flow of some of his allied political groups.\n\nHe faces 88 criminal charges and multiple civil issues -- including the threat of seizure of his assets related to a $464 million judgment in a New York civil fraud case.\n\nHe denies all wrongdoing across the various cases and is appealing the civil fraud ruling, with just days left to provide a bond to cover that penalty.\n\nEntering March, Trump's presidential campaign and the RNC only had $42 million and $11 million respectively in the bank, about half of the more than $97 million the Biden campaign and the DNC jointly reported having as cash on hand in their latest filings.\n\nTrump's campaign fundraising ramped up in February as the former president continued to secure victories in early GOP nominating contests, holding successful events in Florida and South Carolina and bringing in roughly $11 million last month.\n\nIn this Feb. 7, 2024, file photo, President Joe Biden arrives at John F. Kennedy International Airport in Queens, New York. He is visiting Manhattan to attend three Biden-Harris campaign fundraisers. Kyle Mazza/NurPhoto via AP\n\nBut so far this election cycle, the Biden campaign and the Democratic Party have enjoyed a major advantage over their Republican counterparts of being able to raise money together, because Democrats formally decided to rally around Biden even before the nominating race.\n\nThat allowed them to not only share fundraising resources but also to accept high-dollar donations north of $800,000.\n\nFilings show that the Trump campaign, in turn, has been spending much less so far this cycle compared to the same point in the 2020 election cycle, reporting expenditures of just $17 million in the first two months of this year compared to nearly $30 million that the campaign spent during the same period in the last presidential election.\n\nThe Biden campaign spent even less in the first two months of this year -- $12 million -- as the president mostly stayed away from the campaign trail while the GOP fight played out, according to the financial filings. But the DNC was active instead, spending nearly $30 million in the first two months\n\nThe fundraising gap could soon close, with Trump now raising money with the Republican Party as their official presumptive nominee.\n\nHowever, the way one of his new fundraising vehicles is arranged suggests a priority is also funneling money into a political action committee that has paid a significant portion of his ongoing legal bills.\n\nRepublican presidential candidate former President Donald Trump speaks to supporters during a rally at the Dayton International Airport, on March 16, 2024, in Vandalia, Ohio. Scott Olson/Getty Images\n\nTrump's team recently set up two new joint fundraising committees with the GOP: one dubbed \"Trump 47 Committee,\" which raises money with his Save America leadership PAC, the RNC and 40 state GOP committees and can accept more than $800,000 per donor; and another named \"Trump National Committee JFC,\" which is likely going to focus on smaller-dollar joint fundraising.\n\nThe Trump 47 Committee is already throwing a major $814,600-per-ticket fundraiser in Palm Beach, Florida, next month, hosted by billionaire John Paulson and featuring dozens of major Republican names, including several former ambassadors and Trump administration officials like former Small Business Administrator Linda McMahon and former Commerce Secretary Wilbur Ross as well as New York Jets owner Woody Johnson, according to an invitation to the fundraiser that was obtained by ABC News.\n\nOther major co-hosts include a former Trump campaign finance chair, Todd Ricketts, and energy mogul Harold Hamm, aerospace executive Robert Bigelow, hedge fund manager Robert Mercer and his daughter Rebekah Mercer and casino tycoon Phil Ruffin, the invitation shows.\n\nNotably, amid the crush of legal bills, the new Trump 47 Committee is prioritizing Trump's Save America PAC -- which has footed tens of millions of dollars in Trump's legal bills over the last few years and is unable to use its money in support of Trump's reelection campaign because it's set up as his leadership PAC.\n\nAccording to an invitation for a fundraiser hosted by the joint fundraising committee, Save America is ahead of groups like the RNC and the 40 state party committees when it comes to the order for how donations are disbursed.\n\nFor example, the invitation's fine print shows that if a hypothetical $15,000 comes through the committee, the first $6,600 from the donor (or $10,000 from a PAC) goes to the Trump campaign and the next $5,000 goes to Save America -- before any of the funds would go to the Republican Party committees.\n\nRepublican presidential candidate former President Donald Trump gestures to the crowd at a campaign rally, on March 16, 2024, in Vandalia, Ohio. Jeff Dean/AP\n\nThis joint fundraising committee setup comes on the heels of Trump's Save America PAC burning through more than $8.5 million on legal bills just in the first two months of this year -- including $5.6 million in February -- as the former president continues to battle his criminal cases and civil trials across the country, per filings.\n\nLegal bills make up nearly 80% of Save America's total expenditures so far this year, according to financial filings. The PAC has relied almost entirely on tens of millions of dollars in returned money that Save America initially gave to pro-Trump super PAC Make America Great Again Inc., while reporting only a couple thousand dollars raised itself, Save America's filings show.\n\nIn the past few months, Save America relying on those returned contributions from MAGA Inc. for its source of funding has put something of a strain on the latter group, which was designed to spearhead a pro-Trump ad campaign operation outside of the campaign and to boost his reelection bid.\n\nThe super PAC money from MAGA Inc. to Save America is expected to dry up soon following a series of exchanges: Save America initially transferred $60 million to MAGA Inc. in 2022, but the latter group has now returned more than $50 million of those contributions back to Save America.\n\nTrump's new joint fundraising operation offers Save America PAC a fresh source of future support.\n\nMAGA Inc., meanwhile, continues to rake in tens of millions of dollars from Trump's wealthy supporters this year, filings show, but as of the end of February had $25.5 million in cash on hand -- less than half of what the super PAC had entering 2023.",
    "title": "Trump faces major financial disadvantage against Biden as legal bills eat into allies' cash: Filings - ABC News",
    "date": "2024-03-22T02:00:00.000+02:00",
    "url": "https://abcnews.go.com/Politics/trump-faces-major-financial-disadvantage-biden-legal-bills/story?id=108346336",
    "author": "Soo Rin Kim"
}