{
    "text": "WASHINGTON—Donald Trump crushed his opponents in nearly every Republican primary this year. But when it comes to the money race, President Biden has a big head start on his predecessor.\n\nIn February, Biden’s campaign apparatus said it brought in more than $53 million, leaving it with more than $155 million on hand at the end of the month. Trump’s operation by comparison reported raising $39.3 million—with $74.4 million in the bank—across his campaign committee, the Republican National Committee, a supportive super PAC and a leadership PAC, which has been drained by shelling out more than $53 million in legal-related expenses since early last year.\n\nAs the general election begins in earnest, the new figures underscore how much financial ground the former president has to make up on his likely Democratic challenger—money used for pricey TV ads, campaign staff, office space, consulting fees and other expenses.\n\nView Full Image Graphic: WSJ\n\nTrump has retained a slight advantage in polls in battleground states, where thin margins will likely decide who wins the presidency in November. Money also doesn’t necessarily equal guaranteed victory; Hillary Clinton bested Trump in the 2016 money race but still lost the White House. And Trump’s fundraising is likely to pick up now that he has replaced the leadership at the RNC and formed a joint-fundraising committee.\n\nNonetheless, Biden’s fundraising advantage lays bare the risks that Trump has going into spring and summer, when he’ll accept his party’s nomination at the Republican National Convention. His financial health might also reflect the segment of Republicans who say they’ll refuse to vote for Trump even if he were the nominee, according to surveys of GOP primary voters by AP VoteCast.\n\nWhile the Biden team reported adding $25 million to its total cash holdings in February, Trump’s cash—across the campaign account, the RNC and two PACs—increased by $9.2 million. The former president’s February numbers include transfers from his Trump Save America Joint Fundraising Committee, which won’t provide updated figures until it files next month.\n\nTrump’s leadership PAC, Save America, spent $2.2 million more than it took in during February, lowering its cash on hand to $4.1 million at the end of the month. Among its expenditures during February: $1.3 million for research, $1.6 million on payroll and at least $1 million on data processing, according to new data from the Federal Election Commission.\n\nBiden and Trump have spent nearly identical amounts on advertising so far this year, according to data from AdImpact. From Jan. 1 through March 19, Biden’s campaign and his joint fundraising committee had run $13.2 million in television, radio, satellite and online ads, compared with $13.3 million for Trump and his top allied committee.\n\nYet there’s one key difference: Biden has been working to target general-election voters all year, while the bulk of the spending associated with Trump was to mobilize primary voters before he became the presumptive nominee. Biden’s campaign also launched a six-week, $30 million ad blitz in swing states shortly after his March 7 State of the Union address.\n\nOther candidates’ financial pictures have paled in comparison now that Trump and Biden have enough delegates to win their respective parties’ nominations.\n\nIndependent candidate Robert F. Kennedy Jr.reported raising $3.2 million in February, raising his cash on hand at the end of the month to $5.1 million. About 39% of his contributions came from small-dollar donors who have given $200 or less during the presidential cycle.\n\nJohn McCormick contributed to this article.\n\nWrite to Jack Gillum at jack.gillum@wsj.com and Anthony DeBarros at anthony.debarros@wsj.com",
    "title": "Biden has massive campaign cash lead over Trump as general election begins | Mint",
    "date": "2024-03-21T05:50:00.000+02:00",
    "url": "https://www.livemint.com/politics/news/biden-has-massive-campaign-cash-lead-over-trump-as-general-election-begins-11711001355452.html",
    "author": "@mint"
}