{
    "text": "The Biden administration on Thursday said it is forgiving almost $6 billion in student debt for 77,700 borrowers, with those recipients scheduled to receive an email from President Joe Biden alerting them about their debt cancellation.\n\nThe people who qualify for the latest round of student loan forgiveness are public service employees, such as teachers, nurses, social workers and firefighters, the White House said in a statement. On a per-person basis, the forgiveness amounts to about $77,000 per person.\n\nEver since the Supreme Court last year invalidated the Biden administration's plan for broad-based student loan forgiveness, the Biden administration has sought to rely on existing and new loan repayment plans to provide debt relief to almost 4 million people. Americans are carrying about $1.77 trillion in student debt, a financial burden that some college grads say has made it tougher to achieve financial milestones like buying a home.\n\nThe Biden administration has sought to fix problems in the nation's student loan repayment system by rolling out a new program called SAVE and making it easier for public servants to get their debt erased.\n\n\"For too long, our nation's teachers, nurses, social workers, firefighters and other public servants faced logistical troubles and trapdoors when they tried to access the debt relief they were entitled to under the law,\" said U.S. Secretary of Education Miguel Cardona. \"With this announcement, the Biden-Harris Administration is showing how we're taking further steps not only to fix those trapdoors, but also to expand opportunity to many more Americans.\"\n\nWho qualifies for student loan forgiveness?\n\nThe Biden administration said 77,700 borrowers who are enrolled in the Public Service Loan Forgiveness (PSLF) program will receive debt forgiveness.\n\nThose who are receiving debt forgiveness include public servants who enrolled in the Biden administration's limited PSLF waiver, which allows public sector workers who haven't previously qualified for loan relief to receive credit for past repayments, the administration said.\n\nWhat were the prior problems with the PSLF program?\n\nThe PSLF program, which has been around since 2007, had the lofty goal of forgiving the student debt of Americans who work in public sector jobs, such as teachers or government employees, for at least 10 years.\n\nBut its notoriously Byzantine regulations and misleading guidance from some loan-servicing companies meant that few public servants managed to get debt relief. In fact, only 7,000 people received forgiveness through the PSLF prior to the Biden administration.\n\nSince the White House made changes to PSLF, about 871,000 Americans have received student loan forgiveness through the program, the Biden administration said.\n\nHow will I know if I got PSLF debt forgiveness?\n\nThe 77,700 borrowers who qualify will receive a letter from President Biden next week congratulating them on their relief.\n\nI'm enrolled in PSLF. Will I get loan forgiveness, too?\n\nAnother 380,000 people enrolled in PSLF will receive an email from Biden next week letting them know they are within one to two years of qualifying for debt forgiveness through the program.\n\nAccording to a sample email, Biden will congratulate them and urge them to continue working in public service to qualify for forgiveness. One email reads, \"I hope you continue the important work of serving your community — and if you do, in less a year you could get your remaining student loans forgiven through Public Service Loan Forgiveness.\"\n\nDeadline approaches as Trump struggles to pay $464 million bond in fraud case\n\nSneak peek: Who Poisoned Angela Craig?\n\nHow an AI-powered robot provides companionship to lonely seniors",
    "title": "Biden forgives $6 billion in student debt. Here's who qualifies",
    "date": "2024-03-21T14:30:00.000+02:00",
    "url": "https://www.aol.com/biden-forgives-6-billion-student-120243823.html",
    "author": "aol.com"
}