{
    "text": "Biden campaign calls Trump ‘Broke Don’ after he lags in fundraising\n\nPresident Biden’s reelection campaign is pouncing on former President Trump’s fundraising numbers, dubbing its political rival “Broke Don” on Thursday.\n\n“Not a Winning Campaign: Broke Don Hides in Basement,” the campaign wrote in an email. “Trump can’t raise money, isn’t campaigning, and is letting convicts and conspiracy theorists run his campaign.”\n\nElection filings made public Wednesday showed Trump’s 2024 campaign brought in $10.9 million last month, while his joint fundraising committee raised nearly $11 million. It has about $42 million in cash on hand.\n\nMeanwhile, Biden’s campaign operation raised roughly $53 million in February, which gave it $155 million in cash on hand entering March.\n\n“We are two weeks into the general election and Donald Trump can’t raise money, is hiding at his country club, and is letting convicts and conspiracy theorists take over his campaign. That is not a winning strategy,” Biden spokesperson Ammar Moussa said.\n\nThe campaign mocked Trump and questioned if “trailing your opponent in cash on hand by nearly 4 to 1 and hitting up donors to help cover your own personal debts instead of funding your campaign [is] a winning formula for November?”\n\nIt touted that Biden is traveling to every battleground state in March, while Trump held a rally in Ohio and has been at his home in Florida. And it argued that Trump is “bad” at messaging after he suggested that the U.S. look at potential cuts to entitlement programs, which he has since walked back.\n\nThe campaign taunted Trump earlier Thursday over his low fundraising numbers, saying that the former president would “fire himself” if he put up these kinds of numbers on “The Apprentice.”\n\nFor the latest news, weather, sports, and streaming video, head to The Hill.\n\nNews Related",
    "title": "Biden campaign calls Trump ‘Broke Don’ after he lags in fundraising",
    "date": "2024-03-22T00:21:00.000+02:00",
    "url": "https://newsexplorer.net/biden-campaign-calls-trump-broke-don-after-he-lags-in-fundraising-s2008554.html",
    "author": "VNExplorer"
}