{
    "text": "James Comer Eyes 'Criminal Referrals' from Biden Probe\n\nBiden Impeachment Probe The ongoing Biden impeachment inquiry, spearheaded by the House Oversight Committee, has been thrust into the spotlight as Representative James Comer, a key figure in the process, has signaled an interest in pursuing potential criminal referrals. via NBC This development has ignited a fresh wave of scrutiny and debate, underscoring the complex dynamics at play within the inquiry and its broader implications. The prospect of criminal referrals has injected a new dimension of intensity into the contentious inquiry.\n\nBiden's Business Dealings via ABC The House Oversight Committee's investigation into Hunter Biden's business dealings could result in \"criminal referrals\" to the Department of Justice, according to Committee Chair James Comer.\n\nDiscrepancies via NBC “I think that we’re at the point in the investigation where we need to hear the discrepancies,” Comer said. “I fully expect Hunter Biden to show up. If he [Hunter] does not show up, then it’s not going to end well for the Bidens, because we have three witnesses … that have already testified under oath to significantly different stories as to what exactly the Biden influence peddling schemes were,” he said.\n\nEvidence of wrongdoing via NBC “This is very serious because we’re at the point now of criminal referrals,” Comer said. Comer and other Republicans like Gaetz, Issa, and Higgins have said the investigation has found evidence of wrongdoing and influence peddling by the Biden family, though the standards for impeachment are high.\n\nBiden legal team via NBC “We have spent a year investigating this. We have faced massive obstruction from the White House, from the Biden legal team, yet we have been able to get probably 80 percent of the information that we have requested,” Comer said. “We have accumulated lots of evidence of wrongdoing. I can’t tell you a single legitimate business the Bidens had, other than they were influence peddling,” Comer added.\n\n\n\nBiden's Fate via NBC They maintain criminal referrals are a better option than impeachment, and that ultimately voters will decide Biden's fate in the 2024 election. Some Republicans argue this would be a symbolic move with little accountability, while others believe referrals could spur action if Republicans regain control of the DOJ after the 2024 election.\n\nPotential criminal referrals via NBC The House Oversight Committee's relentless pursuit of the impeachment inquiry against President Joe Biden has reached a critical juncture, with Rep. James Comer signaling a strategic shift towards exploring potential criminal referrals related to the Biden family's business dealings.\n\n'He deserves them' via CBS “He [Joe Biden] deserves them,” Rep. Matt Gaetz said of the criminal referrals. “I don’t think that a sufficient number of Republicans hold the view I do that a bribe can be consummated through a payment to a family member,” Gaetz added. “The D.O.J. is about to change hands … It’s about to be under new management.”\n\nMake a decision via NBC “If our investigation reveals that impeachment is not a righteous pursuit, perhaps a criminal referral is,” Rep. Clay Higgins said. “It’s a much heavier lift for impeachment,” he added. “So I would say that no matter what the Oversight Committee does, the American people are going to have an opportunity in November to make a decision.”\n\nRefused to testify via ABC Hunter Biden has refused to testify publicly after initially agreeing to do so. The absence of Hunter Biden, the panel's star witness, from a public hearing, despite his prior private testimony, has set the stage for Rep. Comer's assertion that \"it's not going to end well for the Bidens.\" This statement, coupled with the indication of \"multiple criminal referrals,\" has underscored the escalating stakes and the potential ramifications of the inquiry's trajectory.\n\nLeveraged their family via NBC The committee's narrative revolves around assertions that the Bidens leveraged their family name for influence-peddling, alleging a web of connections and interactions that seek to implicate Joe Biden in his son's business dealings. The focus on alleged discrepancies and influence-peddling has laid the groundwork for the potential pursuit of criminal referrals within the inquiry.\n\nDivergent reactions via CBS As the inquiry navigates the political landscape, the prospect of criminal referrals has elicited divergent reactions, with implications resonating beyond the confines of the committee's proceedings. The delicate balance of political pressure, public perception, and the intricacies of the impeachment inquiry has fueled a narrative of heightened significance and far-reaching implications.\n\nEscalating tensions via NBC Amid the escalating tensions and the potential trajectory of the inquiry, unresolved questions linger about the specific nature of the potential criminal referrals, the individuals who may be targeted, and the possible offenses under scrutiny. The evolving dynamics of the inquiry and the looming specter of criminal referrals have left the political landscape in a state of anticipation and speculation.\n\nComer's indication via NBC Rep. James Comer's indication of possible 'criminal referrals' from the Biden impeachment inquiry has injected a new layer of complexity and intensity into the proceedings.",
    "title": "James Comer Eyes 'Criminal Referrals' from Biden Probe",
    "date": "2024-03-21T16:45:00.000+02:00",
    "url": "https://curioushistorian.com/james-comer-eyes-criminal-referrals-from-biden-probe",
    "author": "Daniel Walker; March"
}