{
    "text": "Republikaner machen Biden für Afghanistan-Fiasko verantwortlich\n\nDrucken Teilen\n\nDer katastrophale Truppenabzug des US-Militärs aus Afghanistan wird Joe Biden auch Jahre später noch zum Verhängnis. Eine erneute Anhörung im Repräsentantenhaus bringt die Demokraten in die Defensive.\n\nDie für die tödliche Evakuierung Afghanistans verantwortlichen beiden ranghöchsten Generäle wurden am Dienstag erneut auf den Prüfstand gestellt. Die Republikaner im Repräsentantenhaus verstärkten ihre Kampagne, Präsident Biden für das Fiasko verantwortlich zu machen. Die Demokraten ihrerseits beschuldigten Donald Trump, die Bedingungen für den Zusammenbruch der Regierung in Kabul geschaffen zu haben.\n\nChaotischer Afghanistan-Abzug der USA wieder aufgerollt\n\nDie pensionierten Generäle Mark A. Milley und Kenneth „Frank“ McKenzie, Berufsmilitärs, haben unter beiden Präsidenten in leitenden Funktionen gedient. Sie sagten vor dem Ausschuss für auswärtige Angelegenheiten des Repräsentantenhauses im Rahmen seiner Untersuchung des katastrophalen Ausstiegs der Vereinigten Staaten aus einem 20-jährigen Krieg im August 2021 aus.\n\nGeneral Mark A. Milley, der damalige Vorsitzende der Generalstabschefs, sagt 2022 im Capitol Hill aus. © Jabin Botsford/The Washington Post\n\nMcKenzie sagte, dass das Pentagon zwar einen Plan für den Abzug aller US-Truppen, Diplomaten, Bürger und gefährdeten afghanischen Partner Monate, bevor die Taliban an die Macht zurückgekehrt sind, ausgearbeitet hatte. Biden aber stattdessen beschloss, die US-Botschaft offen zu lassen und bis auf ein paar Hundert Soldaten alle abzuziehen - und damit Zehntausende in Gefahr zu lassen.\n\nThe Washington Post vier Wochen gratis lesen Ihr Qualitäts-Ticket der washingtonpost.com: Holen Sie sich exklusive Recherchen und 200+ Geschichten vier Wochen gratis.\n\nEvakuierung durch Bidens Außenministerium „zu langsam, zu spät“\n\n„Ich denke, der grundlegende Fehler – der grundlegende Makel – war der Zeitpunkt des Aufrufs des Außenministeriums zur Evakuierung“, sagte Milley. „Ich denke, das war zu langsam und zu spät, und das hat dann zu der Reihe von Ereignissen geführt, die sich in den letzten paar Tagen ergeben haben.“\n\nDas wiederkehrende politische Rampenlicht auf die letzten Tage des Konflikts, die von Szenen grausamer Gewalt und Verzweiflung geprägt waren, hat die Demokraten gezwungen, sich mit einem dunklen Moment in Bidens Amtszeit als Präsident auseinanderzusetzen - während dieser gegen seinen Vorgänger für eine zweite Amtszeit als Oberbefehlshaber kämpft.\n\nViele demokratische Abgeordnete haben sich ihren republikanischen Kollegen angeschlossen und den Umgang der Regierung mit dem Rückzug kritisiert. Doch angesichts der bevorstehenden Neuauflage des Duells zwischen Trump und Biden stehen sie unter Druck, seine Position zu verteidigen.\n\nGerangel um Verantwortung für den Rückzug des US-Militär in Afghanistan\n\nWährend der gesamten Anhörung versuchten beide Seiten abwechselnd, ihren Respekt für die Generäle zu demonstrieren. Gleichzeitig wollten sie sie dazu drängen, den Präsidenten der anderen Partei als die Person anzuerkennen, die letztlich für das Evakuierungsfiasko verantwortlich ist.\n\nDer Ausschussvorsitzende Michael McCaul (Republikaner) sagte, das Weiße Haus habe sich geweigert, auf Warnungen zu hören, was in Afghanistan passiere, als die Taliban auf ihrem Marsch nach Kabul Städte und Bezirke zurückeroberten. Das Außenministerium habe erst am 14. August 2021 zu einer vollständigen Evakuierung aufgerufen – einen Tag, bevor die afghanische Regierung aus dem Land floh und Tausende von Zivilisten den Flughafen der Stadt in dem verzweifelten Versuch überrannten, sich selbst zu evakuieren.\n\nDer Abgeordnete Michael McCaul (R-TX) spricht bei einer Anhörung des Ausschusses für auswärtige Angelegenheiten des Repräsentantenhauses im Kapitol der Vereinigten Staaten am 19.03.2024. © Michael Brochstein/Imago\n\n„Wie das Sprichwort sagt: ‚Wer daran scheitert, zu planen, plant zu scheitern‘“, sagte McCaul über die Regierung Biden. „Und gescheitert sind sie.“ Er erstellte einen Zwischenbericht zum zweiten Jahrestag der Evakuierung im vergangenen August und wird voraussichtlich im Sommer eine endgültige Version veröffentlichen.\n\nBidens Behörden waren nicht ausreichend vorbereitet\n\nEine Untersuchung des Außenministeriums, die im Juni letzten Jahres veröffentlicht wurde, ergab, dass die Behörde „auf höchster Ebene nur unzureichend über Worst-Case-Szenarien nachgedacht hat“. Auch hätte sie nicht berücksichtigt, wie schnell diese eintreten könnten, nachdem Biden beschlossen hatte, Trumps Entscheidung zum Rückzug zu befolgen. Die Behörde hatte auch niemanden, der eindeutig für die Vorbereitung einer vollständigen Evakuierung zuständig war, so das Ergebnis der Untersuchung.\n\nEin Beamter des Außenministeriums sagte bezüglich der Anhörung am Dienstag, die Behörde sei „sehr stolz auf die Arbeit, die unter unglaublich schwierigen Umständen geleistet wurde, um die Umsiedlung von US-Bürgern, Personen mit ständigem Wohnsitz in den USA und Afghanen während des Abzugs und in der darauf folgenden Zeit sicherzustellen“.\n\nBeide Generäle im Ruhestand sagten, ihre Ausführungen stünden im Einklang mit stundenlangen Aussagen, die sie während ihrer aktiven Dienstzeit gemacht hätten – ein Punkt, den Repräsentant Gregory W. Meeks (N.Y.), der führende Demokrat im Ausschuss, zu betonen versuchte. „Hier gibt es nichts Bahnbrechendes!“, sagte Meeks und forderte die Gesetzgeber auf, stattdessen die Gesamtheit des Krieges zu betrachten und nicht nur sein Ende. Die überparteiliche Afghanistan-Kriegskommission, die letztes Jahr einberufen wurde, um den gesamten 20-jährigen Krieg zu untersuchen, wird voraussichtlich innerhalb von vier Jahren Ergebnisse vorlegen.\n\nExplosion in Kabul tötete während des Truppenabzugs 183 Menschen\n\nBei der Anhörung waren auch die Familien mehrerer US-Soldaten anwesend, die bei einem Bombenanschlag am Rande des Flughafens von Kabul getötet wurden, als die 17-tägige Evakuierung sich dem Ende neigte. Die Explosion folgte auf tagelange öffentliche Warnungen der Regierung Biden, dass der Islamische Staat, der einen Ableger in Afghanistan unterhält, kurz vor einem Angriff stehe. Bei dem Selbstmordanschlag starben schätzungsweise 170 Afghanen und 13 amerikanische Soldaten. Dutzende weitere wurden verwundet.\n\nDie Republikaner Cory Mills und Michael Lawler kritisierten McKenzie und Milley dafür, dass sie nicht die Aussage eines Scharfschützen der Marines, Sgt. Tyler Vargas-Andrews, beachtet haben. Dieser sagte, dass er kurz vor dem Angriff einen Mann in der Menge sah, auf den die Beschreibung des Selbstmordattentäters zutraf, ihm aber die Erlaubnis verweigert wurde, ihn zu erschießen. Vargas-Andrews, der bei der Explosion schwer verwundet wurde und bei der Anhörung am Dienstag anwesend war, hat den Gesetzgebern im vergangenen Jahr einen emotionalen Bericht über den Bombenanschlag und seine Folgen vorgelegt, der das Pentagon veranlasste, die Ergebnisse seiner Untersuchung des Vorfalls zu überprüfen. Es wird erwartet, dass die Ergebnisse dieser Untersuchung bald veröffentlicht werden.\n\nBiden: Übernahme Afghanistans durch die Taliban sei „höchst unwahrscheinlich“ gewesen\n\nMcKenzie und die Verantwortlichen des Pentagon erklärten der Öffentlichkeit im Jahr 2022, dass der Bombenanschlag auf den Flughafen „nicht zu verhindern“ gewesen sei. Der Abgeordnete Michael Waltz (Republikaner), ein pensionierter Offizier der Special Forces, sagte, er sei wütend, wenn er sich daran erinnere, wie Biden in den Wochen vor der Krise die Aussicht heruntergespielt habe, dass Afghanistan an die Taliban fallen könnte. In einem Fall, so Waltz, habe Biden im Juli 2021 gesagt, es sei „höchst unwahrscheinlich“, dass die Taliban das Land überrennen würden – obwohl die Generäle privat davor gewarnt hätten, dass ein solches Ergebnis schnell eintreten könne.\n\n„Meine Einschätzung war damals: Wenn wir die US-Streitkräfte auf null reduzieren würden, würden die afghanischen Regierung und die [afghanischen Streitkräfte] sehr wahrscheinlich zusammenbrechen und die Taliban würden die Macht übernehmen“, sagte Milley am Dienstag. „Aber ich persönlich dachte, es würde im Herbst sein, irgendwo um Thanksgiving herum. Die Einschätzungen gingen weit auseinander.“\n\nDas Weiße Haus, das zu Milleys Aussage befragt wurde, zitierte ein Dokument, das das Weiße Haus im vergangenen Frühjahr veröffentlicht hatte. In dem heißt es, dass Biden bei seinem Amtsantritt einen „bewussten, intensiven, strengen und umfassenden Entscheidungsprozess“ über den Umgang mit dem Krieg eingeleitet habe. „Letztendlich weigerte sich Präsident Biden, eine weitere Generation von Amerikanern in einen Krieg zu schicken, der für die Vereinigten Staaten schon längst hätte beendet sein sollen“, heißt es darin.\n\nUS-Visa für evakuierte Afghanen werden knapp\n\nMehrere Demokraten auf dem Podium versuchten, die ihrer Meinung nach widersprüchliche Haltung der Republikaner in der Afghanistan-Politik hervorzuheben. Sie wiesen darauf hin, dass die Empörung der Republikaner über die Aufgabe von US-Verbündeten sich in sinnvolle Hilfen für die zurückgelassenen Afghanen und diejenigen, die in die Vereinigten Staaten umgesiedelt wurden, niederschlagen sollte. Die Verbündeten waren während einer militärischen Luftbrücke, die 124.000 Menschen in Sicherheit brachte, gestrandet.\n\nFürsprecher für Afghanen, zu denen auch führende Veteranengruppen des US-Militärs gehören, haben davor gewarnt, dass Tausende von Afghanen, die der US-Mission gedient haben, in Afghanistan verbleiben. Zudem könne das Außenministerium bald keine speziellen Einwanderungsvisa mehr für sie ausstellen, wenn der Kongress nicht handelt.\n\nEs gibt etwa 20.000 Afghanen - ihre Familienangehörigen nicht mitgerechnet - die eine vorläufige Genehmigung erhalten haben und „bald ein Visum benötigen“. Dies schrieb eine überparteiliche Gruppe von Senatoren unter der Leitung von Senatorin Jeanne Shaheen (D-N.H.) letzte Woche in einem Brief an die Senatsführer. Am 1. März „waren noch etwa 7.000 Visa übrig“, so die Gruppe.\n\nUngefährliche Rückkehr nach Afghanistan werde „Jahre dauern“\n\nDemokrat Jason Crow, ein Armee-Veteran, der in Afghanistan gedient hat, forderte seine Kollegen auf, den Afghan Allies Protection Act zu unterzeichnen – eine parteiübergreifende Gesetzesvorlage, die immer wieder von den Republikanern vereitelt wird. Der Kongress könne immer noch „Leben retten, indem er dieses Gesetz verabschiedet und unseren Freunden den Weg nach draußen ebnet“, so Crow.\n\nZu den Autoren Dan Lamothe arbeitet seit 2014 für die Washington Post und berichtet über das US-Militär. Er schreibt seit mehr als 15 Jahren über die Streitkräfte, ist viel gereist, hat fünf Teilstreitkräfte kennengelernt und über Kampfeinsätze in Afghanistan berichtet. Abigail Hauslohner ist Reporterin für nationale Sicherheit bei der Washington Post mit Schwerpunkt auf dem Kongress. In ihrem Jahrzehnt bei der Zeitung war sie als Korrespondentin unterwegs und schrieb über Themen von Einwanderung bis hin zu politischem Extremismus und berichtete als Büroleiterin der Post in Kairo über den Nahen Osten. Leigh Ann Caldwell ist Mitautorin von The Washington Post‘s Early 202 und beschäftigt sich mit dem Kongress und der Politik. Außerdem ist sie Moderatorin bei Washington Post Live und führt Interviews mit hohem Nachrichtenwert. Bevor sie 2022 zu The Post kam, war Caldwell Korrespondentin bei NBC News, zuletzt als Mitglied der Kongressabteilung.\n\nDer Abgeordnete Dean Phillips (D-Minn.) fragte, wie lange es dauern wird, bis die Amerikaner Afghanistan auf ähnliche Weise besuchen können, wie er Vietnam besucht hat, um zu sehen, wo sein Vater getötet wurde. „Es wird Jahre dauern“, antwortete Milley. „Ich glaube, dass die Taliban immer noch eine terroristische Organisation sind. Ich glaube immer noch, dass sie unglaubliche, grausame Vergeltungsmaßnahmen in ihrem eigenen Land durchführen, und ich würde keinem Familienmitglied zu diesem Zeitpunkt empfehlen, zurückzukehren.“\n\nMilley fügte hinzu, dass es ihm schwer fallen werde, sich jemals mit den Taliban zu versöhnen. „Ich werde wahrscheinlich damit ins Grab gehen“, sagte er.\n\nWir testen zurzeit maschinelle Übersetzungen. Dieser Artikel wurde aus dem Englischen automatisiert ins Deutsche übersetzt.\n\nDieser Artikel war zuerst am 20. März 2024 in englischer Sprache bei der „Washingtonpost.com“ erschienen – im Zuge einer Kooperation steht er nun in Übersetzung auch den Lesern der IPPEN.MEDIA-Portale zur Verfügung.",
    "title": "Republikaner machen Biden für Afghanistan-Fiasko verantwortlich",
    "date": "2024-03-20T12:11:00.000+02:00",
    "url": "https://www.wasserburg24.de/politik/republikaner-machen-biden-fuer-afghanistan-fiasko-verantwortlich-zr-92902355.html",
    "author": "wasserburg24.de"
}