{
    "text": "Reading Time: 2 minutes\n\nThe Biden campaign took a victory lap on Wednesday over its major fundraising and cash advantage compared to the Trump campaign.\n\nElection filings made public on Wednesday showed Trump’s 2024 campaign brought in $10.9 million last month, while his joint fundraising committee raised nearly $11 million. His operation overall had about $42 million in cash on hand entering March.\n\nThose figured lagged far behind the Biden campaign operation, which raised roughly $53 million in February, giving it $155 million in cash on hand entering March.\n\n“If Donald Trump put up these kinds of numbers on The Apprentice, he’d fire himself,” Biden campaign communications director Michael Tyler said in a statement. “But here’s why he ain’t got it: his extreme, toxic agenda of banning abortion, slashing Social Security, and promoting political violence is repelling donors and doing exactly *nothing* to earn support from the voters who will decide this election.”\n\n“Even if he had the money, it’s not a message the voters would buy,” Tyler added.\n\nAmmar Moussa, another Biden campaign spokesperson, wrote on X, formerly known as Twitter, “I’m not a mathematician but I think we have A LOT more cash.”\n\nTrump, who became the GOP’s presumptive nominee earlier this month, could see a fundraising boost as he merges his operations with the Republican National Committee. The RNC reported Wednesday it had about $11 million in cash on hand at the end of February, trailing the Democratic National Committee’s $26 million cash on hand.\n\n2024 Election Coverage\n\nFurther compounding Trump’s problems, the former president has been burning through cash to pay his legal fees as he faces four separate criminal trials. He is also facing a looming deadline to pay a $454 million judgment after a New York judge determined he conspired to inflate his assets for tax and insurance benefits and was liable for fraud.\n\nWith interest piling on an additional $112,000 each day Trump doesn’t pay, the former president owes the state about $457 million as of Wednesday.\n\nBiden on Thursday will wrap up a three-day trip to Nevada, Arizona and Texas, which included three fundraisers. He will attend a major fundraiser in New York City next week alongside former President Barack Obama and former President Bill Clinton.",
    "title": "Biden campaign taunts Trump on low fundraising numbers: ‘He’d fire himself’",
    "date": "2024-03-21T15:03:00.000+02:00",
    "url": "https://dcnewssource.com/biden-campaign-taunts-trump-on-low-fundraising-numbers-hed-fire-himself",
    "author": "Lainey Steadman"
}