{
    "text": "Donald Trump has all the time beloved to boast about how a lot cash he has — or claims to have. When he introduced his presidential run in 2015, he pledged to self-finance his marketing campaign and crowed, “I don’t want anyone’s cash.” President Biden’s reelection marketing campaign reported Wednesday that it has $71 million in money available — greater than double the $33.5 million that Trump’s marketing campaign reported having. In case you throw within the financial institution balances of affiliated teams supporting the candidates, Trump’s marketing campaign liquidity rises to $42 million — however Biden’s soars to a surprising $155 million, a ridiculous quantity for this level within the cycle.\n\nIt makes me marvel about all these tales telling us how unenthusiastic Democrats are about Biden’s reelection. I’m beginning to assume that possibly — hear me out — we must always pay much less consideration to what folks say and extra to what they really do.\n\nThe Republican Nationwide Committee is in no place to bail the Trump marketing campaign out. It reported elevating $10.7 million in February, ending the month with $11.3 million within the financial institution. However the Democratic Nationwide Committee raised $16.6 million in February and was left with $26.6 million in money available. No marvel that Trump despatched daughter-in-law Lara Trump over to the RNC to attempt to enhance the steadiness sheet.\n\nObserve this writer Eugene Robinson ‘s opinions\n\nThe Biden marketing campaign will be excused for a little bit of chest-thumping. “If Donald Trump put up these sorts of numbers on ‘The Apprentice,’” communications director Michael Tyler mentioned in an announcement, “he’d fireplace himself.”\n\nIn the meanwhile, in fact, marketing campaign money may be the least of Trump’s cash considerations. His attorneys informed a New York court docket this week that the previous president has been unable to safe a bond that may give him time to enchantment a $454 million judgment in opposition to him and his firm for fraud.\n\nTrump approached greater than 30 corporations about underwriting the bond, his attorneys mentioned, however all refused to simply accept actual property as collateral — and actual property is the supply of most of Trump’s wealth. The insurance coverage agency Chubb did underwrite a $91 million bond for Trump to enchantment a separate civil judgment (for defaming author E. Jean Carroll) however determined to avoid the fraud case.\n\nNew York Lawyer Normal Letitia James might theoretically start seizing Trump’s property as quickly as subsequent week if he’s unable to safe and put up a bond. It will absolutely be galling for Trump to lose his gaudy triplex residence in Manhattan’s Trump Tower, the place he famously descended the escalator in 2015 to announce he was operating for president.\n\nDeclaring chapter is the one treatment assured to maintain the wolf away from Trump’s lavishly gilded door, however he has reportedly dominated it out. That may seemingly give him years of respiratory room on the huge fines, which Trump ought to know given his previous: He has used chapter six instances largely to get out from underneath his silly and ruinous foray into the on line casino enterprise in Atlantic Metropolis.\n\nAfter all, submitting for chapter in the midst of the marketing campaign would threaten Trump’s picture as a profitable, revered businessman. The Put up quoted a supply near Trump as saying: “He’d relatively have Letitia James present up with the sheriff at 40 Wall [a Trump office tower] and make an enormous stink about it than say he’s bankrupt.”\n\nTrump’s private money crunch is related as a result of the marketing campaign helps pay the hovering authorized payments that he and his associates — and co-defendants within the felony circumstances — are racking up. Trump’s Save America political motion committee has spent $8.5 million on authorized prices because the starting of the yr. The marketing campaign itself has paid one other $1.8 million to attorneys.",
    "title": "Opinion | Trump marketing campaign fundraising numbers present he’s already shedding to Biden",
    "date": "2024-03-21T21:32:00.000+02:00",
    "url": "https://ollertontoday.co.uk/2024/03/21/opinion-trump-campaign-fundraising-numbers-show-hes-already-losing-to-biden",
    "author": "admin"
}