{
    "text": "The biggest donor in this U.S. election cycle is Jeffrey Yass, a libertarian hedge fund owner who started off as a professional poker player and is now a major investor in TikTok's Chinese owner ByteDance.\n\nPhiladelphia-based Yass has donated more than $46 million to Republican causes so far in the 2024 election cycle, data from political donations tracker OpenSecrets shows.\n\nThe funds have gone to support former rivals of Donald Trump for the Republican presidential nomination, as well as a raft of groups supporting school choice, programs that use taxpayer dollars to send students to private and religious schools.\n\nYass, 65, was thrust into the spotlight this month after Trump, the Republican presidential candidate, reversed course on his preference for banning TikTok, saying a ban would hurt some children and only strengthen Meta Platforms' Facebook.\n\nTrump made the comments days after he met Yass at a gathering of the conservative Club for Growth donor group in Florida.\n\nThe U-turn on TikTok amid a major cash crunch led to speculation that Trump might be trying to court Yass.\n\nTrump says the pair only met for \"a few minutes,\" and did not discuss TikTok but instead talked about education.\n\nTrump has been significantly outraised on funding by Democrat President Joe Biden and faces hostility from many traditional Republican donors, all while scrambling for money to pay off around a half-billion dollars in legal judgments.\n\nYass, who leads Pennsylvania-based global hedge fund Susquehanna International Group and whose net worth Forbes puts at around $27 billion, has not donated to Trump.\n\nHe did, however, give money to support four of Trump's former opponents for the Republican presidential nomination: Entrepreneur Vivek Ramaswamy, Florida Gov. Ron DeSantis, Sen. Tim Scott, R-S.C., and former New Jersey Gov. Chris Christie, a major Trump critic.\n\nYass has not previously donated to Trump. A spokesperson for Yass declined to comment for this article.\n\nYass' political contributions have soared from the levels he spent in previous elections, OpenSecrets data shows. In the entire 2016 election cycle, for example, Yass and his wife donated just over $5 million – a ninth of his donations in the current cycle, which wraps up with the Nov. 5 general election.\n\nHis donations this cycle have included some $16 million to the Club for Growth Action, a super PAC funding group linked to the fiscally conservative Club for Growth non-profit. The Club for Growth is also against the TikTok ban.\n\nTo be sure, Yass and the Club for Growth have over the years also donated to many members of Congress who support banning TikTok, including Republican Senator Marco Rubio.\n\nPoker, Trading, and Schools\n\nThe son of two accountants and a math major himself, Yass went to Las Vegas after college and played poker professionally, Yass says in a video posted by Susquehanna on YouTube. He later moved to Philadelphia and worked as an options trader on the floor in 1981.\n\nA passion for betting and probability seems to permeate much of what he does.\n\n\"Sometimes I find myself at a race track literally trying to make $2 on an idea that I have,\" Yass, bespectacled and sitting in front of what appears to be a row of traders at their computers, said in the Susquehanna video.\n\nIn the political sphere, Yass is laser-focused on the issue of school choice programs, according to interviews with politicians who know him and fellow donors.\n\n\"He is truly a libertarian. His main interest is promoting school choice. That's what motivates Jeff,\" said Frayda Levin, a Republican donor who knows Yass and sees him at events at the Cato Institute, a libertarian think tank.\n\nLibertarians typically support maximizing individual rights and minimizing the role of government.\n\nIn addition to having poured millions into supporting school choice on a political level, Yass and his wife Janine Yass, with whom he has four children, award monetary prizes to education providers.\n\nSchool choice programs have gained wide appeal in recent years as some parents have become disgruntled with the state of U.S. public education, for reasons ranging from underfunding to concerns about what is taught in classrooms.\n\nHowever, some Democrats view the push to use state funds for private and religious schools with suspicion, saying they are attempts by Republicans to weaken public education while further enriching wealthy families.",
    "title": "TikTok Investor Yass Top Election Donor for Trump Primary Opponents | Newsmax.com",
    "date": "2024-03-21T14:18:00.000+02:00",
    "url": "https://www.newsmax.com/us/tiktok-jeffrey-yass-donald-trump/2024/03/21/id/1158056",
    "author": "Alexandra Ulmer"
}