{
    "text": "By Jaro Nemčok - http://nemcok.sk/?pic=32448, CC BY-SA 3.0, https://commons.wikimedia.org/w/index.php?curid=25948318\n\nPennsylvania’s largest solar farm has been awarded $90 million and will sit on 2,700 acres of the shuttered Homer City coal plant’s land.\n\nThe Mineral Basin Solar Project will be located on Homer City’s former coal mining land in Clearfield County, west of State College. It will fill a critical electricity generation gap following Pennsylvania’s largest coal plant‘s closure in July 2023.\n\nRenewables developer Swift Current Energy (SCE) will build a utility-scale 402 MW solar farm capable of producing enough clean energy to power 75,000 homes. SCE says on Mineral Basin’s website that it’s considering adopting offsite battery energy storage for the project.\n\nMineral Basin will serve as a pilot for SCE, which plans to develop around 1,000 MW of solar on former coal mine sites in the Appalachian region over the next five years.\n\nThe federal funding for the solar farm was announced today by the US Department of Energy and came from money already earmarked by the Biden administration’s Bipartisan Infrastructure Law.\n\nSecretary of Energy Jennifer Granholm said, “Thanks to the President’s Investing in America agenda, DOE is helping deploy clean energy solutions on current and former mine land across the country – supporting jobs and economic development in the areas hit hardest by our evolving energy landscape.”\n\nThe project expects to create more than 750 construction jobs and six operations jobs, while providing $1.1 million in annual tax revenue to townships, the county, and local school district.\n\nConstruction on Pennsylvania’s largest solar farm could begin this summer, and it’s expected to come online by the second half of 2026. The New York State Energy Research and Development Authority (NYSERDA) awarded it a 20-year power purchase agreement in November 2023.\n\nMineral Basin Solar Power, LLC, says it will invest nearly $20 million in economic development to create opportunities for young people and adults who want to upskill, right-skill, and reskill across high-demand sectors in the 27-county region.\n\nTo limit power outages and make your home more resilient, consider going solar with a battery storage system. In order to find a trusted, reliable solar installer near you that offers competitive pricing, check out EnergySage, a free service that makes it easy for you to go solar. They have hundreds of pre-vetted solar installers competing for your business, ensuring you get high quality solutions and save 20-30% compared to going it alone. Plus, it’s free to use and you won’t get sales calls until you select an installer and you share your phone number with them.\n\nYour personalized solar quotes are easy to compare online and you’ll get access to unbiased Energy Advisers to help you every step of the way. Get started here. – ad*",
    "title": "Pennsylvania's largest solar farm will replace its largest coal plant | Electrek",
    "date": "2024-03-21T18:04:00.000+02:00",
    "url": "https://electrek.co/2024/03/21/pennsylvanias-largest-solar-farm-will-replace-its-largest-coal-plant",
    "author": "Electrek"
}