{
    "text": "Senate Republican Minority Leader Mitch McConnell is again taking GOP Speaker Mike Johnson to the woodshed – although this time not by name – for refusing to put on the floor for a vote the Senate’s bipartisan bill that would provide critical aid to Ukraine. Some political experts have said the legislation would easily pass by a wide margin, and others have blasted the Speaker for his refusal, noting his history as a backbencher of voting against supporting Ukraine.\n\nOne week ago McConnell told reporters, “I want to encourage the Speaker again to allow a vote – let the House speak” on the Senate’s Ukraine aid bill.\n\nMore than a month ago, on February 13, the Senate passed a $95 billion aid package, known as the national security supplemental, with funding for Ukraine and Israel. As soon as it passed Johnson made clear it would not see a vote in the House. Donald Trump opposes the legislation.\n\n“The foreign aid package includes billions of dollars to support Ukraine and for security assistance for Israel, as well as humanitarian assistance for civilians in Gaza, the West Bank and Ukraine, among other priorities,” CNN reported at the time. The vote was 70-29, and included 22 Republicans, among them, McConnell.\n\n“Every day that the national security supplemental stands as a Senate-passed bill and not a law is the day that America’s adversaries smile,” McConnell declared in a five-minute speech Tuesday on the Senate floor (video below). “The decision before Congress both in annual appropriations as well as the supplemental are about more than Ukraine or Israel. They are about whether America has the will to defend our interests and uphold our influence.”\n\nPunchbowl News senior congressional reporter Andrew Desiderio called McConnell’s remarks an “implicit jab at Johnson — though not by name.”\n\nREAD MORE: ‘Target on the Back of Every Brown Person’: SCOTUS Slammed for ‘Show Me Your Papers’ Ruling\n\nMcConnell also warned that Russian President Vladimir Putin is “on track to pass Joseph Stalin as the longest ruling despot in modern Russian history.”\n\n“For the past two years, Putin has sacrifice tens of thousands of his countrymen on the altar of an obscene neo-Soviet fantasy of Stalinist empire building. The human cost of Russia’s war progression to Russians and Ukrainians alike is truly treacherous.”\n\nHe also noted that “former Russian President Medvedev laid out exactly how Putin intends for his lawless conquest to end. Here’s what he said: The entire territory of Ukraine is the territory of the Russian Federation. As he sees it Ukraine’s complete and unconditional surrender, full demilitarization and reparations to Russia will help forge a benevolent consensus of peace.”\n\nMcConnell added that “Putin and his allies are emboldened precisely because the West is hesitating, because America is hesitating. They’re spelling out their true intentions because they sense that we might not have the resolve to actually resist them. Here’s the truth. Russia is playing for keeps. It’s set on subjugating its sovereign democracy. Whole hog. There is every reason to believe the war ends with a negotiated outcome, most wars do. But it’s absurd and self defeating to insist on negotiations without preparing Ukraine to operate from a position of strength. Whether or when Putin ever decides to turn from his bid for total conquest to the negotiating table, it will be lethal Western assistance that determines what comes next.”\n\nREAD MORE: Ramaswamy Eyed for Homeland Security Head if Trump Re-Elected: Report\n\n“That is why Congress does need to influence the eventual outcome of the conflict. What we do will determine whether an administration that wants to facilitate negotiations has the leverage to produce terms favorable to America and our allies. Our next move will either reaffirm America’s global influence, or kneecap both Washington and Kyiv.”\n\n“If Congress does its job, it’ll be American weapons in Ukrainian hands, and stronger forces and intense industrial capacity. here at home that determines what conclusions the world draws from the first major landmark in Europe since 1945.”\n\nWatch below or at this link.",
    "title": "McConnell Rips Johnson Again Over Ukraine",
    "date": "2024-03-20T00:35:00.000+02:00",
    "url": "https://www.thenewcivilrightsmovement.com/2024/03/mcconnell-rips-johnson-again-over-ukraine",
    "author": "David Badash"
}