{
    "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nThe Biden administration and the state of Texas on Wednesday are making oral arguments in a high-profile case over the state’s anti-illegal immigration law — hours after it was briefly blocked by the Supreme Court.\n\nThe oral arguments over the law, known as Senate Bill 4, were set to begin at 11 a.m. ET. The law, signed by Gov. Greg Abbott in December, allows police to arrest those suspected of entering the U.S. illegally. It adds \"improper border entry\" as a new criminal offense and state judges would be allowed to order deportations to Mexico.\n\nThe Biden administration sued over the law, which it said crossed into federal authority on matters related to immigration enforcement. It marks the most significant effort by a state to challenge federal enforcement since an Arizona law in 2012 — which was eventually struck down by the Supreme Court.\n\nMEXICO SLAMS TEXAS OVER IMMIGRATION LAW, WON'T ACCEPT REPATRIATIONS FROM STATE AFTER SCOTUS RULING\n\n\"Its efforts, through SB 4, intrude on the federal government’s exclusive authority to regulate the entry and removal of noncitizens, frustrate the United States’ immigration operations and proceedings, and interfere with U.S. foreign relations,\" the Department of Justice said in its January lawsuit.\n\nTexas, however, has said the law is necessary due to a void in immigration enforcement by the Biden administration amid a historic and ongoing crisis at the southern border, where Texas has been on the front line.\n\nGOVERNOR WHO CLASHED WITH OBAMA OVER ATTEMPTED ILLEGAL IMMIGRATION CRACKDOWN REACTS TO SCOTUS TEXAS RULING\n\n\"The President of the United States has a constitutional duty to enforce federal laws protecting States, including laws already on the books that mandate the detention of illegal immigrants,\" Abbott argued last month. \"Texas has the right to defend itself because of President Biden's ongoing failure to fulfill his duty to protect our state from the invasion at our southern border.\"\n\nThe Fifth Circuit of Appeals had blocked the law from going into effect. The Supreme Court on Tuesday evening, not ruling on the merits of the case, allowed the law to go into effect and kicked it back to the Fifth Circuit.\n\nHours later, the Fifth Circuit again put the law on hold, ahead of oral arguments on the merits of the case on Wednesday.\n\nSUPREME COURT OKS LAW LETTING TEXAS POLICE ARREST MIGRANTS SUSPECTED OF ILLEGALLY CROSSING BORDER\n\nThe battle over the law is the latest legal feud between Texas and the administration over how to handle the crisis at the border. The two sides have also fought in the courts over the construction of razor wire by Texas and the establishment of buoys in the Rio Grande.\n\nIn January, Texas seized Shelby Park — a key area of Eagle Pass for migrant crossings — and refused to allow federal officials into the area.\n\nThe Supreme Court ruling on Tuesday brought an immediate protest from Mexico as well, which said it would not accept any attempt to return migrants by state authorities.\n\n\"Mexico recognizes the importance of a uniform migration policy and the bilateral efforts with the United States to ensure that migration is safe, orderly and respectful of human rights, and is not affected by state or local legislative decisions. In this regard, Mexico will not accept, under any circumstances, repatriations by the State of Texas,\" Mexico’s Foreign Ministry said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIt comes as the crisis at the border is set to be a top issue in the upcoming general election in November. Both President Biden and former President Trump visited Texas last month and made their respective pitches.\n\nTrump has called for mass deportations and has expressed his support for Abbott’s efforts to secure the border. Biden has urged Congress to pass a bipartisan border funding bill hashed out in the Senate, arguing that his administration needs reforms and more funding in order to be able to secure the border.\n\nFox News Digital's Louis Casiano contributed to this report.",
    "title": "Biden admin, Texas head back to appeals court over anti-illegal immigration law, hours after SCOTUS ruling | Fox News",
    "date": "2024-03-20T02:00:00.000+02:00",
    "url": "https://www.foxnews.com/politics/biden-admin-texas-head-back-appeals-court-anti-illegal-immigration-law-hours-scotus-ruling",
    "author": "Adam Shaw"
}