{
    "text": "In February, President Joe Biden’s reelection campaign demonstrated a significant increase in fundraising, collecting $21 million, which elevated its cash on hand to $71 million. This financial boost contributed to a combined total of $97.5 million available for Biden’s campaign and the Democratic National Committee (DNC), a figure that notably surpasses the $44.8 million held by former President Donald Trump’s campaign and the Republican National Committee (RNC). These figures exclude funds from both parties’ joint fundraising efforts.\n\nDespite trailing behind Trump in early polling for the general election, Biden’s growing financial resources provide an edge. In contrast, Trump’s fundraising this cycle has not matched his 2020 campaign efforts, partly due to funds being allocated to his legal expenses through a leadership PAC. Biden’s campaign has been considerably more frugal in legal spending, reporting only $122,000 in such expenses.\n\nBiden’s campaign is leveraging its financial advantage to initiate a substantial advertising push, marked by a recent $30 million investment in TV and digital ads, aimed at countering Trump. Although Biden’s fundraising totals still fall short of those seen in the 2020 campaign for the same period, the campaign’s strategic ad spending and mockery of Trump’s financial challenges underscore its aggressive approach.\n\nIn addition to ad expenditures, Biden’s campaign is ramping up its operations. Following the State of the Union address, a new ad campaign targeting swing states was launched, with $1.9 million spent on advertising in just one week. The campaign also celebrated a $10 million fundraising milestone within 24 hours post-State of the Union.\n\nOperational expenses are on the rise, with February’s payroll expanding from nearly $1.2 million in January to over $1.6 million. Significant investments were made in media production, travel, and text messaging, alongside notable spending at Capriotti’s Sandwich Shop, a favorite of Biden’s. As the campaign moves forward, it plans to significantly increase staff, particularly in swing states, indicating a strategic build-up for the forthcoming election battle.",
    "title": "Biden Campaign Bolsters Fundraising, Sets Sights on Ad Campaign Against Trump - News Facts Network",
    "date": "2024-03-21T11:20:00.000+02:00",
    "url": "https://newsfactsnetwork.com/news/biden-campaign-bolsters-fundraising-sets-sights-on-ad-campaign-against-trump",
    "author": "newsfactsnetwork"
}