{
    "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nRobert F. Kennedy Jr.'s presidential campaign racked up $1.4 million in debt to a private security firm, while the Biden administration has repeatedly denied his requests for Secret Service protection.\n\nAccording to their latest filing with the Federal Election Commission on Wednesday, Kennedy's campaign raised $3.1 million in February but spent $2.8 million that same month. That is not including the $1.4 million the Kennedy campaign also owes to Gavin De Becker and Associates, the private security firm owned by De Becker, a security specialist and longtime friend of Kennedy, according to Politico.\n\nNot including withstanding debt, the campaign paid just over $200,000 last month for security services and related travel expenses, raising the total paid to Gavin de Becker & Associates to more than $2 million.\n\nMeanwhile, De Becker has donated millions in what he deemed both contributions and \"bridge funding\" to the pro-Kennedy super PAC American Values 2024. According to a separate FEC filing by the political action committee on Wednesday, De Becker donated another $4 million last month. That accounts for nearly all the total $4.1 million American Values 2024 reported garnering in February.\n\nCRUZ DEMANDS ANSWERS FROM MAYORKAS ON DENIAL OF SECRET SERVICE PROTECTION FOR RFK JR\n\nDe Becker has become the largest donor to the super PAC, second to Republican mega-donor Tim Mellon, Politico reported.\n\nDespite having raised nearly $28 million since kicking off his presidential campaign in April 2023, Kennedy has spent heavily. At the end of February, the campaign reported $5 million in cash on hand. Biden's campaign reported $71 million in cash on hand at the end of February, and former President Trump's campaign reported $33.5 million in cash on hand, Wednesday's FEC filings show.\n\nKennedy has assailed Biden for having rejected at least three requests for U.S. Secret Service protection while on the 2024 campaign trail. His father, former U.S. senator, U.S. Attorney General and presidential candidate Robert F. Kennedy, was assassinated in 1968, and his uncle, former President Kennedy, was assassinated in 1963,\n\nRFK JR TRESPASSER INCLUDED IN SECRET SERVICE RISK ASSESSMENT MONTHS BEFORE DHS DENIED PROTECTION: SOURCE\n\nAs recently as December, Biden's Homeland Security Secretary Alejandro Mayorkas deemed that Secret Service protection for Kennedy \"is not warranted at this time,\" according to a letter obtained by Deseret News. According to Kennedy, that was despite several documented death threats against him.\n\nIn late October, a man was arrested twice for trespassing at Kennedy's home twice in the same day.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe suspect, Jonathan Macht, was listed in a Secret Service risk assessment as part of the candidate's first request for protection in June, sources told Fox News Digital at the time. The assessment deemed Kennedy was at elevated risk, but the Democrat turned independent presidential candidate's request for protection was still denied by Homeland Security.\n\nFox News' Brooke Singman contributed to this report.",
    "title": "RFK Jr racks up $1.4M debt with private security firm as Biden ignores plea for Secret Service protection | Fox News",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.foxnews.com/politics/rfk-jr-racks-up-1-4m-debt-private-security-firm-biden-ignores-plea-secret-service-protection",
    "author": "Danielle Wallace"
}