{
    "text": "Hunter Biden could almost be pitiable, if he weren’t such a degenerate, spineless weasel.\n\nHaving been protected for years by big daddy Joe Biden’s influence and political power, the younger Biden is now having to answer for his multiple transgressions, and clearly doesn’t have the guts to justify his actions in public.\n\nAnd, as National Review reported last week, Biden has no plans of dropping this deplorable pattern of cowardice.\n\nEven though the younger Biden was quite vocal in his demands for a public hearing a few months ago, he has rejected the House Oversight Committee Chairman James Comer’s invitation to testify publicly regarding his business dealing on Wednesday. Instead, his former business partners will testify about the extent of now-President Joe Biden’s involvement in Hunter’s business affairs.\n\nThe hearing is titled: “Influence Peddling: Examing Joe Biden’s Abuse of Public Office.”\n\nAnd dodging it is just Hunter’s latest dodge of responsibility.\n\nFrom skipping out on his first deposition to hold a pity party of a press conference on the Capitol steps (just out of reach of the House sergeant at arms), to using his personal failings as a sob story to garner sympathy with the establishment media, he’s done almost everything short of owning up to his failings and admitting guilt.\n\nIncluding just getting up and walking out when someone he doesn’t like starts questioning him.\n\nToo bad us normies can’t do that when fielding uncomfortable questions during a trial.\n\nDo you believe Hunter Biden is corrupt? Yes No\n\nCompleting this poll entitles you to our news updates free of charge. You may opt out at anytime. You also agree to our Privacy Policy and Terms of Use. Yes: 100% (18 Votes) No: 0% (0 Votes)\n\nWith the word that the younger Biden has rejected the opportunity to publicly testify, Rep. Marjorie Taylor Greene of Georgia on Tuesday trolled the president’s son with video evidence of his cowardice from an oversight committee meeting back in January.\n\nHunter had dropped in on the meeting unannounced. But as Greene shared with the good folks on the social media platform X, Hunter Biden decided, that instead of letting her ask a single question, he was just going to up and leave.\n\nHunter Biden is afraid to face me at the Oversight Committee hearing tomorrow. And we all know why… 🐓🐓🐓#WheresHunter pic.twitter.com/9thd2piIrD — Rep. Marjorie Taylor Greene🇺🇸 (@RepMTG) March 19, 2024\n\nAs seen in the video, right as Greene was about to ask Biden a question, he and his legal team got up and left the room, to the consternation of many at the meeting.\n\nGreene began, “thank you Mr. Chairman,” before noting Biden swiftly departing, calling after him “excuse me!”, amid questions of “where is he going?” as he continued to ignore her.\n\nGreene then continued, telling him “apparently, Hunter, you’re afraid of my words” as he fled the room.\n\nShe then addressed her fellow representatives, saying that, “I think it’s clear and obvious that for everyone watching this hearing today that Hunter Biden is terrified of strong, conservative, Republican women. Because he can’t even face my words as I was about to speak to him. What a coward.”\n\nWhat a coward indeed.\n\nOf course, anyone who’s been following Joe Biden’s disaster of a younger son knew that already.\n\nAfter all, this is a man too afraid to even acknowledge his own illegitimate daughter until forced to by the courts.\n\nEven so, witnessing such a stark example of his blatant cowardice is disturbing. And even after two months, the scene in the oversight committee hearing is shocking.\n\nNow, Marjorie Taylor Greene is a bit infamous among conservative and liberal circles alike for running her mouth and making herself obnoxious, publicly saying uncomfortable things most politicians would rather remain cloaked in euphemisms and gentle language.\n\nHowever, sometimes her blunt, uncompromising style is just what the doctor ordered for the D.C. swamp.\n\nThe Biden administration has become notorious for a lack of transparency, especially regarding the younger Biden’s controversial business decisions.\n\nIn this instance, Greene is absolutely right to call him out for his cowardice.\n\nAs one X user wrote: “Like all in the Degenerate Party, the law doesn’t apply to them — nothing will happen.”\n\nLike all in the Degenerate Party, the law doesn’t apply to them — nothing will happen. https://t.co/DCscB2VfYw — JW (@jtw372) March 19, 2024\n\nGranted, her abrasive personality ensured her comments and retweets were incredibly divided, but in this case, you can’t argue that this makes Hunter Biden look pretty bad.\n\nAnother user shared an interesting insight, commenting “this is how someone with something to hide acts.”\n\nthis is how someone with something to hide acts. https://t.co/H0yyLY0JNs — Mini Ghost™ (@ghostofdark) March 19, 2024\n\nHunter Biden has an entire legion of skeletons in his closet.\n\nAnd we need more people like Greene to call him out on his cowardly evasions and escapes.\n\nHe might be the son of the president, but he can’t run forever.\n\nThis article appeared originally on The Western Journal.\n\nSubmit a Correction → * Name\n\n* Email\n\n* Message\n\n\n\n* All fields are required. Success!",
    "title": "MTG Trolls 'Terrified' Hunter Biden with Shocking Clip on the Eve of Joe Biden 'Influence-Peddling' Hearing",
    "date": "2024-03-20T06:11:00.000+02:00",
    "url": "https://www.patriotproject.com/mtg-trolls-terrified-hunter-biden-shocking-clip-eve-joe-biden-influence-peddling-hearing",
    "author": "Allison Anton, The Western Journal"
}