{
    "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nHouse Republicans may invite Prime Minister Benjamin Netanyahu to address Congress in the coming days amid a growing rift between President Biden's administration and the Israeli government.\n\nIsrael is sending a delegation to discuss plans for an invasion of Rafah with White House officials. Biden's administration has repeatedly criticized Israel's plans, and Senate Majority Leader Chuck Schumer, D-N.Y., publicly disavowed Netanyahu's leadership in a floor speech last week that drew condemnation from Republican leadership and Israeli officials.\n\nHouse Speaker Mike Johnson, R-La., said he had a \"lengthy conversation\" with Netanyahu on Wednesday morning, but he did not confirm plans to invite him to give an address.\n\n\"We didn't talk about those logistics, but it's one of the things that we have in mind, and we may try to arrange for that,\" Johnson told reporters. \"I think it's very important for us to show solidarity and support with Israel right now in their time of great struggle. And we certainly stand for that position. We'll try to advance that in every way that we can.\"\n\nSCHUMER TRASHED FOR ‘DISGUSTING’ SPEECH CALLING ON ISRAEL TO DUMP NETANYAHU: ‘OUTRAGEOUSLY INAPPROPRIATE’\n\nRelations between the U.S. and Israel reached a low point last week when Schumer called for Israel to hold elections and remove Netanyahu from office.\n\nSCHUMER'S ANTI-NETANYAHU SPEECH STRENGTHENS BIBI IN ISRAEL'S WAR TO DEFEAT HAMAS\n\nThe majority leader said he believed that \" Prime Minister Netanyahu has lost his way by allowing his political survival to take the precedence over the best interests of Israel.\"\n\nNetanyahu responded in a Sunday appearance on \"Fox & Friends Weekend.\"\n\n\"I think Schumer's statements are wholly inappropriate. I think we're not a banana republic. The people of Israel will choose when they'll have elections, who they elect, and it's not something that will be foisted upon us,\" he said.\n\n\"Just imagine that, after 9/11, and when you're in the midst of fighting al Qaeda, and winning... some Israeli would say, ‘Oh, the right thing to do is not to have new elections in America or have President Bush resign.’ It's inappropriate. Shouldn't have been said. It's wrong,\" he added.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nA coalition of conservative groups organized by former Vice President Mike Pence's nonprofit, Advancing American Freedom, released a letter Wednesday similarly demanding Netanyahu be invited to speak.\n\n\"We respectfully request that you extend an invitation to Israeli Prime Minister Benjamin Netanyahu to address a joint session of Congress,\" the letter from the coalition addressed to Johnson states. \"The address would allow Prime Minister Netanyahu to directly update Congress and the American people on the ongoing war.\"\n\nSigners of the letter include Republican Jewish Coalition CEO Matt Brooks, Zionist Organization of America President Morton Klein, and Media Research Center founder L. Brent Bozell III.\n\nThe letter continues, \"It would help fact cut through fiction, as the media’s attention on the Israel-Hamas war and the remaining hostages, particularly the five Americans still believed to be held hostage by Hamas, continues to fade.\"\n\nNetanyahu's office was not immediately available for comment.",
    "title": "House Republicans may invite Netanyahu to address Congress amid rift with Biden, Democrats | Fox News",
    "date": "2024-03-20T02:00:00.000+02:00",
    "url": "https://www.foxnews.com/politics/house-republicans-may-invite-netanyahu-address-congress-rift-biden-democrats",
    "author": "Anders Hagstrom"
}