{
    "text": "On April 7, 1992, then-Senator Joe Biden criticized those who interfered in Israel’s affairs.\n\nHe declared: “The absurd notion that publicly vilifying Israel will somehow change its policy; who in the hell do we think we’re dealing with? What makes us think, even if the administration is 100% correct on the policy, what makes them think that in the midst of an election campaign, in the midst of a so-called peace talk, that we can publicly vilify a nation, persons, and think that a leader is going to say, now I will yield before the world and God, because I’ve been told? What in the hell do we think we’re doing?”\n\n\n\nBiden noted, “Why, why is there any incentive for the Arabs to make any compromise, any compromise, in the peace talks? Why, if they know that they must only wait for the United States to do their bargaining for them? Why would they compromise? Why would they be reasonable?”\n\nInterestingly, James Baker was serving as secretary of state at the time. Baker is infamous for his comment “F— the Jews, they don’t vote for us anyway.” Baker’s comments proved a self-fulfilling prophecy. His boss, President George H.W. Bush, went from 35% of the Jewish vote in 1988 to 12% in the 1992 election, which he lost to Bill Clinton.\n\nBaker wasn’t the first to make such a miscalculation. President Jimmy Carter’s Chief of Staff Hamilton Jordan warned Carter that his policies towards Israel would alienate American Jews. Carter ignored him and went from 71% of the Jewish vote in 1976 to 45% in the 1980 election he lost to Ronald Reagan.\n\n\n\nToday, President Joe Biden, Secretary of State Antony Blinken and even Senate Majority Leader Chuck Schumer appear to have adopted the same failed strategy, except to them, the watchword is, in effect: F— the Jews, they’ll vote for us anyway. But just as Baker and Carter were wrong to discount the Jewish vote, those who do so now to justify policies hostile to Israel do so at their own peril.\n\nBy strange coincidence, New York Times columnist Thomas Friedman is again playing a major role in all this. Back in the early ‘90s, Friedman played tennis with Baker and served as the press mouthpiece for Baker’s policy of blaming Israel for the lack of Middle East peace. At the time, Baker and Bush were pressuring then-Israeli Prime Minister Yitzhak Shamir to forgo his insistence on bilateral negotiations. They did so by threatening to withhold U.S. loan guarantees intended to assist Israel in absorbing a million olim from the Soviet Union.\n\nToday, Friedman is once again a mouthpiece, this time for the Biden administration’s policy of attacking Israeli Prime Minister Benjamin Netanyahu over Israel’s defensive war against Hamas. Rather than insist on Hamas surrendering and releasing all the hostages—including the American ones—which would end the war immediately, the administration is more interested in pandering to a few thousand Muslim voters in swing states who hate Israel and often support Hamas. This is an offensive and self-destructive policy.\n\nThere are already strong signs that, as a result of his misguided approach, Biden is hemorrhaging Jewish support. A Sienna poll of New York voters found former President Donald Trump winning the Jewish vote by a wide margin. This is in keeping with the results of the 2020 election, which saw Trump’s share of Florida’s Jewish voters rise from 23% in 2016 to 41%.\n\nThe overwhelming majority of American Jews and Americans in general support Israel and disdain Hamas. The exponential rise in antisemitic incidents and failure of Biden’s vaunted plan to combat antisemitism, as well as his failure even to mention the problem in his State of the Union address are also leading many Jews to drop their support for Biden.\n\nIn 1992, Friedman and Baker inadvertently undermined Jewish support for the Republican Party. Friedman and Biden are now doing the same to the Democrats. History demonstrates that sitting presidents who turn on Israel always end up in failure and defeat.\n\n\n\nImage - Reuters",
    "title": "Biden is risking the Jewish vote",
    "date": "2024-03-21T19:30:00.000+02:00",
    "url": "https://www.newsrael.com/posts/ovdeee8fc5",
    "author": "JNS"
}