{
    "text": "Cleavages within the party could further complicate President Joe Biden's path to reelection.\n\nUS President Joe Biden attempted to flip the script on immigration during his State of the Union address last Thursday, calling out Republicans for tanking the bipartisan immigration bill that also included funding for Ukraine and Israel. Noting that “conservatives got together” with Senate Democrats and “said it was a good bill” before former President Donald Trump pressed congressional Republicans to oppose it, he asserted that Trump should ask Congress to support the compromise “instead of playing politics.”\n\nRecent polls show that immigration is one of the top concerns for the American electorate who tend to rate Biden poorly on this issue. While a majority of Democrats across the board welcome immigrants and support a path to citizenship for undocumented migrants, there are some significant differences between moderate and liberal Democrats on the appropriate levels of legal immigration and whether to differentiate acceptance of immigrants by their country of origin. These cleavages could further complicate the 2024 election landscape as Biden struggles to hold together his winning 2020 electoral coalition.\n\nKey Findings\n\nRelatively few liberal (11%) and moderate Democrats (29%) consider immigration a critical threat.\n\nA larger majority of liberal than moderate Democrats support a path to citizenship for undocumented workers without any conditions (65% vs. 51%).\n\nHalf of both liberal (46%) and moderate (52%) Democrats support maintaining current levels of legal immigration. But liberals tend to endorse increasing legal immigration (44%) over decreasing it (9%), while moderates are slightly more likely to say it should be decreased (27%) than increased (20%).\n\nMajorities from both Democratic camps favor accepting migrants from Taiwan, Ukraine, Haiti, Central America, India, and Korea.\n\nMajorities of liberal Democrats also favor accepting immigrants from Sudan, Afghanistan, Russia, and China; moderates are at best divided and often opposed.\n\nDemocrats Tilt Leftward\n\nIn the 2023 Chicago Council Survey, 60 percent of Democrats describe themselves as liberal (10 percent extremely liberal, 35 percent liberal, and 15 percent slightly liberal). The rest consider themselves to be moderate or middle of the road (32%), and a handful consider themselves some degree of conservative (5% slightly, 2% conservative, 1% extremely conservative). For the purposes of this analysis, we grouped moderate and conservative Democrats together and refer to them as simply “moderates” (see appendix for more detail on these groups).\n\nDemocrats have steadily become more liberal since 2016. They were more or less evenly divided between 2014 and 2016. Prior to that, a majority considered themselves to be moderate or conservative. Liberal Democrats tend to be younger and from more diverse backgrounds, are more likely to express a favorable view of Biden (86%) than moderates (72%), and are also more likely to have very favorable views of Biden (38% liberals, 23% moderates).\n\nMajorities of Democrats Say Increasing Diversity Makes the Country Better\n\nTrump rode to prominence in 2015 on the backs of immigrants; namely, insulting and criticizing US immigration policy in language unheard of from any recent presidential candidate. While these comments seem to resonate with the Republican base who view immigration as a critical threat to the United States (72%), they don’t have as much significance for Democrats. Relatively few Democrats see immigration as a critical threat (18% overall Democrats), though moderate Democrats are more likely to view it as a threat (29%) than liberal Democrats (11%).\n\nDemocrats tend to embrace the melting pot view of the United States. Majorities of both moderates and liberals say that the increasing number of people from many different races, nationalities, and ethnic groups makes the United States a better country to live in (84% liberal, 56% moderate). But while liberal Democrats decisively state that increasing diversity makes the country a lot better (61%, 23% a little better), moderates are divided between those who say it makes the country a lot (28%) or a little better (28%). A third of moderate Democrats say diversity makes no difference (33%, 13% liberals).\n\nModerates More Likely Than Liberals to Favor Conditions for a Path to Citizenship\n\nMuch of the controversy over immigration today centers around the 11 million unauthorized immigrants who live in the United States without legal status. Asked specifically about undocumented immigrants living in the United Sates, majorities of Democrats support a path to citizenship for undocumented workers (87% liberal, 77% moderate Democrats) and very few say that those living and working in the United States should be forced to leave the country (4% liberal, 9% moderate).\n\nBut there are some slight differences within the party faithful: two-thirds of liberal Democrats (65%) support a path to citizenship without any conditions, compared to just half of moderate Democrats (51%).\n\nThese differences are even sharper when asked about undocumented workers without mentioning whether they are currently working or not. In this case, majorities of Democrats across the ideological spectrum continue to support a path to citizenship (88% liberal, 70% moderate). But while a majority of liberal Democrats (58%) support an unconditional path, only a minority of moderate Democrats (38%) say the same. And 22 percent of moderate Democrats—compared to 8 percent of liberals—say these immigrants should be deported.\n\nDemocrats Prefer to Keep Legal Immigration Levels Stable\n\nSome immigration experts contend that the United States needs to significantly increase immigration each year to expand the future workforce and its competitive advantage. Overall, half of Democrats support keeping legal immigration at present levels, while a third prefer it be increased (35%) and 16 percent prefer a decrease. Similar to the percentage for overall Democrats, half of both liberal (46%) and moderate (52%) Democrats support maintaining current levels. But liberals are far more likely to endorse increasing legal immigration (44%) over decreasing it (9%), while moderates are slightly more likely to say it should be decreased (27%) than increased (20%).\n\nModerates Much More Selective about Which Immigrants They’d Welcome\n\nOver the past year, migrants have entered the United States from a wider range of countries than in previous years. While Democrats overall are more welcoming to immigrants from a greater range of countries than other partisans, liberal and moderate Democrats do not always agree on whether or not the United States should accept immigrants from certain countries. Majorities from both Democratic camps favor accepting immigrants from Taiwan, Ukraine, Haiti, Central America, India, and South Korea, though liberals are more enthusiastic in their welcome. There are sharper ideological divisions for other potential immigrant-origin nations. While majorities of liberal Democrats also favor accepting immigrants from Sudan, Afghanistan, Russia, and China, moderates are at best divided and often opposed.\n\nConclusion\n\nAs immigration soars at the southern border with a record high of 3.2 million encounters in 2023, so has its significance as an American election issue (though it remains a low priority for Democrats). Biden is attempting to blame Republicans—especially House Republicans— for ducking bipartisan cooperation to start fixing the border crisis. At the same time, some analysts comment that Biden’s shift to the right on immigration could irk some on the progressive wing of his party and dampen his ability to cobble together his winning 2020 coalition.\n\nStrengthening the southern border is an issue that has the potential to divide that coalition. While liberal Democrats tend to say US leaders are paying too much attention to the US-Mexico border (at a 42% plurality), moderate Democrats say US leaders are not paying enough attention to the issue (a plurality of 43%). Prior Council polling shows that moderate Democrats are distinctly more likely than liberals to view increased border security as an effective approach to the issue, while both support a path to citizenship and reject Trump-era family separation policies. Whether those moderate Democrats will give Biden credit for his current positioning absent actual legislative success remains to be seen.",
    "title": "Liberal and Moderate Democrats Differ on Some Immigration Policies | Chicago Council on Global Affairs",
    "date": "2024-03-13T02:00:00.000+02:00",
    "url": "https://globalaffairs.org/research/public-opinion-survey/liberal-and-moderate-democrats-differ-some-immigration-policies",
    "author": "Dina Smeltz; Craig Kafura"
}