{
    "text": "In recent developments, a transcript released by House Republicans unveiled a conversation between former President Donald Trump and then-Vice President Mike Pence prior to the Capitol riot on January 6, 2021. In this conversation, Trump reportedly warned Pence that certifying Joe Biden's victory in the 2020 election could end Pence's political career, characterizing it as a \"career killer.\" The testimony of a White House valet, who was present during the call, illuminated Trump's efforts to pressure Pence amidst the turmoil of the Capitol attack and Trump's apparent indifference to the violence that occurred that day, including the shooting of Ashli Babbitt.\n\nThis transcript, coupled with Trump's public criticism of Pence for lacking the courage to overturn the election results, highlighted the strain in their relationship and the internal conflicts within the administration as the Capitol siege unfolded. Pence, in his memoir \"So Help Me God,\" acknowledged the pressure from Trump but focused on his constitutional duties during the chaos.\n\nIn another matter adding to the internal discord among Republicans, Trump's recent suggestion of a 15-week national abortion ban has sparked unease within the party. With the GOP facing challenges in forming a unified stance on reproductive rights, some Republican senators, including Tommy Tuberville and Chuck Grassley, have shown hesitancy in addressing Trump's abortion comments, reflecting the sensitivity of the issue within the party.\n\nThese events underline the ongoing controversies surrounding Trump and the internal dynamics of the Republican Party in the aftermath of the January 6 riot and amid evolving debates on key issues such as abortion rights.",
    "title": "Transcript reveals Trump warned Pence over election certification before Capitol riot - Noah",
    "date": "2024-03-22T00:09:00.000+02:00",
    "url": "http://noah-news.com/gb/en/politics/2024/03/21/transcript-reveals-trump-warned-pence-over-election-certification-before-capitol-riot",
    "author": "K ai L ai ney"
}