{
    "text": "As House Republicans struggled to maintain any remaining momentum they might have had in their impeachment inquiry into President Joe Biden during another committee hearing Wednesday, even hosts on Fox News and Newsmax seemed to be losing patience with it.\n\nPrior to the hearing, House Oversight Committee member Rep. Jim Jordan (R-OH) appeared on Newmax’s Wake Up America where host Rob Finnerty compared the committee's actions to a dog chasing its own tail.\n\nAfter noting that House Republicans have their slimmest majority yet of the current Congress, Finnerty told Jordan that unless some Democrats cross the aisle, an impeachment vote is going to be “real tough.”\n\n“It kind of seems like you’re chasing your tail at this point, because this is not going to go anywhere,” he said.\n\n“Fair question,” Jordan replied. “You know, we’ve got a small majority. Everybody understands that—not just on this issue but on a host of issues. Our job, under the Constitution, is to do oversight of the executive branch. We’re doing that. We’re going to continue to do that.”\n\nJordan didn’t indicate that his committee’s work would be wrapping up anytime soon, saying, “There’s no time limit in the Constitution on how long you can do an investigation.”\n\n“We don’t have a timeline,” he added. “There’s no specific outcome we’re trying to get to.”\n\nFinnerty responded by stressing that the time frame is, in fact, key, “because if Joe Biden gets re-elected on Nov. 5, it’s all for naught.”\n\nYet Jordan wouldn’t commit to a vote. “Again, we’ll have to see where the conference is.”\n\nIn the next hour on Fox News, anchor Dana Perino was similarly skeptical.\n\n“At the end of this week, Congress is set to go into recess for another two weeks, and I do think that in some ways it just feels like they keep doing the same hearing over and over again,” she said. “And people are starting to wonder: At some point, do you fish or cut bait, and do something about a vote or not, and move on to the general election?”\n\nWednesday’s hearing included testimony from Lev Parnas, a former associate of Rudy Giuliani, who said Republicans’ impeachment push is “predicated on a bunch of false information that is being spread by the Kremlin.”\n\n“Eventually you’ve brainwashed yourself [in]to believing certain things that are not true,” Parnas said of his work with the longtime Trump ally ahead of the 2020 election. “I started thinking [to] myself that this can’t be true. And we were doing something wrong.”\n\nLast month, one of the GOP’s key impeachment witnesses—who said he has ties to Russian intelligence assets—was arrested by the FBI for allegedly lying to the bureau about Biden and his son, Hunter. Oversight Committee Chairman James Comer (R-KY) then tried to claim—despite his past comments—that Alexander Smirnov actually “wasn’t an important part” of his investigation.\n\nDuring a break in Wednesday’s hearing, committee member Rep. Byron Donalds (R-FL) was pressed about next steps on both Newsmax and Fox. On the former, reporter Kilmeny Duchardt asked him what the committee needs in order to “fill in these holes,” considering how “a lot of this evidence is situational [and] circumstantial.”\n\nA few hours later, Fox anchor John Roberts told Donalds that “the needle hasn’t appreciably moved on this case” in some time, and followed up by asking how long the investigation can continue without “evidence of wrongdoing on the president’s part.”\n\nAlso on Fox, the network’s legal editor, Kerri Urbahn, seemed to sum up the day: “I do think that people are maybe becoming a little bit tired of all of this.”",
    "title": "Fox, Newsmax Losing Patience With GOP’s Biden Hearings",
    "date": "2024-03-21T03:14:00.000+02:00",
    "url": "https://www.thedailybeast.com/fox-newsmax-losing-patience-with-gops-biden-hearings",
    "author": "William Vaillancourt"
}