{
    "text": "The United Steelworkers union endorsed President Joe Biden for the 2024 election, racking up another union endorsement for the presumptive Democratic nominee.\n\nThe union, which represents an estimated 850,000 workers across multiple industries, said Biden had a “track record of supporting working people” in their announcement of the endorsement on Wednesday.\n\n“President Biden proved time and again during his first term that he stands with working families,” USW International President David McCall said in a statement. “His vision and leadership allowed our nation to strengthen workers’ access to collective bargaining, grow the middle class, and embark on a path to widespread prosperity.”\n\nOur union proudly endorses @POTUS Joe Biden for the 2024 presidential election. With his track record of supporting working people, we're eager for his administration's continued progress on our core issues. #USW #Steelworkers #1u #Biden2024 pic.twitter.com/WwJyT68DAz — United Steelworkers #EverybodysUnion (@steelworkers) March 20, 2024\n\nAmong the factors behind the latest endorsement was Biden’s opposition to the planned sale of U.S. Steel, the nation’s second largest steel manufacturer, to a Japanese company, Nippon Steel. “It is vital for it to remain an American steel company that is domestically owned and operated,” the president said in a statement last week. The union had previously endorsed Biden in 2020.\n\nBiden has already received endorsements from several other major U.S. labor unions, including AFL-CIO, United Auto Workers, and the American Federation of Teachers.\n\n“Joe Biden bet on the American worker, while Donald Trump blamed the American worker,” UAW President Shawn Fain said during his speech in January announcing the union’s endorsement of Biden. After losing the UAW endorsement, Donald Trump aired his grievances against Fain on Truth Social. Trending Trump Is Now Fundraising Off His Inability to Pay Fraud Bond Sex Jokes, Massage Requests, and Humiliation: A Timeline of Nickelodeon’s Dark History Meet the Lady Carnivores Taking Over TikTok With Butter and Raw Meat A ChatGPT for Music Is Here. Inside Suno, the Startup Changing Everything\n\nIn a statement, Biden campaign manager Julie Chavez Rodriguez said the president was honored to receive the USW’s endorsement, one that was also sought after by Trump.\n\n“The president knows that with their support comes the responsibility to fight like hell every single day for USW and workers everywhere — as he’s done his entire career,” Rodriguez said.",
    "title": "United Steelworkers Throws Support Behind Biden",
    "date": "2024-03-21T03:27:00.000+02:00",
    "url": "https://www.rollingstone.com/politics/politics-news/united-steelworkers-endorses-biden-1234991730",
    "author": "Jeremy Childs"
}