{
    "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nPresident Biden raked in another $21 million in donations in February, extending his cash lead over former President Trump and the Republican National Committee.\n\nCombined with the Democratic National Committee, Biden has a war chest of $97.5 million, of which over $70 million belongs to the campaign. Trump and the RNC have less than half that at $44.8 million, according to Politico.\n\nThe Biden campaign plans to use its deep pockets to flood Trump with ads in swing states across the country, much as Trump attempted to do to Biden in 2020.\n\nThis year's data is a stark inversion of the last election cycle, where Trump entered March 2020 with an overwhelming financial advantage over the Biden campaign. That year, Trump and the RNC boasted a war chest of $225 million, while Biden and the DNC had a paltry $20 million, according to the New York Times.\n\nLOCKING IT UP: TRUMP CLINCHES 2024 REPUBLICAN PRESIDENTIAL NOMINATION DURING TUESDAY'S PRIMARIES\n\nTrump nearly matched Biden's fundraising in February, bringing in just over $20 million.\n\nNEW POLL REVEALS AMERICANS TRUST DONALD TRUMP OVER BIDEN TO LEAD THE US AS PRESIDENT\n\n\"Americans know that they were better off with President Trump four years ago than with Crooked Joe Biden and his disastrous policies,\" Trump campaign communications director Steven Cheung told Fox News Digital on Wednesday. \"We need a return to America First policies that successfully kept our country safe and supercharged the economy for all Americans.\"\n\nTrump officially became the presumptive Republican presidential nominee earlier this month after victories in Georgia, Mississippi and Washington state primaries. Biden also secured his party's nomination earlier this month.\n\nBIDEN VS. TRUMP IS FORCING AMERICANS TO CONFRONT THE AGE ISSUE. BUT NO ONE WILL ANSWER ONE BIG QUESTION\n\nThe November contest between Biden and Trump is the first rematch in a White House race since 1956, when Republican President Dwight D. Eisenhower defeated Democratic former Illinois Gov. Adlai Stevenson when they faced off a second time.\n\nThe latest Fox News Poll from earlier this month had Trump leading Biden in a head-to-head match up.\n\nCLICK HERE TO GET THE FOX NEWS APP",
    "title": "Biden rakes in $21 million as cash lead over Trump continues to grow | Fox News",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.foxnews.com/politics/biden-rakes-21-million-cash-lead-trump-continues-grow",
    "author": "Anders Hagstrom"
}