{
    "text": "CNN —\n\nThe Biden administration on Wednesday finalized one of the most significant pieces of its ambitious climate agenda: the strongest new tailpipe rules for passenger cars and trucks that will decisively push the US auto market toward electric vehicles and hybrids.\n\nBut in a concession to automakers and labor unions, the rules will be phased in more slowly than originally proposed and will give automakers more choices for how to comply.\n\nNearly a year ago, the Environmental Protection Agency proposed a fast ramp-up into EVs — a rule that would have ensured two-thirds of all vehicles sold were electric by the end of this decade. The EPA pumped the brakes on that plan Wednesday.\n\nInstead of pushing automakers to sell more EVs to meet stringent pollution targets, the administration is allowing plug-in hybrids — vehicles that combine gas engines and EV-like batteries — to play a much bigger role in the electric transition.\n\nIn 2023, EVs made up just 7.6% of new car sales, according to Kelley Blue Book. The new rule is targeting 35% to 56% for EVs in 2032, and 13% to 36% for plug-in hybrids.\n\nTransportation has an outsized climate impact, making up nearly a third of all US climate pollution, so even small steps can lead to significant change. Margo Oge, who previously headed the agency’s office of Transportation and Air Quality, called the new standard “the single most important climate regulation in the history of the country.”\n\nIn a statement Wednesday, President Joe Biden vowed the cars would be made by American workers. “US workers will lead the world on autos making clean cars and trucks, each stamped ‘Made in America,’” Biden said. “You have my word.”\n\nFederal officials said the rule doesn’t favor electric vehicles over other types of vehicles, and will reduce nearly as much pollution as the original proposal — more than 7 billion metric tons of planet-warming emissions, along with other pollution that is detrimental to human health. By 2032, the new rule is expected to slash passenger car pollution nearly in half from 2026 levels.\n\n“Within those ranges, we got to the same place” as the standard proposed last year, said Joe Goffman, who leads the agency’s Office of Air and Radiation.\n\nGoffman said the agency considered different ways automakers could “mix and match” new vehicle models to meet the standard — by using more efficient gasoline engines, hybrids, plug-in hybrids and battery electric vehicles.\n\n“By taking seriously the concerns of workers and communities, the EPA has created a more feasible emissions rule that protects workers building (traditional, gas-powered) vehicles, while providing a path forward for automakers to implement the full range of automotive technologies to reduce emissions,” the United Auto Workers union said in a statement.\n\nWhite House national climate adviser Ali Zaidi said that “one of the really strong features” of the new rule was its flexibility.\n\n“Different automakers are going to approach this in different ways,” Zaidi said. “You’ll have some automakers that maybe have a third of their fleet be plug-in hybrid electric vehicles.” Zaidi argued that would “translate into a lot of consumer choice.”\n\nCarmakers get flexibility\n\nAutomakers like Toyota, who are favoring hybrids and plug-in hybrids and moving slowly on EVs, could be big benefactors of EPA’s new rule.\n\nToyota, the world’s largest automaker, is among the companies that aggressively pushed back against the Biden administration’s original proposal.\n\nIn a memo sent in the fall of 2023 to car dealers across the US, Toyota Motor North America group vice president of government affairs Stephen Ciccone described the EPA’s original EV proposal as a “mandate” and “draconian,” CNN recently reported. Ciccone wrote the proposal had caused an “existential crisis” in the industry and suggested an option giving automakers more choice.\n\n“Toyota’s position is that the best way to reduce carbon is by giving consumers a choice of powertrain options, including hybrids, plug-in hybrids, fuel cells, fuel efficient ICE vehicles, and BEVs,” Ciccone wrote.\n\nThat flexibility is what the EPA finalized on Wednesday. But Toyota continued to characterize EPA’s rule as a “regulatory mandate” that will force it further into the EV game than it’s currently positioned.\n\nThe rule “requires a precipitous shift from around 8% market share of battery electric vehicles today to more than half by 2032 – an aggressive, sixfold increase over just eight years,” said Toyota spokesperson Edward Lewis in a statement. “Toyota will continue to lead the industry and comply with regulations, but serious challenges around affordability, charging infrastructure, and supply chain will need to be addressed before this mandate is realized.”\n\nPresident Joe Biden has made the transition to EVs a signature issue of his presidency, stressing the economic impacts, in addition to the climate benefits, of cutting pollution. In August 2021, after the president announced an ambitious target that half of vehicles sold in the country by 2030 would be either battery electric, fuel-cell electric or plug-in hybrid, Biden test-drove a hybrid-electric Jeep on the White House grounds.\n\nBut political battle lines are being drawn around the EV transition. Former President Donald Trump, the Republican nominee for the 2024 presidential election, has railed against EVs in his speeches. He recently characterized EVs as “all” being made in China, even though Democrats’ Inflation Reduction Act has pushed a new EV manufacturing and assembly to the United States.\n\nWith the new standard giving automakers more flexibility, EPA administrator Michael Regan denounced the characterization that the agency was setting an EV “mandate.”\n\n“When you look at the differences between the proposal and final, you will see that there is absolutely no mandate,” Regan told reporters, adding his agency was staying “well within the confines of the law.”\n\nIt’s not just Trump; the jump to EVs has some of Biden’s political allies worried, too. The United Auto Workers, a powerful union that has endorsed Biden, has also expressed concerns about what the shift to EVs could mean for their workers, who believe battery-powered cars require less labor to build.\n\nBut the demand for fully electric cars is growing in the US. The nation crossed a key threshold at the end of last year: 1.2 million electric vehicles were sold — a 46.3% jump from 2022.\n\nEV adoption rates are likely to slow down this year, which is to be expected, said Trevor Houser, partner at the nonpartisan Rhodium Group. He’s looking for two main signs of EV success in the coming years: whether automakers can make a wide enough variety of the vehicles Americans want to drive, and whether the cost can come down to a more affordable range of $20,000 to $30,000.\n\n“We won’t really know before (2025) how successfully we’re making that transition because the next generation of more affordable EVs won’t be on the market,” Houser told CNN.\n\nZaidi agreed it would take time to see whether more Americans move to fully electric cars.\n\n“That’s something we’ll see over time,” Zaidi said. “But this rule is very flexible and allows for all of those pathways to emerge, and for (automakers) to pursue those in a manner that’s consistent with their strategies.”\n\nClimate and health impacts\n\nWhile the climate impact of the tailpipe rules have drawn the most attention, there is a big public-health component, as well.\n\nReducing pollution from cars and trucks could help Americans’ health on multiple levels, since the EPA’s multi-pollutant standards will tackle greenhouse gases that cause climate change, smog and particle emissions.\n\nNo amount of air pollution is safe, and according to the World Health Organization, it’s one of the greatest environmental risks to human health.\n\nVehicle exhaust is made up of all sorts of pollutants, including carbon monoxide, particulate matter, nitrogen oxides, sulfur dioxide and carbon emissions that contribute to a warming world, which is also itself a major threat to health.\n\nExposure to particle pollution ages and reduces lung function, and it can lead to cancer, stroke, heart problems, COPD and other lung and vascular issues. It can aggravate asthma and is linked to neurodegenerative diseases like Alzheimer’s, Parkinson’s and other types of dementia, studies have found. People exposed to higher amounts of this pollution for longer periods also have an increased risk of depression and anxiety. Exposure can even contribute to problems thinking clearly.\n\nParticle pollution led to more than 107,000 premature deaths in the US in just one year, one 2019 study found. That’s more than the number of people killed each year in homicides and traffic accidents combined, researchers said.\n\n“These standards really provide significant relief that communities across America need from vehicle exhaust,” said Will Barrett, the American Lung Association’s senior director of advocacy for clean air. “It’s very much setting a strong direction to ensuring the auto industry cleans up harmful pollutants and communities are better protected from traffic emissions.”\n\nThis story has been updated with additional information.\n\nCNN’s Angela Dewan contributed to this report.\n\nCorrection: A previous version of this story misstated what kind of vehicle Biden tested on White House grounds. It was a hybrid-electric Jeep.",
    "title": "Biden administration rolls out new tailpipe rules that will boost EVs and hybrids",
    "date": "2024-03-20T15:21:00.000+02:00",
    "url": "https://www.cnn.com/2024/03/20/climate/epa-biden-electric-cars/index.html",
    "author": "Ella Nilsen,Jen Christensen"
}