{
    "text": "Lawmakers in the Vermont House are poised to vote Wednesday on one of the biggest energy bills of the legislative session. Among other things, it would make every electric utility in Vermont purchase 100% of its power from renewable resources by 2035.\n\nIt would also require that a lot more of that power come from new renewable energy sources built in Vermont and New England.\n\nCost estimates for the proposal have varied widely. Here’s a breakdown of what we know so far.\n\nWhat does the bill do?\n\nUnder current state regulations, Vermont utilities have to get 75% of the power in their portfolios from renewables by 2032. Of that, about 10% has to come from renewables built within Vermont.\n\nThis bill, H.289, would require the biggest utilities in the state — like Green Mountain Power — to get to 100% renewable electricity by 2030. Vermont’s smaller, town-owned utilities would have until 2035.\n\nFor electric utilities that are already at 100% renewable — like Washington Electric Coop and Burlington Electric Department — they will have to ensure that as their loads grow from customers switching to electric vehicles and installing heat pumps, that extra power is coming from renewables.\n\nThe bill also proposes to double the amount of power utilities have to buy from renewables built recently in Vermont. Additionally, it creates a brand new requirement that they purchase power from new renewables built in New England, which could include offshore wind in the future.\n\nMore from Vermont Public: Vermont just adopted a Climate Action Plan. Here's how it says we should reduce emissions.\n\nOn paper, Vermont has one of the least carbon-intensive electricity sectors of any state in the U.S. However, because we’re part of the interconnected New England grid, and that grid is mostly powered by natural gas at any point in time, we still consume fossil fuels.\n\nBuilding new renewables in places where there is grid capacity and storage for them is one way to decrease the amount of fossil fuels New England burns as a region, and burning fossil fuels is the cause of global climate change.\n\nOne of the core debates playing out in the Statehouse is over how much Vermont should do to reduce the region’s — and our own — dependence on fossil fuels in the electric sector.\n\nWhat would this bill mean for electric rates in the state?\n\nThe short answer is: What’s proposed in the bill would raise electric rates. However, at this point, there is no granular modeling that shows exactly how much.\n\nWhat really has the potential to drive cost in the policy are the new renewables, particularly ones built in Vermont.\n\nLegislative analysts put out a memo this week that breaks the cost of this bill into two buckets.\n\nFirst, there’s the cost of buying the new renewable energy. The cost of renewables is coming down, but building new stuff always carries an upfront cost.\n\nThe Joint Fiscal Office estimates that it will cost between $150 million and $250 million by 2035 to comply with this new policy.\n\nMore from Brave Little State: How much does Vermont's power grid depend on fossil fuels?\n\nThen, there’s what it might cost to upgrade our grid — the poles and wires and substations themselves — to make room for this new renewable power. There’s more uncertainty there, but the analysts say they expect it could be about between $0 and $200 million by 2035.\n\nAnd that figure doesn’t include upgrades to the distribution systems that utilities own — the more granular parts of the grid. There are major swaths of the state where that is constrained as well.\n\nFor context, the Department of Public Service projects Vermonters will spend $14.5 billion on electricity between 2025 and 2035.\n\nAt the end of the day, experts on all sides say these numbers are helpful, but it’s still hard to know at this point what this policy change would mean for electric bills in the future.\n\nWhat do we not know about how much this will cost?\n\nLong story short: a lot. And a big part of that is that we don’t really know what it will cost to upgrade our grid to be ready for these new in-state renewables.\n\nRight now, there are places where Vermont doesn’t have the grid capacity for any more new renewables, and upgrades are expensive.\n\nBut VELCO — the grid operator — says there are some investors who are interested in building transmission lines that would go between Quebec and future offshore wind, potentially through the very burdened parts of Vermont’s grid.\n\nVELCO says these projects — if they are successful — could help a lot to alleviate the cost to ratepayers of building out more transmission.\n\nHowever, transmission projects do fall through, as happened recently with the Twin States Clean Energy Link project. Transmission can be difficult to build in New England, so there’s uncertainty there.\n\nThe Scott administration put out its own cost estimate earlier this year — at twice what legislative analysts landed on, at roughly $1 billion over the next decade. The estimate relied heavily on modeling by VELCO that looks at investments needed to ensure grid reliability. VELCO clarified those figures were not meant to forecast the cost of power — nor were they tailored to the policy proposal put forward by the legislature.\n\nThe administration has since agreed the new numbers from legislative analysts — $150 million to $450 million — are reasonable, but still view the estimate for transmission costs as being a bit low.\n\nRenewable developers contend that the cost estimate from legislative analysts should be viewed as a high-end forecast for cost, because it doesn’t consider the volatility of natural gas prices in shaping electricity rates, though Vermont utilities tend to buy most of their power through long-term contracts that insulate them somewhat.\n\nAnd VELCO says even if Vermont does nothing to update its Renewable Energy Standard, our aging grid is going to need hundreds of millions of dollars in upgrades to be ready for the future.\n\nAre there ways to keep that cost down?\n\nYes. Some environmental groups are saying Vermont needs a parallel policy that forces those new renewables to be built in the places where there is grid capacity for them — and load demand for them.\n\nThis would allow the state to maximize its existing infrastructure, potentially forestalling pricey upgrades.\n\nThe state doesn’t require that right now, which is part of how we got to this situation of imbalance —where parts of the grid are at risk of being overburdened.\n\nThe Scott administration has advocated for only requiring as many new in-state renewables as we have capacity for with existing infrastructure. Renewable developers and most environmental groups contend this bill does just that.\n\nAdditionally, the Joint Fiscal Office says utilities could play a role in mitigating costs by building out storage and creating more programs to spread out electricity use over the course of the day, like incentivizing people to charge their electric vehicles at night, for example.\n\nWhy do lawmakers feel this is necessary right now? What do people say about whether we should do this?\n\nVermont’s Climate Action Plan and Comprehensive Energy Plan both call on the state to go to 100% carbon-free electricity.\n\nEven though there’s been disagreement between lawmakers and the Scott administration over how to get there, both bodies support that transition.\n\nAn earlier proposal from the Scott administration had proposed requiring every utility in the state reach 100% clean energy, which would include nuclear power, by 2030, with lower requirements for purchasing new renewables.\n\nThe administration argues the emissions benefit from that approach, for Vermont, would be greater sooner than what is proposed now — though TJ Poor, director of utilities planning for the Department of Public Service, acknowledged in an interview that the societal emissions benefit of H.289 is greater because it requires utilities to support more new renewables.\n\nH.289, the bill heading to the House floor, has broad support from utilities in the state and from renewable developers, as well as several environmental groups, including VPIRG.\n\nHowever, some conservative lawmakers and the environmental group Vermonters for a Clean Environment — which has often opposed new renewable energy development in the state over concerns about land use — say Vermont’s power is clean enough as it is.\n\nAnd they point out that utilities and renewable developers, who broadly support the bill, stand to benefit financially from it — especially from this requirement for new renewables within Vermont.\n\nTo date, no one has modeled how much the bill would reduce greenhouse gas emissions in Vermont, or in the region.\n\nAnnette Smith of Vermonters for a Clean Environment says she has concerns about whether the bill asks Vermonters to pay for environmental benefits people in other states will enjoy.\n\nHowever, she supports elements of the policy — including eliminating group net metering and efforts to stand up a community solar program in the state.\n\n“But the rest of this — changing the requirements for in-state [renewables] and for totals by certain years? We’re not ready for it,” she says.\n\nMore from Vermont Public: New report explores how sourcing 100% of Vermont's electricity from renewables would affect rates\n\nOthers say Vermont needs to do everything it can to fight climate change right now, and cleaner electricity is part of that.\n\nRep. Laura Sibilia is an Independent from Dover who sits on the House Energy and Environment Committee, and says lawmakers are also deeply concerned about affordability. She called the earlier, more speculative forecast from the Scott administration “political.”\n\n“The energy transition is not optional,” she said in early March. “How we act in it — we have a lot of options. But it’s happening. Vermonters themselves are driving that transition, global markets are driving that transition.”\n\nTJ Poor, director of utility planning for the Department of Public Service, says his department would like to see the cost of distribution system upgrades included in the analysis.\n\n“I think the focus is that there are costs. They are significant. And there are ways to mitigate the potential risk of those costs,” he says. “And I hope that this legislation … as it goes forward, that that can be an improvement.”\n\nBen Edgerly-Walsh, with VPIRG — which has lobbied in support of the bill — says the numbers say otherwise.\n\n“I think that what the Joint Fiscal Office has confirmed is that this is an affordable way of deploying a whole lot of new renewable energy,” he says. “That’s what we’ve testified to all along and when they dove deeper into the substance of the bill, that’s exactly what they found as well.”\n\nVermont is part of the U.S Climate Alliance, a group of 25 states that have agreed to keep complying with the Paris Accords, even if our federal government pulls out, which we did under former President Donald Trump — though President Joe Biden has since rejoined. As the presidential election approaches, there are many who make the case that there is power in individual states taking action on climate change.\n\nHave questions, comments or tips? Send us a message.",
    "title": "Bill to take Vermont to 100% renewable electricity heads to the House floor | Connecticut Public",
    "date": "2024-03-20T00:57:00.000+02:00",
    "url": "https://www.ctpublic.org/2024-03-19/bill-to-take-vermont-to-100-renewable-electricity-heads-to-the-house-floor",
    "author": "Abagael Giles"
}