{
    "text": "In a rare, massively bipartisan vote on Tuesday, the House of Representatives passed a resolution condemning Russia’s illegal abduction of thousands of children from Ukraine, and holding Russian President Vladimir Putin responsible. The final tally was 390-9. All nine “no” votes were by Republicans.\n\nSponsored by Pennsylvania Democratic Rep. Susan Wild, HR 149, “Condemning the illegal abduction of children from Ukraine to the Russian Federation,” had been introduced in February of 2023 and made its way to the House Committee on Foreign Affairs, where it sat for nearly nine months before being passed unanimously and sent to the full House for a vote. It is symbolic and does not order any funds or any actions.\n\nThe resolution gives a timeline of Russia’s actions, including stating that “Russian Forces attacked a maternity hospital in Mariupol, Ukraine, resulting in the deaths of 3 individuals and injuries to 17 other individuals,” in March of 2022.\n\nREAD MORE: McConnell Rips Johnson Again Over Ukraine\n\nAlso in that month, it notes, “the Ukrainian Foreign Ministry announced that the Russian military had forcefully and illegally kidnapped 2,389 Ukrainian children from temporarily occupied areas of Ukraine.” It adds that “on June 2, 2022, Ukrainian President Volodymyr Zelenskyy stated that 200,000 children are among the Ukrainians who have been forcefully resettled in Russia,” and states that “forcibly transferring children of one group to another group is a violation of Article II(e) of the Genocide Convention,” of which Russia is a signatory.\n\nThe resolution states that “Maria Lvova-Belova, Children’s Rights Commissioner for the President of Russia, admitted to kidnapping Ukrainian children and facilitating forced adoptions to Russian families.”\n\nHorrifically, it adds, “on June 22, 2022, the United Nations Human Rights Office of the High Commissioner has verified at that at least 320 children have been killed since Russia’s renewed invasion began,” and, “on June 16, 2022, Russian authorities announced that children born in occupied Ukrainian territories after the February 24, 2022, invasion will be deemed Russian citizens.”\n\nThe resolution then states that the U.S. House of Representatives “holds the Government of the Russian Federation, under the leadership of Vladimir Putin, responsible for the wrongful and illegal kidnapping of children from Ukraine and officially condemns these actions in the strongest terms.”\n\nREAD MORE: Ramaswamy Eyed for Homeland Security Head if Trump Re-Elected: Report\n\nIt also states the House “claims that the Russian Federation is attempting to wipe out a generation of Ukrainian children, thereby crippling Ukraine’s ability to nurture the next generation of Ukrainian citizens and leaders and to rebuild their country after Russia’s unprovoked war, with the purpose of demolishing Ukraine’s unique language, culture, history, and identity.”\n\nThe nine House Republicans who voted no are:\n\nAndy Biggs (AZ), Eric Burlison (MO), Warren Davidson (OH), Marjorie Taylor Greene (GA), Clay Higgins (LA), Thomas Massie (KY), Matt Rosendale (MT), Chip Roy (TX) and Tom Tiffany (WI).\n\n(Links in bold above lead to NCRM’s coverage of those specific lawmakers.)\n\nAll but two, Greene and Massie, are believed to be members of the far-right House Freedom Caucus. Congresswoman Greene was reportedly kicked out last year. All nine have received a grade of “F” from Republicans for Ukraine.\n\nREAD MORE: ‘Easy Mark’: Why Trump’s $464M Bond Failure Makes Him a ‘Massive National Security Risk’",
    "title": "Meet the Republicans Who Voted Against Condemning Putin’s Illegal Abduction of Children",
    "date": "2024-03-20T15:54:00.000+02:00",
    "url": "https://www.thenewcivilrightsmovement.com/2024/03/meet-the-republicans-who-voted-against-condemning-putins-illegal-abduction-of-children",
    "author": "David Badash"
}