{
    "text": "WASHINGTON — Congress released the final six government funding bills early Thursday, starting off a sprint toward the Friday midnight deadline to wrap up work that was supposed to be finished nearly six months ago.\n\nThe bipartisan agreement on the $1.2 trillion spending package, which emerged just before 3 a.m., came less than two weeks after the U.S. House and Senate approved the other six annual appropriations bills.\n\nThis package includes the spending measures for some of the most crucial functions of the federal government — the departments of Defense, Education, Health and Human Services, Homeland Security, Labor, State and Treasury.\n\n\n\nThe bill would also fund Congress, the Executive Office of the President, the judiciary and the Social Security Administration.\n\nThe 1,012-page spending package provides money for hundreds of programs, including many that lawmakers will tout on the campaign trail heading toward the November elections. Included:\n\nU.S. troops and civilian Defense Department employees will receive a 5.2% pay raise retroactive to Jan. 1, 2024.\n\nThe Federal Bureau of Investigation’s new headquarters project — which has not only divided Democrats and Republicans, but the congressional delegations from Virginia and Maryland — will receive $200 million for construction on the Greenbelt, Maryland, site via the General Services Administration.\n\nStates will get $55 million in new Election Security Grant funding.\n\nCustoms and Border Protection as well as Immigrations and Customs Enforcement will get more than $4 billion in funding increases.\n\nChild care and early learning programs at the Department of Health and Human Services will receive a $1 billion increase in funding. The boost will go toward the Child Care and Development Block Grant, which provides grants to state, territorial and tribal agencies, and Head Start, which provides funding to local grantees.\n\nThe U.S. Capitol Police will receive a 7.8% funding increase.\n\nAfghans who assisted the United States during the war would be eligible for an additional 12,000 Special Immigrant Visas.\n\nThe United Nations Relief and Works Agency, or UNRWA, the primary aid organization in Gaza, would be stripped of U.S. funding after Israel accused agency employees of taking part in Oct. 7 attacks.\n\nWeekend work possible\n\nSenate Majority Leader Chuck Schumer said Thursday morning the package clears “another hurdle towards our ultimate goal of funding the federal government.”\n\n“This funding agreement between the White House and Congressional leaders is good news that comes in the nick of time: When passed it will extinguish any more shutdown threats for the rest of the fiscal year, it will avoid the scythe of budget sequestration and it will keep the government open without cuts or poison pill riders,” he said. “It’s now the job of the House Republican leadership to move this package ASAP.”\n\nAfter the House votes to approve the package, likely Friday, Schumer said, “the Senate will need bipartisan cooperation to pass it before Friday’s deadline and avoid a shutdown.”\n\nSenate Minority Leader Mitch McConnell, a Kentucky Republican, said Wednesday during a press conference he expected senators would be in session this weekend to take final votes on the package.\n\n“My assumptions and what I’ve told our members is we’re likely to be here this weekend. That will be determined, however, by how long it stays in the House,” McConnell said.\n\n“And when it’s over here, what we have recently done — and I think hopefully will work again — is that in return for a certain number of amendments, we can finish it quicker, hopefully, than putting us in the position of shutting down the government,” McConnell added.\n\nSpeaker Mike Johnson, a Louisiana Republican, said in a written statement the package would claw back $20.2 billion from the Internal Revenue Service funding that Democrats included in their signature climate change and tax package and $6 billion in unused COVID-19 funds.\n\nOn immigration, the funding package “cuts funding to NGOs that incentivize illegal immigration and increases detention capacity and the number of Border Patrol Agents to match levels in the House-passed appropriations bill and the Secure the Border Act (H.R. 2),” he said, referring to non-governmental organizations.\n\nThe package also includes funding for the nation’s defense. “This FY24 appropriations legislation is a serious commitment to strengthening our national defense by moving the Pentagon toward a focus on its core mission while expanding support for our brave men and women who serve in uniform,” Johnson said. “Importantly, it halts funding for the United Nations agency which employed terrorists who participated in the October 7 attacks against Israel.”\n\nMore than $1B to reduce child care costs\n\nSenate Appropriations Chair Patty Murray, a Washington state Democrat, said in a written statement that she was “proud to have secured $1 billion more to lower families’ child care costs and help them find pre-K — a critical investment to help tackle the child care crisis that is holding families and our economy back.”\n\n“From day one of this process, I said there would be no extreme, far-right riders to restrict women’s reproductive freedoms — and there aren’t,” Murray said. “Democrats stood firm to protect a woman’s right to choose in these negotiations and focused on delivering investments that matter to working people.”\n\nDemocratic lawmakers, Murray said, “defeated outlandish cuts that would have been a gut punch for American families and our economy — and we fought off scores of extreme policies that would have restricted Americans’ fundamental freedoms, hurt consumers while giving giant corporations an unfair advantage, and turned back the clock on historic climate action.”\n\nThe House and Senate must debate and approve the measure in less than two days under the stopgap funding agreement, otherwise a weekend funding lapse would begin. If it went on beyond the brief period of the weekend, a partial government shutdown would begin.\n\nThe House can easily hold a vote within that timeline, but the Senate will need to reach agreement among all 100 of its members in order to avoid casting votes past that benchmark.\n\nHere’s a look at where Congress increased funding and where it cut spending on these six government funding bills for fiscal year 2024, which began back on Oct. 1.\n\nDefense\n\nCongress plans to spend $824.5 billion on the Defense spending bill, which predominantly funds the Pentagon, Army, Navy, Air Force, Marine Corps, the Central Intelligence Agency and the Office of the Director of National Intelligence.\n\nThat bill includes funding for a 5.2% pay raise for military and civilian defense employees that will be retroactive to Jan. 1, 2024. The basic allowance for housing will increase by 5.4% and the basic allowance for sustenance will increase by 1.7%.\n\nThat total spending level would be divvied up among several core programs, including $176.2 billion for military personnel, an increase of $3.5 billion; $287.2 billion for operations and maintenance, $9.1 billion above current levels; $172 billion for procurement of military equipment, $9.8 billion more than the enacted level; and $148.3 billion for research and development, an $8.6 billion increase, according to a House GOP summary and a summary from House Democrats.\n\nThe Israeli Cooperative Missile Defense Programs would get $300 million for research and testing as well as $200 million for procurement, including for the Iron Dome and David’s Sling. An additional $300 million would go toward the Ukraine Security Assistance Initiative.\n\nSenate Defense Appropriations Subcommittee Chair Jon Tester, a Montana Democrat, said in a statement the bill “will invest in our ability to stay ahead of the threat of China, defend our country from foreign adversaries while standing firm with America’s allies, and take care of our servicemembers and their families.”\n\nThe joint explanatory statement that accompanies the bill calls on the Department of Defense to look into why the military is having difficulty recruiting.\n\n“The Military Services are in the midst of one of the greatest recruiting crises since the creation of the all-volunteer force,” it says. “Since retention of enlisted servicemembers remains strong, those who continue to serve will promote to more senior grades, leaving a distressing shortfall in junior enlisted servicemembers, who account for 40 percent of the total active U.S. military force. The Nation needs America’s youth to strongly consider uniformed service.”\n\nThe package calls on the Defense Department to “conduct an independent survey to better understand the failure of recruitment efforts by the services,” according to House Republicans’ summary of the bill.\n\nThe secretary of Defense must also brief the Defense Appropriations subcommittees on a proposal to increase the pay for junior enlisted troops.\n\nFinancial Services and General Government\n\nThe Financial Services and General Government bill — which funds the U.S. Treasury Department, Executive Office of the President, judiciary and more than two dozen smaller programs — would receive $26.1 billion in funding. That’s about $1.1 billion below the current funding levels for those programs.\n\nSenate FSGG Appropriations Subcommittee Chair Chris Van Hollen, a Maryland Democrat, said in a written statement the “bipartisan legislation invests in these critical priorities for our nation and more — including providing key resources to tackle the opioid epidemic and the necessary funding to build the new FBI headquarters in Greenbelt, Maryland.”\n\n“Building an economy that works for everyday Americans requires supporting our small businesses and community-based lenders, protecting consumers, building out our broadband infrastructure, and ensuring the security of our financial system,” Van Hollen said.\n\nThe Department of Treasury would receive $14.2 billion, a $22.9 million reduction to its current funding levels. Of that total funding level, $12.3 billion would go to the Internal Revenue Service, equal to its current funding, and $158 million would go toward the Alcohol and Tobacco Tax and Trade Bureau, according to a bill summary from House Democrats.\n\nThe Judiciary would get more than $8.6 billion to operate the U.S. courts, including the District Courts, Courts of Appeals and other judicial services. That funding level is an increase of nearly $170 million.\n\nIt provides $129 million for salaries and expenses of the U.S. Supreme Court and $20 million to care for the building and its grounds, according to the joint explanatory statement.\n\nThe bill includes $791 million in funding for the District of Columbia, a decrease of $1 million. That includes $40 million in residential tuition support, $30 million in emergency and security costs, $8 million in upgrades to sewer and water treatment and $4 million in HIV/AIDS testing and treatment, according to a bill summary from House Democrats.\n\nThe Executive Office of the President would receive about $872.5 million — a $6 million decrease from the 2023 fiscal level, according to a bill summary from Democrats.\n\nThat includes $114 million for the Office of Administration, $19 million for the National Security Council, $22 million for the Office of National Cyber Director and $457 million for the National Drug Control Policy.\n\nThe bill would provide the U.S. Consumer Product Safety Commission with about $151 million in funding, a decrease of $1.5 million. The bill bars CPSC from issuing a ban on gas stoves, “which would reduce consumer choice,” according to a House GOP bill summary.\n\nThat policy provision would prohibit CPSC from “promulgating, implementing, administering, or enforcing any regulation to ban gas stoves as a class of products,” according to the explanatory statement.\n\nCPSC has not made any regulatory action to ban gas stoves. Agency officials have expressed concern about indoor air quality of gas stoves and the agency is researching the impacts on human health of those indoor gas emissions.\n\nThe Election Assistance Commission would receive a cut of $280,000 in funding for a total level of $27.7 million.\n\nA total of $55 million from that allocation would go toward Election Security Grants “to make payments to states for activities to improve the administration of elections for Federal office, including to enhance election technology and make election security improvements,” according to the explanatory statement.\n\nHomeland Security\n\nCongress plans to spend $62 billion on the Department of Homeland Security, including upgrading technology to screen for narcotics like fentanyl at U.S. ports of entry and an additional $495 million in funding to hire 22,000 border patrol agents.\n\nThe bill provides U.S. Customs and Border Protection with $19 billion, a $3 billion increase above current levels, and more than $9.6 billion to Immigration and Customs Enforcement, or ICE, an increase of $1.1 billion.\n\nIt puts in place policy requirements for detention centers, such as barring contracts with private companies that do not meet inspection standards, and providing an additional $3 million to expand the use of ICE body cameras, according to the explanatory statement.\n\nThe legislation would require the Department of Homeland Security to publish data on the 15th of every month on the total detention capacity and the number of “got aways” and people “turned back” at the southern border, according to the joint explanatory statement.\n\nDHS refers to people as “got aways” when an individual is observed making an unauthorized entry into the U.S. and is not turned away, or apprehended. That data is not publicly available.\n\nThe Office of the Secretary and Executive Management would get $404 million, an increase of about $20 million. About $30 million of that funding would go “to support the safe reunification of families who were unjustly separated at the U.S.-Mexico border by the Trump Administration,” according to House Democrats’ summary of the bill.\n\nThe bill provides $5.1 billion for Enforcement and Removal Operations, an increase of $900 million above current funding. Of that, $355 million would go toward 41,500 detention beds.\n\nThe bill would appropriate $11.8 billion for the U.S. Coast Guard, a $122.7 million boost; $10.6 billion for the Transportation Security Administration, an increase of $1.2 billion; and $25.3 billion for the Federal Emergency Management Agency, a funding cut of $72.9 million.\n\nThe FEMA funding would go toward several projects, with $20 billion of those funds for disaster relief.\n\nLabor-HHS-Education\n\nThe bill would appropriate $13.7 billion for the Labor Department, $145 million less than current funding levels and $79 billion for the Education Department, a cut of $500 million, according to the House GOP summary.\n\nThe Health and Human Services Department would get $116.8 billion, or about $3.9 billion less than the $120.7 billion provided during the last fiscal year. The House Democrats’ summary of the bill, however, says that when earmarks are factored into the total spending level, HHS would get a $955 million increase.\n\nSenate Labor-HHS-Education Subcommittee Chair Tammy Baldwin, a Wisconsin Democrat, said in a written statement the bill “helps take on the fentanyl and opioid crisis, expand access to affordable child care, invest in critical mental health and affordable health care programs, and connect Americans with the education and workforce training they need to land good-paying jobs.”\n\nFunding for HHS would go to numerous health programs, including a $300 million increase to the National Institutes of Health for a total spending level of $48.6 billion.\n\nThe Centers for Disease Control and Prevention would get $9.2 billion, more than $4.5 million above its current funding level.\n\nTitle X family planning grants would get $286 million in funding, the same amount they currently receive, despite House Republicans proposing to completely eliminate the program.\n\nThe Administration for Strategic Preparedness and Response, a central component of the nation’s response to the COVID-19 pandemic and the mpox outbreak, would get $3.6 billion, a $5 million increase.\n\nOf that total spending level, $1 billion would go toward the Biomedical Advanced Research and Development Authority and $980 million would go to the Strategic National Stockpile. That represents an increase of $65 million and $15 million, respectively.\n\nThe bill includes a $1 billion increase in funding for child care and early learning programs within HHS, according to Senate Democrats’ summary of the legislation.\n\nThe Child Care and Development Block Grant would see a $725 million, 9%, increase in funding compared to current levels, for a total appropriation of $8.8 billion. Another $12.27 billion would go toward Head Start programs, a boost of $275 million over the current level.\n\n“Sustained annual increases to our federal investments in child care and Head Start are critical in tackling the child care crisis and helping to ensure more families can find and afford the quality, affordable child care and early childhood education options they need,” Senate Democrats’ summary says. “With the new investments provided in this bill, annual discretionary funding for CCDBG and Head Start over the last three fiscal years has increased by $4.4 billion.”\n\nThe Education Department’s spending would go to numerous initiatives, including $24.6 billion for student financial aid programs.\n\nPell Grants, which go to about 7 million lower-income college students, would continue to have a maximum award of $7,395 during the 2024-2025 academic year. The Federal Work Study program for college students would also get equal funding at $1.2 billion.\n\nThe Labor-HHS-Education bill continues to include the so-called Hyde Amendment, which prohibits federal funding from being used for abortions with exceptions for rape, incest, or the life of the pregnant person.\n\nThe decades-old provision, first added in the 1970s in a slightly different form, affects patients in federal health care programs like Medicaid and Medicare.\n\nSimilar provisions on abortion access exist throughout many of the other government funding bills.\n\nLegislative Branch\n\nThe Legislative Branch Appropriations bill includes $6.75 billion for operations in the Capitol, including funding related to the summer’s party conventions and the presidential inauguration in January 2025.\n\nThe bill would boost funding for the U.S. Capitol Police to $792 million, a 7.8% increase from fiscal 2023.\n\nThe measure includes funding for retention and recruitment programs of Capitol Police officers, including student loan payments and tuition reimbursements. Capitol Police officers, the force responsible for security at the Capitol complex, reported lower morale in the aftermath of the Jan. 6, 2021, attack on the U.S. Capitol.\n\n“This is an essential investment in democracy and oversight that bolsters the legislative branch’s capacity to better serve the public,” said Sen. Jack Reed, a Rhode Island Democrat who chairs the Legislative Branch Appropriations Subcommittee. “This bill delivers the funding and infrastructure required for the U.S. Capitol Police to safeguard the Capitol complex and keep it accessible to the public.”\n\nA joint explanatory statement accompanying the bill says the measure would allow $2 million for Capitol Police to protect members of Congress outside the Capitol complex but within the Washington, D.C., region. Members have experienced increased threats in recent years.\n\nThe measure also includes funding for quadrennial events related to the presidential election.\n\nCapitol Police would receive $3.2 million for overtime to support the national political conventions — Republicans’ in Milwaukee and Democrats’ in Chicago — over the summer and to prepare for the inauguration in January.\n\nInauguration Day is in the next fiscal year, which begins in October, but expenses associated with preparing for it could be incurred this year. The bill would allocate nearly $3.7 million for salaries and expenses associated with the inauguration.\n\nThe bill would provide $16.6 million for Capitol grounds, House and Senate offices and the Capitol Power Plant.\n\nThe measure includes a provision that would claw back unspent funds from members’ Representational Allowances, the accounts that reimburse senators and representatives for official expenses. Unspent funds from those accounts would be used to pay down the national debt.\n\nThe measure includes a longstanding policy freezing members’ pay.\n\nState-Foreign Operations\n\nCongress plans to allocate just over $58.3 billion for the Department of State, U.S. Agency for International Development and other related programs, including refugee emergency assistance and diplomatic activities.\n\nRepublican lawmakers are touting an overall cut to the bill — down from last year’s $59.7 billion total.\n\nThe bill includes $11.8 billion for the U.S. State Department and USAID and $10.3 billion for international development, including a loan to the International Monetary Fund to provide economic relief for some of the world’s poorest nations.\n\nThe bill allocates $10 billion for global health initiatives that focus on combating HIV/AIDS, malaria and tuberculosis, as well as providing vaccination programs for children.\n\nOf that health funding, Democrats cheered that the bill “protects longstanding funding,” as highlighted by Murray’s office, for family planning and reproductive health services in poor nations around the globe, for which nearly $524 million is allocated, remaining at the same level as the current spending level.\n\nFunding appropriated to the president for multilateral assistance to international organizations and programs — ranging from the United Nations Intergovernmental Panel on Climate Change to programs for victims of torture — is set to drop to $436.9 million from last year’s funding level of $508.6 million.\n\nThat reduction, in part, reflects current political tension over the Israel-Hamas war.\n\nAbsent from the bill are funds to the United Nations Relief and Works Agency, or UNRWA, a primary humanitarian organization in the Palestinian Gaza Strip and West bank territories. Many Western nations cut UNRWA funding after Israel accused 13 of its employees of taking part in the Oct. 7 attacks and many more of sympathizing with Hamas and other militant groups. The agency received $75 million from the U.S. in fiscal year 2023.\n\nAnother notable absence from the bill is funding for the UN High Commissioner on Human Rights, which received $17.5 million from the U.S. in last year’s funding bill.\n\nRepublicans celebrated the elimination of funding for the agency’s inquiry into human rights abuses in Palestinian territories, which the UN Human Rights Council opened after a flare up of violence in May 2021. The inquiry began to collect evidence of war crimes “committed by all sides” shortly after Hamas attacked southern Israel on Oct. 7, killing some 1,200 and taking roughly 240 hostages.\n\nThe bill will meet the annual U.S. $3.3 billion commitment to Israel this year among the $8.9 billion in security assistance to foreign governments.\n\nThe funding roadmap for U.S. international activities extends several programs, notably authorizing an additional 12,000 Special Immigrant Visas for Afghans who assisted the U.S. during its war in Afghanistan.\n\n",
    "title": "Massive $1.2 trillion spending package that would avert a shutdown released by Congress • Colorado Newsline - The Cherry Creek News",
    "date": "2024-03-22T02:00:00.000+02:00",
    "url": "https://www.thecherrycreeknews.com/massive-1-2-trillion-spending-package-that-would-avert-a-shutdown-released-by-congress-colorado-newsline",
    "author": "Kathy Lingo"
}