{
    "text": "Private Residence\n\nHouston, Texas\n\n1:40 P.M. CDT\n\nTHE PRESIDENT: Whoa. Holy mackerel. (Applause.) I’m — folks, I never thought I’d be down in this garage with a better scene than all those vehicles, but you are. (Laughter.)\n\nAnd please sit down, if you have a seat.\n\nWell, John Eddie and Sheridan, thank you for hosting me again and again and again and again. Your friendship is real, and it means a lot to me. It means a lot to Jill.\n\nAnd thanks to all of you for your support, including all of the lawyers here today who care deeply about the rule of law, and — (applause) — and you’re are on the frontlines of fairness, justice, and defending democracy.\n\nYou know, if I — the first time I met down here, if I talked about, “we have to defend democracy,” you all looked at me like I was — had too much to drink upstairs. (Laughter.)\n\nAnd, folks, we’re seeing incredible enthusiasm all over the country. I’ve traveled since we’ve gotten the — since we announced formally in — to Pennsylvania, Michigan, Georgia, Wisconsin, New Hampshire, Nevada, Arizona. And Jill and Kamala and Doug are traveling as well.\n\nOur grassroots support keeps getting stronger. So far, we have 1,300,000 people who have contributed to our campaign — 1,300,000 — (applause) — and 500,000 of them brand-new — and 97 percent are people who contributed under $200. It’s a real grassroots thing. (Applause.)\n\nWe’re ramping up our campaign headquarters and field offices, opening nearly 100 offices in the last several weeks — or actually mo- — a little — about a month and a half — and hiring staff all across the country before Trump and his MAGA Republicans have even — even opened one headquarters.\n\nAnd while we probably haven’t read a lot about it, in the last few days, there has been five national polls. The press — well, I like the press — (laughter) — but they don’t talk about it very much. Five national polls having us leading since my State of the Union Address. (Applause.)\n\nFolks — folks, but I know not everyone is feeling the enthusiasm. The other day, a defeated man — looking man came up to me and said, “Mr. President, I’m being crushed by debt. I’m completely wiped out.” And I had to say, “I’m sorry, Donald, but I can’t help you.” (Laughter and applause.) I can’t do it. I’d like to. Not much I can do. (Laughter.)\n\nSpeaking of Donald Trump, just a few days ago, he asked the famous question: Are you better off today than you were yesterday? Well, Donald, I’m glad you asked that question. (Laughter.)\n\nI hope everyone in the country takes a moment to think back where they were in March of 2020.\n\nCOVID had come to America, and Trump was president, and hospitals and emergency rooms were overwhelmed. First responders were risking their lives. Nurses were literally wearing garbage bags for protection in hospitals, and ventilators were in short supply. Mobile morgues were set up. Loved ones were dying all alone, and we couldn’t even say goodbye to them.\n\nAnd unemployment shot up to 14 percent. The stock market crashed, and your grocery store shelves were empty. And the toilet paper panic — remember that one? (Laughter.)\n\nWell, Trump tried to downplay the virus. He told us, “Don’t worry. It’ll go away. Just stay calm. We’ll be out of this by Easter.” All while doing simply nothing.\n\nOf course, we know from Bob Woodward’s book that Trump was lying to the American people and he knew it all along. He knew how dangerous the virus was, but he hid it from us.\n\nHe just kept — it kept getting worse. He told Americans — remember when he said inject bleach? (Laughter.) I think he must have done it. (Laughter.) He told us to hit the body with UV light, which I’m confident he does. (Laughter.)\n\nBut, look, by the summer, Americans peacefully protested for justice in front of the White House, and what did he want? He wanted to tear gas them and — for a photo op.\n\nAnd after losing the 2020 election, char- — he finished his presidency by literally sending a mob to attack the Capitol.\n\nFour years later, we’ve come a — pretty far. Donald Trump is not president, that’s a starter. I am, because of you. (Applause.)\n\nI look out, I see so many of you who got me through in 2020. You — many of you have been with me a long time.\n\nCOVID is — no longer controls our lives. We’ve created 15 million brand-new jobs, more jobs than any president has in (inaudible). (Applause.)\n\nWe have the lowest unemployment rate — lowest unemployment rate in over 50 years. (Applause.)\n\nWe have a record economic growth, record small-business creation. Stock market is highest it’s ever been. I know that doesn’t matter to you all, but it’s real. (Laughter.)\n\nInsulin for seniors now costs 35 bucks instead of 400 a month. Out-of-pocket costs for prescription drugs for seniors are going to be capped at the end of this month [year] at $2,000 a year no matter what the cost is, including those cancer drugs that are $10-, $12-, $15,000.\n\n\n\nThat doesn’t just save — (applause) — and, by the way, that just doesn’t seniors money; it saves significant amounts of money for the — and reduces the deficit.\n\nWhat we’ve done so far by dealing with Medicare being able to negotiate, which I’ve been trying to do when I was a senator for years — we finally got it done, without much help from the other team — actually, without any help from the other team. (Laughter.) We’re — but guess what? It cut the federal deficit by $160 billion — $160 billon. (Applause.)\n\nWe’re rebuilding the nation’s roads, bridges; delivering clean water, high-speed Internet to every American.\n\nAmerican manufacturing is booming. I never knew where it was written — it says we can’t still lead the world in manufacturing. Eight hundred thousand new jobs since we — you got me elected the first time and still counting. (Applause.)\n\nWe’ve attracted $650 billion in private-sector investment for clean energy, advanced manufacturing, semiconductors — all across America.\n\nWe made the biggest investment in history to combat climate. And we do more, of course — we have to do more.\n\nInflation peaked at 9 percent, but now it’s down — dropped to 3 percent, the lowest in the world, and it’s still going down. And with the grace of God, the goodwill of the neighbors, and the crick not rising, as my grandfather would say, it’s going to continue to go down.\n\nBut we can more to do.\n\nLet me ask you: Does anyone want to go back to 2020?\n\nAUDIENCE: No!\n\nTHE PRESIDENT: Well — when — when fear ruled our lives when Trump was President? I don’t think so.\n\nBut, look — look, folks, the problem isn’t looking back to where the country — where Trump had the country. The problem is where he wants to take it now. Look at what he’s saying, and he means what he’s saying.\n\nI don’t — you know, I made a speech when I — you got me nominated and I was first elected be- — while I was running in 2020 — at — at Independence Hall, saying our democracy was at risk. And a lot of the press thought it was a bit of hyperbole, but I don’t think anybody thinks that anymore.\n\nHe wants to get rid of — this guy wants to do a whole lot that is contrary to what we’ve been done — what’s been done. He says he wants to get rid of the Affordable Care Act. Forty million Americans depend on that ACA.\n\nHe wants to get rid of savings I just got put into law to lower prescription drug prices, to 35 bucks for insulin for seniors.\n\nHe wants to enact another $2 thousand [$2 trillion] tax cut — they’re not bad, if you can pay for it — the very wealthy and the biggest corporations. It’s increased the debt larger than any president has in a four-year period.\n\nAnd, folks, if anyone doubts Trump and the Republicans would cut Social Security and Medicare, just look at what they said and done in the past week.\n\n\n\nTrump recently said about Social Security and Medicare, which is a lifeline for millions and millions of Americans — he said, “There’s” — quote, “There’s a lot we can do in terms of cutting.”\n\nAnd just yesterday, 180 House Republicans in the House of Representatives took orders from him again, and they proposed to cut Social Security and Medicare and ch- — and up the age.\n\nYou know, I’ve got a better idea. I’ll protect Social Security and Medicare.\n\nLook, folks, he also — he’s also a climate denier. He wants to do away with historic actions on climate we’ve had.\n\nAfter another school shooting about a month ago, what did he say? Remember the famous quote? He said, “We just got to get over it.” “Just got to get over it.”\n\nWell, I just want to stop it.\n\nIt’s the same guy who, when he was talking about what happened in Normandy, he said — and they wanted to go to the gravesites, he said no. He said they’re a bunch of “losers” — a bunch of “losers.” My son was one of those “losers.” I’m glad I wasn’t standing with him. Not at Normandy, but in —\n\nLook at the judges he put on the bench. Imagine who else he’ll put on the bench if he gets reelected.\n\nOur reputation internationally was being crushed when he was president. Imagine what happens if he gets reelected. He wants to walk away from NATO. He tells Putin: Do, quote, “whatever the hell you want.”\n\nHe hosts Prime Minister Orbán of Hungary at Mar-a-Lago, and says he doesn’t think democracies work — at Mar-a-Lago.\n\nTrump brags about how he’s the reason Roe v. Wade was overturned and the freedom to choose was taken away. America needs to know Donald Trump and his MAGA extremists are now calling for a national ban in every state in the Union — every state in the Union.\n\nOne more thing. Trump didn’t just bring chaos into our –lives of women. He’s also bringing chaos in Am- — at the Amer- — at the American border. You know this, in Texas, better than anybody.\n\nYou know, with a group of bipartisan senators, led by a very conservative senator from Oklahoma, we negotiated for weeks and agreed on the strongest national security, border security law in American history: 1,500 more border security agents and officers; 100 more immigration judges to help tackle the backlog of 2 million cases; 4,300 more asylum officers and new policies so they can resolve all these cases in six months instead of six years, because it takes six to eight years now to resolve these cases — it’s chaos; 100 more high-tech drug detection machines that significantly increase the ability to screen and stop vehicles from smuggling fentanyl into America.\n\nBut Trump was worried — and this is the truth. Trump was worried — and it got bipartisan support. It looked like it was going to go through the Senate. And Trump got on the phone and started calling and — the senators. And he said, “You can’t be for it. You can’t be for it,” even though they liked it and it was strong, and he liked it. Because he couldn’t stand the thought that we’d get credit for something.\n\n\n\nFolks, this wasn’t about whether it was good for me or Trump. This is about what’s good for America.\n\nAnd here’s what I’ll do, unlike Donald Trump: I’m not going to demonize immigrants. I’m not going to say immigrants are “poisoning the blood” of the nation. I’m not going to call immigrants and folks from Mexico “rapists” and “murderers” just because they’re from Mexico. I’m not going to separate families.\n\n\n\nAnd I’m gon- — I’m not going to end — the thing that bothers me most — I met a — a young man yesterday with his mom and dad, who were immigrants, and he’s a very good student. He was born in America. Trump wants to do away with birthright citizenship — a fundamental decision made by our founders: If you’re born in America, you’re an American no matter what. He wants to do away with that — to do away with that.\n\n\n\nI find it to be outrageous. You know, I’m not going to ban people either because of their religion. That’s not who we are in America.\n\nBut for all the threats Trump poses to our economy, our standing in the world, is — the greatest threat he poses: to our democracy. The violence on January 6th — Trump embraced it, and he’s running on it.\n\nIf you watch any of his rallies, he’s — calls the insurrectionists in pri- — who are in prison — calls them “patriots.” And he says if he’s reelected, he’s going to pardon them all.\n\n\n\nTrump now says if he loses again in November that there will be a “bloodbath.” A “bloodbath.”\n\nFolks, we can’t stand for all this. We have to say with one voice as Americans — as Democrats, as independents, as Republicans — there’s no place in American politics for political violence ever. Period. Period. (Applause.)\n\nLet me close with this. The stakes couldn’t be higher, but with your help, we’ll win up and down the ticket. That includes here in Texa- — I’d love to see Colin take on Cruz — (applause) — so Ted can join loser Donald Trump. (Laughter and applause.)\n\nLook, there’s a lot of focus these days on how old I am and how old Trump is. Well, the real question is: How old are our ideas?\n\nTrump’s vision for America is one of anger, hate, revenge — seriously — and retribution — some of the oldest ideas known to humankind.\n\nI have a very different view for America, one that focuses on our future and answers whether — some very important questions: Will we be better off four years from now?\n\nWell, here’s what I see.\n\nI see a future where we defend democracy; we don’t diminish it.\n\nI see a future where we restore the right to choose and protect the freedoms that they’re tak- — been taking away.\n\nI see a future where the middle class finally has a fair shot and the wealthy begin to pay their fair share — and many of you do.\n\nI see a future where we save the planet from climate crisis and our country from gun violence.\n\nAbove all, I see a future for all Americans, you know, where we demonize no one, where we — hate has no safe harbor, where we leave nobody behind.\n\nThat’s the future that we build together. That’s the reason — that’s the reason I’ve never been more optimistic — I really believe it — as I go around the country. Our country is ready.\n\n\n\nLook, this is really a race about values between Trump and me, between us and Trump — a value set. Because I really do believe the American people are decent, honorable. They — they respect dignity.\n\n\n\nMy dad used to have an expression. My dad was a well-read man, and he got into Johns Hopkins when he was in Baltimore. He got into Johns Hopkins when we was — during the war — just before the war, but he ended up working in the shipyards and didn’t get to go.\n\n\n\nAnd here’s what he — he used to say, “Joey, a job is about a lot more than a paycheck. It’s about your dignity. It’s about respect. It’s about being able to look your kid in the eye and say, ‘Honey, it’s going to be okay.’ It’s about just having an even chance. Not being given it — just an even chance.”\n\n\n\nWell, we have to remember who in the hell we are. We’re the United States of America. And there is nothing — nothing, nothing beyond our capacity if — when we act together.\n\n\n\nAnd that’s what we’re doing here today. We’re going to continue to do it. And with the grace of God and the goodwill of all of you, we’re going to be able to do it.\n\nMay God bless you all. And may God protect our troops. Thank you. (Applause.)\n\n1:56 P.M. CDT",
    "title": "Remarks by President Biden at a Campaign Reception | Houston, TX",
    "date": "2024-03-22T10:29:00.000+02:00",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/03/21/remarks-by-president-biden-at-a-campaign-reception-houston-tx",
    "author": "The White House"
}