{
    "text": "The Israeli PM has insisted that the operation to eliminate Hamas must go forward, regardless of US opposition\n\nIsraeli Prime Minister Benjamin Netanyahu has refused to call off a major ground offensive against Hamas militants at the southern tip of the Gaza Strip, shrugging off a US warning that the operation will kill more civilians and worsen a humanitarian crisis in the Palestinian enclave.\n\n“We have a disagreement with the Americans about the need to enter Rafah,” Netanyahu told Israeli lawmakers on Tuesday, one day after US President Joe Biden urged him to cancel plans for storming Rafah. He added, “We do not see a way to eliminate Hamas militarily without destroying these remaining battalions. We are determined to do it.”\n\nThe White House warned on Monday – after Biden’s 45-minute telephone call with Netanyahu – that a major ground operation in Rafah “would be a mistake.” Summing up the call, US National Security Advisor Jake Sullivan told reporters, “It would lead to more innocent civilian deaths, worsen the already dire humanitarian crisis, deepen the anarchy in Gaza and further isolate Israel internationally.”\n\nBiden had previously insisted that Israel provide a credible plan for preventing civilian casualties in Rafah before launching its offensive, but with rising political fallout over Palestinian civilian casualties, he has taken a tougher stance against Netanyahu. The US president expressed support on Friday for US Senate Minority Leader Chuck Schumer after the lawmaker gave a speech arguing that Netanyahu had “lost his way” and become an obstacle to peace in the region.\n\nThe war erupted when Hamas launched surprise raids against southern Israeli villages on October 7, killing more than 1,100 people and taking hundreds of hostages back to Gaza. Since then, more than 31,000 people have been killed in the besieged Palestinian enclave, according to local authorities, and around 1.5 million starving Gazans have been crammed into Rafah after Israeli bombardments leveled their neighborhoods.\n\nThe Israel Defense Forces (IDF) announced last week that displaced civilians will be moved to “humanitarian islands” north of Rafah before the ground offensive begins. Those refugees will provide temporary shelter, food and water, IDF spokesman Daniel Hagari said. Netanyahu approved the IDF’s Rafah plan on Friday.\n\nHowever, US Secretary of State Antony Blinken said Washington still has not seen a “clear and implementable plan” to safeguard civilians in Rafah. He warned on Tuesday that 100% of Gaza’s residents are suffering “severe levels of acute food insecurity. That’s the first time an entire population has been so classified.”\n\nNetanyahu has claimed that Israeli forces destroyed 18 of the 24 Hamas battalions in Gaza, and four of the surviving units are concentrated in Rafah. He told Israeli legislators that he reiterated to Biden the necessity of crushing those units. “I made it clear to the president in our conversation, in the clearest way, that we are determined to complete the elimination of these battalions in Rafah. There is no way to do it, except by going in on the ground.”\n\n—\n\nOnline:\n\nRussia Today news agency contributed to this report, published by ORDO News editors.\n\nContact us: [email protected]\n\nOur Standards, Terms of Use: Standard Terms And Conditions.\n\nTo eliminate any confusion arising from different time zones and daylight saving changes, all times displayed on our platforms are in Coordinated Universal Time (UTC).",
    "title": "Netanyahu defies Biden on Rafah offensive | ORDO News",
    "date": "2024-03-20T03:18:00.000+02:00",
    "url": "https://ordonews.com/netanyahu-defies-biden-on-rafah-offensive",
    "author": "@ordonews"
}