{
    "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account – free of charge. Please enter a valid email address.\n\nMore than 100 Democratic Party and Biden donors recently signed a letter to the president warning him that if he doesn’t change his Israel policy, he may lose re-election to former President Trump.\n\nThe New York Times reported on Tuesday that this letter includes signatures from several donors who have given “six figure sums to Mr. Biden’s presidential campaigns in 2020 and 2024, though a preponderance of donors who signed the letter have given smaller amounts to candidates and causes more progressive than Mr. Biden.”\n\nAmong these donors are David and Elizabeth Steinglass – who gave around $1.4 million to various party candidates and initiatives, environmentalist Caroline Gable – who has given $51,000 to Biden’s 2024 campaign as well as $315,000 to the party this year, and George Krupp, who “gave $1.2 million to Democrats in 2020 and has donated more than $600,000 to them during the 2024 election cycle,” The Times stated.\n\nSCHUMER TRASHED FOR ‘DISGUSTING’ SPEECH CALLING ON ISRAEL TO DUMP NETANYAHU: ‘OUTRAGEOUSLY INAPPROPRIATE’\n\nThe Times also noted that Sen. Elizabeth Warren’s 2020 presidential campaign finance co-chair Paul Egerman was among the major signatories of the letter.\n\nTheir letter blasted the current president for supporting Israel’s war effort in Gaza and the country’s Prime Minister Benjamin Netanyahu.\n\nIt stated, “Regrettably President Biden has provided what appears to be unconditional support for the Israeli operation,” it reads. “The Biden administration has been providing armaments, including 2,000-pound bombs which have been used to flatten entire civilian neighborhoods, causing massive casualties with a high ratio of women and children.”\n\nBiden has been somewhat critical of Israel’s methods of waging war in Gaza in recent weeks, even expressing hope that Israel would arrange a ceasefire soon.\n\nThe letter acknowledged Biden’s perspective but pointed out that it hasn’t changed much at all. “President Biden has asked Netanyahu to minimize civilian casualties but has threatened no consequences as Netanyahu has continued to ignore him.”\n\nIt went on to grill Biden, arguing that his policy is alienating voters and thereby undermining the hefty contributions that these donors have given to his campaign and the party ahead of 2024.\n\nThe letter continued, “As donors and activists, we have committed much time and treasure in helping increase the turnout of likely Biden voters, particularly among young voters and voters of color.”\n\nSCHUMER’S ANTI-NETANYAHU SPEECH STRENGTHENS BIBI IN ISRAEL’S WAR TO DEFEAT HAMAS\n\n“Many of these voters are now questioning whether the Democratic Party shares their values,” it said, adding, “If they stay home or vote for a third-party candidate, there is the very real danger that President Biden will be defeated in November.”\n\nThe letter went on to mention how much of a “disaster” a second Trump administration would be “for our country and a bigger disaster for Israel/Palestine.”\n\n“Because of the disillusionment of a critical portion of the Democratic coalition, the Gaza war is increasing the chances of a Trump victory,” it declared.\n\nThis letter is just the latest written by prominent liberals criticizing Biden’s pro-Israel stance. Last December, dozens of White House interns signed a letter demanding Biden to push for a cease-fire in Israel’s war and slamming him and Vice President Harris for ignoring the “pleas of the American people.”\n\nMore than a dozen Biden campaign staffers sent their boss a letter in January pushing for a cease-fire as well. It stated, “As your staff, we believe it is both a moral and electoral imperative for you to publicly call for a cessation of violence.”",
    "title": "Major Biden, Democratic donors sign letter warning of Trump victory if Biden doesn’t change Israel policy – https://celebspop.site/",
    "date": "2024-03-21T04:00:00.000+02:00",
    "url": "https://celebspop.site/major-biden-democratic-donors-sign-letter-warning-of-trump-victory-if-biden-doesnt-change-israel-policy",
    "author": "Admin"
}