{
    "text": "WASHINGTON — The Biden campaign released a new digital advertisement Friday slamming former President Donald Trump's push to repeal the Affordable Care Act.\n\nThe 30-second ad, first shared with NBC News, features audio of Trump's criticism of the ACA as text on the screen details what a second Trump term would mean for health care.\n\n\"When he was president, Donald Trump tried to rip away our health care,\" the text reads.\n\n\"Obamacare is a disaster,\" Trump says as the text appears.\n\nThe messages are overlaid on an image of a heart monitor, which eventually flatlines.\n\n\"If he succeeds ... 45 million Americans could lose their health insurance,\" the ad's message said. \"And you could be one of them.\"\n\nThe ad, titled \"Flatline,\" is released just one day before the 14th anniversary of the act being signed into law. It will air on platforms, including YouTube and Meta, across battleground states, according to the campaign.\n\n\"It’s not hyperbole to say that affordable health care for millions of people is on the line in November,\" President Joe Biden said in a statement about the ad. \"I am more determined than ever to beat back MAGA Republican attacks and make health care a right and not a privilege in America. I know that we will.”\n\nThe health care act was a signature part of then-President Barack Obama and then-Vice President Joe Biden’s agenda. The legislation required that all states provide marketplaces for health insurance, and millions of people have signed up for coverage through those exchanges since.\n\nTrump had pushed for the ACA to be repealed during his presidency. In 2017, an Obamacare repeal bill narrowly failed when three Republican senators and all Democrats voted against it.\n\nTrump revived his push against the ACA just last year, saying on his social media platform, Truth Social, that he was \"seriously looking at alternatives.\" He later doubled down on those comments, saying that he wanted to \"replace\" Obamacare.\n\nOther Republicans have signaled willingness to partner with Trump on repealing and replacing the landmark law, with Sen. JD Vance, R-Ohio, arguing that \"a lot of the plans of the ACA are really expensive and really low-quality.\" Sen. Ted Cruz, R-Texas, cited similar concerns about affordability, saying, “Lowering premiums is critically important to Texans.”\n\nBut Biden maintains that the plans are affordable.\n\n\"When I ran for president in 2020, I promised the American people that I would protect the Affordable Care Act from partisan attacks and build on it,\" he said in the statement. \"That’s exactly what I’ve done: getting more people affordable health insurance, lowering prescription drug prices, and giving families more breathing room.\"\n\nBiden often touts his administration’s health care policies during speeches, citing the White House’s announcement in October that major drug companies agreed to participate in Medicare drug price negotiations with the government, and the administration’s move to impose a $35 cap on out-of-pocket costs of insulin for seniors who have Medicare.\n\nA record 20 million Americans signed up for health insurance through the ACA this year.\n\nThis article was originally published on NBCNews.com",
    "title": "Biden campaign releases new ad slamming Trump's push to repeal Obamacare",
    "date": "2024-03-22T16:58:00.000+02:00",
    "url": "https://www.yahoo.com/news/biden-campaign-releases-ad-slamming-145808403.html",
    "author": "Megan Lebowitz"
}