{
    "text": "Jan 25, 2023 — Francis's comments, which were hailed by gay rights advocates as a milestone, are the first uttered by a pope about such laws..\n\nNext, let's look at Francis is definitely pope pundit Tim Gordon explain the “weaponized ambiguity” of Vatican II:\n\nThis divergence between the two competing forms of Originalism proves especially relevant in the curious case of the Second Vatican Council (1962–1965), whose sacred constitutions threaten, in many progressive-sounding clauses, to contradict previous Catholic Tradition—which would rupture the Faith. Catholics who believe the Church was not vituperated by the revolutionary intent of Vatican Two’s leading periti became practical textualists in 1965 when the Council’s last constitution was ratified.\n\nAfter all, the strong majority intent at the Council was, undeniably, radically progressive. The story is well-known even to most non-Catholics. Many revolutionary Council fathers authored the VC2 constitutions with what Monsignor Charles Pope calls “weaponized ambiguity,” constitutional text designed to be radicalized retroactively, as theory turned to practice in the immediate post-conciliar period.\n\nWe’ve all watched this catastrophe play out over fifty years. As Edward Schillebeeckx said of his contingent’s tactic: “we knew at the time how we would later interpret the [vaguely written] documents.”\n\nIn other words, the sacred constitutions of VC2 prescribed a poison pill of technically sound doctrine to be subsequently fashioned into unsound, unCatholic praxis. The question for Catholics like Vermeule, Arkes, and myself is: does the “real” meaning of Vatican Two reduce to its documents’ intent, or to their ambiguously revolutionary yet (mostly) innocuous original public meaning? Only textualism can capably explain how regardless of the abiding intent of the Council, the result of the actual constitutional documents need not be harmful.\n\nSacred VC2 constitutions make us think about what a constitution is: a multi-author document expressing the sovereign will of multiple ratifiers at a convention—in this case covenantal agents of the people of God. But a constitution’s meaning is not the vector sum of its authors and ratifiers: its meaning is the binding public signification of its words, as originally ratified. If a constitutional term’s meaning popularly changes a decade after ratification, the ten-year-old meaning of the term remains what was ratified (until formally amended). Ratified meaning is time-stamped and time-sealed.\n\nIt is conceivable—as happened at the Second Vatican Council—that a faction of revolutionary authors and ratifiers could embed their revolution within the vaguest clauses of the constitutions as a killswitch to be flipped at a later date. Since the goal of these revolutionaries was heteropraxy and not heterodoxy, little did they care that the (original, public) meaning of their suggestive byplay remained to posterity orthodox, as long as it was received and practiced as the opposite of orthopraxy.\n\nTheir benighted progeny two generations later wish that they had articulated the revolution clearly rather than reifying a protection for traditionalists: live by innuendo, die by innuendo. Even an author does not govern the public meaning of his immortalized and ratified constitutional text if it militates against his intent.\n\nSince the close of the Council in 1965, excluding those who welcomed the progressive interpretation, Catholics have divided into two interpretive groups.\n\nThe first group, the rupturists, conclude that no continuity exists between the periods before and after VC2. They unknowingly employ the intentionalist jurisprudence, based on the radically progressive intent of the Council’s authorial leftists. Even as they bemoan it, this group runs afoul of the indefectibility of the Catholic Church by announcing the end of a bimillennial doctrinal era and the beginning of a new one. They toil on in dimness and in doubt, believing more or less that the Council constitutions ruptured the One True Faith.\n\nThe second group of Catholics (to which I belong) interpreting VC2 concludes that, notwithstanding ostensible tension presented by the Council constitutions, a textualist “hermeneutic of continuity” can counter-weaponize the original, public meaning of even the most troubling, vaguely-penned clauses of the constitutions. “Look at the original, public meaning of the constitutions’ words,” we say, “not the (bad) intents of many of the authors and ratifiers.”\n\nNon-textualists look at VC2 constitutions like Dignitatem Humanae, Lumen Gentium, and Gaudium et Spes, and dejectedly conclude that Roman Catholic indefectibility has been forever broken.\n\nA textualist view of the hermeneutic of continuity duly recognizes ostensible tensions between pre- and post-conciliar Church teaching, then dissolves or collapses that dichotomy by insisting that change cannot be made by mere innuendo: the original, public meaning of the sacred constitutions prevail.\n\nThe ruling on the football field (i.e., pre-conciliar tradition) stands unless sufficient evidence to overrule the call (i.e., explicit Conciliar text) has been clearly presented. Cases of opacity and uncertainty—such as unclear VC2 “updates”—must be “lined out” like an arguable challenge to a play-call that fails to meet sufficient evidence to overturn the standing call (i.e. tradition). [https://americanmind.org/salvo/catholicism-textualism-and-republicanism/]\n\nIn 2016, Francis's Vatican Archbishop Guido Pozzo who was negotiating with Society of Pius X for Francis agreed with the Traditionalists that the Vatican II ambiguous teaching called Dignitatis Humanae was not defined teaching.\n\n\n\nPozzo said that Dignitatis Humanae \"is not about doctrine or definitive statements, but... pastoral practice.\" (Die Zeit, August 2016, Interview with Archbishop Guido Pozzo)\n\n\n\nDr. Edward Feser gives a brief summary of the history before and after Vatican II of the teaching on this subject and the ambiguity of the document:\n\n\n\n\"That depends. In the Catholic context, the traditional teaching, vigorously and repeatedly upheld by the 19 th century and pre-Vatican II 20 th century popes, is that ideally Church and state ought to cooperate. Contrary to an annoyingly common misunderstanding, these popes were not teaching that non-Catholics ought to be coerced by the state into becoming Catholics. Nor were they teaching that non-Catholics should be forbidden from practicing their own religions in the privacy of their own homes, their own church buildings or synagogues, etc. Rather, the issue was whether, in a country in which the vast majority of citizens were Catholic, non-Catholics ought to be permitted to proselytize and thereby possibly lead Catholics to abandon their faith. It was not denied that there can be circumstances in which such proselytizing might be tolerated for the sake of civil order. The question was whether non-Catholics have a strict right in justice to proselytize even in a majority Catholic society. And the pre-Vatican II popes taught that they did not have such a right, and that in a Catholic country the state could in principle justly restrict such proselytizing (even if there are also cases where the state might not exercise its right to such restriction, if this would do more harm than good).\"\n\n\n\n\n\nDignitatis Humanae , explicitly taught that it was “leav[ing] untouched traditional Catholic doctrine on the moral duty of men and societies toward the true religion and toward the one Church of Christ.” Yet whether the principles set out in Dignitatis Humanae really can be reconciled with the principles set out by the pre-Vatican II popes, how exactly they are to be reconciled if they can be, and which principles are more authoritative and ought to be retained if they cannot be reconciled -- these have all been matters of controversy. They are controversies most Catholics, including conservative Catholics, have avoided. The reason, it seems to me, is that the older teaching is extremely unpopular in modern times, and thus whatever its current doctrinal status, most Catholics are happy to let it remain a dead letter and leave its precise relationship to Dignitatis Humanae unsettled. Yet a question unanswered and ignored is still a real question, and there are scholars who have in different ways attempted to apply to this one a “hermeneutic of continuity,” including \"This was the teaching which Vatican II seemed to reverse, though the relevant document,, explicitly taught that it was “leav[ing] untouched traditional Catholic doctrine on the moral duty of men and societies toward the true religion and toward the one Church of Christ.” Yetthe principles set out inreally can be reconciled with the principles set out by the pre-Vatican II popes,they are to be reconciled if they can be, andprinciples are more authoritative and ought to be retained if they cannot be reconciled -- these have all been matters of controversy. They are controversies most Catholics, including conservative Catholics, have avoided. The reason, it seems to me, is that the older teaching is extremely unpopular in modern times, and thus whatever its current doctrinal status, most Catholics are happy to let it remain a dead letter and leave its precise relationship tounsettled. Yet a question unanswered and ignored is still a real question, and there are scholars who have in different ways attempted to apply to this one a “hermeneutic of continuity,” including Thomas Storck Fr. Brian Harrison , and Thomas Pink .\"\n\n(edwardfeser.blogspot, \"Liberalism and Islam, January 7, 2016) (edwardfeser.blogspot, \"Liberalism and Islam, January 7, 2016)\n\n\n\nOne knows a Vatican II document is a disaster when a defender of Dignitatis Humanae (DR) like Fr. Brian Harrison says:\n\n\n\n\"The effect DR have been much more harmful than beneficial for the Church, the world and most important, the honor due to Christ the King . . . The form in which it presents its truth is so one-sided, so poorly explained, so perilously open to unorthodox interpretation, and so infected with the spirit of liberal humanism, that its promulgation has turned out to be a cause of rejoicing for the Church's worst enemies: freemasonry and all the other forces which seek to promote the ever more total secularization of society, the ever more complete exclusion of Our Lord Jesus Christ from His rightful sovereignty over the public life of nations, and confusion and division within the Church itself.\" http://www.dailycatholic.org/issue/05Dec/dec14agg.htm ]\n\n\n\nChristopher Ferrara stated why Dignitatis Humanae brought about (to quote The Catholic Monitor) the \"[u]pholding Catholic teaching on paper but not in reality has led to widespread corruption... has required a culture of lies... that allowed men like McCarrick to flourish\":\n\n\n\nOne knows a Vatican II document is a disaster when a defender of Dignitatis Humanae (DR) like Fr. Brian Harrison says:\"The effect DR have been much more harmful than beneficial for the Church, the world and most important, the honor due to Christ the King . . . The form in which it presents its truth is so one-sided, so poorly explained, so perilously open to unorthodox interpretation, and so infected with the spirit of liberal humanism, that its promulgation has turned out to be a cause of rejoicing for the Church's worst enemies: freemasonry and all the other forces which seek to promote the ever more total secularization of society, the ever more complete exclusion of Our Lord Jesus Christ from His rightful sovereignty over the public life of nations, and confusion and division within the Church itself.\"Christopher Ferrara stated whybrought about (to quote The Catholic Monitor) the \"[u]pholding Catholic teaching on paper but not in reality has led to widespread corruption... has required a... that allowed men like McCarrick to flourish\":\n\n\"There is no question that the Popes before Vatican II consistently condemned the modern notion of \"religious liberty\"-----i.e., that everyone in society must have the right, both privately and publicly, to practice, preach and otherwise manifest the doctrines of the religion of his choice, even if that religion is filled with error and immorality. That such a \"right\" attacks both public morality and the very foundation of Catholic social order (where it exists) hardly needs to be proved. There cannot, obviously, be any \"right\" as such publicly to deny the Divinity of Christ or to preach in favor of contraception, abortion, divorce[, homosexuality] and other evils. No one has the right to do or to say what is wrong. A right to commit wrong is utter nonsense. Stated negatively, a right not to be prevented by the State from committing wrong is equally nonsensical. The State might for prudential reasons, as St. Thomas observed, tolerate certain public errors and vices, but there is no question of any right to be tolerated in spreading them.\" [http://www.dailycatholic.org/issue/05Dec/dec14agg.htm and https://www.thecatholicmonitor.com/2021/06/vigano-vatican-iis-dignitatis-humanae.html]\n\nFinally, a Francis is definitely pope enabler seemed to be ambiguous, like Vatican II, a few years ago:\n\nIn 2019, the Wanderer's Fr. Brian Harrison issued a attack on the 19 scholar heroes by first presenting a straw man then showing his argument:\n\n\n\n\"Pope Francis has indeed said some things I believe to be heretical... the heretical doctrine of annihilation... [but] Francis is notorious for frequently speaking 'off the cuff'... [was] he/she accurately reported... [but] supposing... [It's] really heretical opinion... Only if he/she remains stubborn and obstinate can the Church declare him/her to be a formal heretic.\"\n\n(The Wanderer, \"Why I didn't Sign the Open Letter Accusing the Pope of Heresy,\" May 3, 2019)\n\n\n\nIt is strange that Harrison says Francis has only \"said\" some things that may be heretical when he knows Francis wrote the Argentine letter that teaches that those committing adultery can receive Communion which was called \"authentic magisterium\" by the Pope's Vatican and placed in the Holy See's Official Acts of the Apostolic See (AAS).\n\n\n\nThis means the unorthodox interpretation of Communion for those committing adultery is the official teaching of Francis.\n\n\n\nHow might Francis and Harrison have known for a long time this teaching is heretical?\n\n\n\nFirst, they just have to read the Ten Commandments. One happens to say that God commands that: \"Thou shall not commit adultery.\"\n\n\n\nBut, just in case they never heard of the Ten Commandments, way back on December 23, 2016, Dubia Cardinal Walter Brandmuller said:\n\n\n\n\"Whoever thinks that persistent adultery and reception of Holy Communion are compatible is a heretic and promotes schism.\"\n\n(LifeSiteNews, \"Dubia Cardinal: Anyone who Opens Communion to Adulterers is a Heretic and Promotes Schism,\" December 23, 2016)\n\n\n\nIn 2017, Francis made it the official teaching of his papacy that those committing adultery can receive Communion by placing the Argentine letter in the Holy See's AAS.\n\n\n\nHe did this despite the fact that in 2016 Cardinal Brandmuller said Communion for adulterers is heretical and in that same year three other cardinals joined him to issue the Dubia against Communion for adulterers as well as other issues.\n\n\n\nIt has now been now many hundreds of days since the Dubia was issued.\n\n\n\nMany people say Francis never answered the Dubia.\n\n\n\nThey are wrong.\n\n\n\nHe answered the Dubia in 2017 when he made the heretical teaching Communion for adulterers his official teaching by placing the Argentine letter in the Holy See's AAS.\n\n\n\nCould he have been anymore \"obstinate\" in heresy than that Fr. Harrison?\n\n\n\nYou, Fr. Harrison, say the Open Letter is \"disrespectful to the Supreme Pontiff.\"\n\n\n\nLike Paul was disrespectful to the first pope, Peter, when he rebuked him.\n\n\n\nLike the disrespectful Catholics of the Middle Ages:\n\n\n\n\"[T]he Sorbonne's Chancellor, Jean Gerson [even] reached the point of threatening [Pope] John XXII with the stake if he didn't make a retraction\" of his heretical teaching on the Beatific Vision.\n\n(Rotate Caeli, \"Popes who fell into Heresy,\" January 28, 2015)\n\n\n\nThey would not be like you Fr. Harrison in thinking it is \"disrespectful\" to call on the world's bishops to admonish Francis.\n\n\n\nDo you believe that Communion for adulterers it is heretical?\n\n\n\nDo you believe that the Ten Commandments are infallible teachings?\n\nIf you do believe then start acting like St. Paul or the Medieval Chancellor Jean Gerson.\n\nPray an Our Father now for reparation for the sins committed because of Francis’s Amoris Laetitia.",
    "title": "Might Pope Leo have started a problematic seemingly poorly defined \"rights\" language that may have helped bring about the ambiguous Vatican II that in part has lead to the current Francis crisis?",
    "date": "2024-03-22T06:25:00.000+02:00",
    "url": "https://www.thecatholicmonitor.com/2024/03/might-pope-leo-have-started-problematic.html",
    "author": "Fred Martinez (noreply@blogger.com)"
}