{
    "text": "The Biden administration approved another round of student debt discharge for more than 78,000 borrowers under the public service loan forgiveness (PSLF) program that impacts teachers, nurses, firefighters, social workers, and other public servants, including the military.\n\nThe discharged amount totals $5.8 billion in student loan debt. The total debt relief under PSLF is now $62.5 billion for 871,000 borrowers since October 2021.\n\nUnder the previous administration, only 2%, or around 7,000 PSLF borrowers, received forgiveness.\n\n“For too long, our nation’s teachers, nurses, social workers, firefighters, and other public servants faced logistical troubles and trap doors when they tried to access the debt relief they were entitled to under the law,” Miguel Cardona, US Secretary of Education, said in a press release. “Today, more than 100 times more borrowers are eligible for PSLF than there were at the beginning of the administration.”\n\nImpacted borrowers will receive an email from the Education Department notifying them of the discharge.\n\nThe White House also announced that an additional 380,000 PSLF borrowers will be notified that they are eligible for discharge within the next two years. The amount of that debt has not been disclosed yet.\n\nRead more: Do I qualify for student loan forgiveness?\n\nPSLF loan discharge for military and other professions\n\nTeachers, nurses, doctors, lawyers, and other professionals who work in public service jobs with federal, state, local, or certain non-profit organizations are eligible to have their remaining loan balances discharged after 10 years of payments through the PSLF program.\n\nPSLF is also available for military service members who don’t qualify for other military loan forgiveness programs.\n\nThe number of PSLF borrowers who received a discharge increased because of a settlement following a lawsuit from the American Federation of Teachers (AFT). The AFT sued the Education Department in 2019 after more than 98% of borrowers who applied for the PSLF program were denied loan forgiveness when Betsy DeVos was US Education Secretary under the Trump administration.\n\nRead more: Student loan issues? Here's how to file a complaint with the Department of Education\n\nIn the past, PSLF borrowers complained about the amount of paperwork, having to mail documents, and the lack of an easy online process.\n\nIn 2022, the Biden administration introduced the PSLF Help Tool, which allows borrowers to complete the entire PSLF application process online. Another improvement for PSLF borrowers is the ability to digitally track the status of their applications in the “My Activity” section of borrowers’ StudentAid.gov account.\n\nTo date, the Biden administration has forgiven $143.6 billion in student loan debt for 3.96 million borrowers.\n\nIn addition to relief given to PSLF borrowers, 959,700 borrowers have received $47.3 billion in discharge through the SAVE income-driven repayment (IDR) plan and the one-time IDR adjustment; 513,000 borrowers with a total and permanent disability received $11.7 billion in debt discharges; and over 1.3 million borrowers who were defrauded by their schools received $22.5 billion in discharges under the borrower defense discharge, according to the Education Department.\n\nRonda is a personal finance senior reporter for Yahoo Finance and attorney with experience in law, insurance, education, and government. Follow her on X @writesronda\n\nClick here for the latest personal finance news to help you with investing, paying off debt, buying a home, retirement, and more\n\nRead the latest financial and business news from Yahoo Finance",
    "title": "Biden administration discharges another $6 billion in student debt for 78,000 public service workers",
    "date": "2024-03-21T11:22:00.000+02:00",
    "url": "https://www.aol.com/biden-administration-discharges-another-6-090102077.html",
    "author": "aol.com"
}