{
    "text": "President Joe Biden told Israeli Prime Minister Benjamin Netanyahu Monday that a major ground offensive in Gaza's Rafah would be a \"mistake,\" as the two leaders spoke for the first time in a month amid growing tensions.\n\nNetanyahu had also agreed to Biden's request to send a delegation of senior Israeli officials to Washington to discuss Israel's Rafah plans and a possible \"alternative approach,\" the White House said.\n\nBut in a sign of the increasingly difficult relationship, Netanyahu said that he had insisted to Biden on achieving all of Israel's war aims against Hamas, the Palestinian militant group behind the October 7 attacks on Israel.\n\nThe pair last spoke on February 15, and Biden has been increasingly vocal in his criticisms of the Palestinian death toll and dire humanitarian situation in Gaza where the UN has warned of famine.\n\nBiden was caught on a hot mic moment recently saying that he would have a \"come to Jesus meeting\" with the Israeli premier as his frustration grew with Netanyahu.\n\n\"The president explained why he is so deeply concerned about the prospect of Israel conducting major military operations in Rafah,\" US National Security Advisor Jake Sullivan told a briefing Monday.\n\n\"A major ground operation there would be a mistake, it would lead to more innocent civilian deaths, worsen the already dire humanitarian crisis, deepen the anarchy in Gaza, and further isolate Israel internationally,\" said Sullivan.\n\nBiden had asked Netanyahu to send a senior team of military, intelligence and aid officials to Washington to \"hear US concerns\" about the current Rafah plan -- and discuss an \"alternative approach\" involving targeted raids on Hamas.\n\nNetanyahu agreed to \"have this discussion and this engagement,\" Sullivan said.\n\nSullivan described the call as \"businesslike.\" Explaining why the two leaders had not spoken for 32 days, Sullivan said Biden reserves his calls for Netanyahu for \"when he believes there is a key strategic moment.\"\n\n- 'War objectives' -\n\nBiden has stood by Israel since the October 7 attacks, visiting the country shortly afterwards, and the United States has continued to supply its key ally with billions of dollars in aid.\n\nBut Biden has been increasingly vocal in his criticisms of the Palestinian death toll and dire humanitarian situation in Gaza. Democrats fear growing opposition at home could hurt his chances in November's presidential election.\n\nNetanyahu said in a statement after the call that he had reiterated \"Israel's commitment to achieving all of the war's objectives.\"\n\nThe Israeli premier cited the objectives as eliminating Hamas, release of all the hostages and \"ensuring that Gaza will never present a threat to Israel.\"\n\nHe also pointed to the provision of \"essential humanitarian aid that helps achieve these aims.\"\n\nIsrael began relentless bombardment in Gaza, alongside a ground offensive, after Palestinian militant group Hamas's unprecedented October 7 attack, which left about 1,160 dead in Israel, mostly civilians, according to an AFP tally of official figures.\n\nThe militants also seized hostages, around 130 of whom Israel believes remain in Gaza, including 33 presumed dead.\n\nNearly 32,000 people have been killed in Gaza since the war began, most of them women and children, according to the health ministry in the Hamas-run territory.\n\nAs tensions with Netanyahu escalated, Biden pointedly praised a \"good speech\" last week by Democratic Senate Majority Leader Chuck Schumer calling for new elections in Israel.\n\nWith the UN warning of imminent famine in Gaza, Biden earlier this month ordered the US military to start airdrops of food into the enclave, and is sending American forces to build a temporary port for maritime aid.",
    "title": "Biden Tells Netanyahu Rafah Operation Would Be 'Mistake'",
    "date": "2024-03-19T02:15:00.000+02:00",
    "url": "https://www.newsmax.com/politics/bibi-biden/2024/03/18/id/1157700",
    "author": "Danny KEMP"
}