{
    "text": "President Joe Biden’s campaign on Thursday shared a thread on X (formerly Twitter) of damning comments that 17 former top officials in Donald Trump’s administration have made to condemn the former president and presumptive GOP nominee.\n\n“The people who know Trump best won’t support him. Why should you?” the Biden campaign began the thread featuring videos of high-ranking White House officials ripping their former boss.\n\nThe people who know Trump best won’t support him.\n\n\n\nWhy should you?\n\n\n\nA thread pic.twitter.com/a88f6srNw4 — Biden-Harris HQ (@BidenHQ) March 21, 2024\n\nFormer Attorney General Bill Barr called Trump “a consummate narcissist” who “constantly engages in reckless conduct” in one clip.\n\nDictators like Russia’s Vladimir Putin think Trump is “a laughing fool and they’re fully prepared to take advantage of him,” said former National Security Adviser John Bolton in other footage.\n\nFormer Communications Director Alyssa Farah Griffin called Trump “unfit” for office again, a claim echoed by former White House press secretary Stephanie Grisham who said she was “terrified” of his 2024 campaign.\n\nTrump’s former Attorney General Bill Barr: Trump is a consummate narcissist who constantly engages in reckless conduct. He will always put his own interests and gratifying his own ego ahead of everything else, including the country’s interest pic.twitter.com/ynoLvssvOS — Biden-Harris HQ (@BidenHQ) March 21, 2024\n\nNikki Haley, the former U.S. ambassador to the United Nations, warned Trump puts the American military in danger.\n\nTrump’s own Vice President Mike Pence’s refusal to endorse Trump is also highlighted.\n\nAnd former White House communications director Anthony Scaramucci’s condemnation of Trump as a “domestic terrorist” is mentioned too.\n\nCriticism also came from former Defense Secretary John Mattis, former National Security Advisor H.R. McMaster, former Joint Chiefs of Staff chair Mark Milley, former White House chiefs of staff Mick Mulvaney and John Kelly, former Secretaries of State Mike Pompeo and Rex Tillerson, former Navy Secretary Richard Spencer, former Transportation Secretary Elaine Chao and former Defense Secretary Mark Esper.\n\nTrump’s former National Security Advisor John Bolton: Having been in the room with him, dictators think Trump is a laughing fool and they are prepared to take advantage of him pic.twitter.com/iURZiQe9IJ — Biden-Harris HQ (@BidenHQ) March 21, 2024\n\nRelated...",
    "title": "Biden Campaign Lists Former Trump Officials Who've Turned Against Him And... Wow",
    "date": "2024-03-22T08:32:00.000+02:00",
    "url": "https://www.yahoo.com/news/biden-campaign-lists-former-trump-063214237.html",
    "author": "Yahoo News"
}