{
    "text": "Most of these Boosting Biden posts deal with ways that Joe Biden has helped all Americans. But Biden has also done a lot of targeted things that only local folks know about. Honestly, too often local folks don’t even know! So we are going to celebrate some of those things here. Feel free to Kosmail me if you have ideas from your area.\n\nNow, of course, Illinois is an amazing state that didn’t need “saving.” But as we are rolling with the superhero theme, please allow me some poetic license.\n\nWhat has he done for Illinois? A lot — from the very start. How about this:\n\nBetween January 2021 and June 2022, the Illinois economy added 309,900 jobs (5.4 percent of January 2021 employment in Illinois). The state economy recovered 83 percent of the jobs lost between February 2020 and April 2020. Residents of Illinois applied to start more new businesses during President Biden’s first year in office than in any other year since the series started in 2005.\n\nAnd this, from August 2022:\n\nIllinois to Begin Work Plugging More Than 600 Orphaned Wells Through President Biden’s Bipartisan Infrastructure Law\n\nThe Department of the Interior today announced that Illinois has been awarded an initial grant of $25 million from President Biden’s Bipartisan Infrastructure Law to begin work to plug, cap and reclaim orphaned oil and gas wells across the state. Millions of Americans across the country live within a mile of an orphaned oil and gas well. The state of Illinois has indicated that it will use this funding to plug between 600 to 800 documented wells. Funds will also be used to measure and track methane emissions and contamination in groundwater and surface water. Additionally, this funding will allow Illinois to expand its well-plugging capacity with the purchase of safety equipment, computers, vehicles, gas detectors, and a Forward Looking InfraRed camera, among other items. All of these will be used to plug documented wells and locate undocumented wells throughout the state that will be plugged with Bipartisan Infrastructure Law funding in the upcoming years. Millions of Americans across the country live within a mile of an orphaned oil and gas well, which are polluting backyards, recreation areas and community spaces across the country. Methane leaking from many of these unplugged wells is a serious safety hazard and is a significant cause of climate change, being more than 25 times as potent as carbon dioxide at trapping heat in the atmosphere. The historic investments to clean up these hazardous sites will create good-paying, union jobs, catalyze economic growth and revitalization, and reduce dangerous methane leaks.\n\nAnd this, from November 2023:\n\nBiden-Harris Administration Announces $336 Million Loan to Chicago to Help Remove 30,000 Lead Pipes Across the City\n\nToday, U.S. Environmental Protection Agency (EPA) Assistant Administrator for Water Radhika Fox announced a $336 million Water Infrastructure Finance and Innovation Act (WIFIA) loan to the City of Chicago. With help from this financing, the water department will replace up to 30,000 lead pipes that deliver water to homes across the city while creating an estimated 2,700 jobs. This action marks a significant step toward replacing all lead service lines—a goal that is shared by the Biden Administration, the State of Illinois, and the City of Chicago. The Administration announced this WIFIA loan at a lead service line removal site in Chicago, Illinois, with U.S. Senator Dick Durbin, U.S. Senator Tammy Duckworth, Chicago Mayor Brandon Johnson, and additional community leaders and stakeholders. “Whether you are a resident of Chicago or any city across this nation, no person should worry if their water is safe to drink or if it will harm their children. With EPA’s $336 million loan, the City of Chicago will replace up to 30,000 lead pipes so that more local residents can rest assured that their water is safe,” said EPA Assistant Administrator for Water Radhika Fox. “The Biden-Harris Administration is committed to removing all lead pipes across this country,” she continued, “and EPA is using every tool available to address this public health issue. We are strengthening our regulations, investing in lead pipe replacement programs with $15 billion in dedicated funding under the President’s Investing in America agenda, and we are prioritizing lead pipe removal under this program.” The City of Chicago will use the WIFIA loan to help with replacing lead service lines serving single family homes and small multi-unit buildings citywide whenever there is a leak or break on a lead line or when performing water and sewer main updates. Although Chicago’s water is in compliance with state and federal safety regulations, the City is committed to replacing all the legacy lead lines to help ensure that the water system is lead-free for generations to come.\n\nand this, from later in the same month:\n\nBiden says workers need ‘a fair shot’ as he celebrates the labor deal saving an Illinois auto plant\n\nPresident Joe Biden put on a red United Auto Workers shirt on Thursday as he celebrated a labor deal that will reopen the Stellantis plant in Belvidere, Illinois, treating the factory’s salvation as a vindication of his decision to stand with striking union members as they demanded higher wages. “American workers are ready to work harder than anyone else,” Biden told cheering autoworkers in a community center in the northern Illinois city. “But they just need to be given a shot. A fair shot and a fair wage.” He praised the union members as “as tough, tough, tough as they come.” Someone in the audience shouted to the president, “That shirt looks good on you.”\n\nand this, from just last month:\n\nBiden-Harris Administration Announces $76 Million to Revitalize Coal Communities, Create Good-Paying Jobs in Illinois\n\nAs part of the Biden-Harris administration’s Investing in America tour, Principal Deputy Assistant Secretary for Land and Minerals Management Dr. Steve Feldgus and Office of Surface Mining Reclamation and Enforcement Principal Deputy Director Sharon Buccino traveled to Illinois today, where they announced $75.8 million in fiscal year 2023 funding from President Biden’s Investing in America agenda to address dangerous and polluting abandoned mine lands and catalyze economic opportunity in Illinois. “President Biden’s Investing in America agenda gives us an unparalleled investment and opportunity to address the majority of currently known abandoned mine land hazards,” said Principal Deputy Assistant Secretary Feldgus. “Through these new historic resources, the Interior Department is addressing long-standing environmental injustices, cleaning up toxic and hazardous sites and creating jobs and revitalizing former coal communities.” [. . .] Millions of Americans nationwide live less than a mile from an abandoned coal mine. The Bipartisan Infrastructure Law allocated a total of $16 billion to address legacy pollution, including $11.3 billion in abandoned mine land funding over 15 years, facilitated by the Office of Surface Mining Reclamation and Enforcement. This historic funding is expected to address the majority of currently inventoried abandoned coal mine lands in the nation.\n\nAnd finally this, just a couple of weeks ago:\n\nEPA announces cleanup will begin at the Asarco Taylor Springs Superfund site in Illinois as part of President Biden’s Investing in America agenda\n\nThe Environmental Protection Agency announced a third and final wave of more than $1 billion for cleanup projects at more than 100 Superfund sites across the country as part of President Biden’s Investing in America agenda. This funding is made possible by the President’s Bipartisan Infrastructure Law and will launch new cleanup projects at 25 Superfund sites, including the Asarco Taylor Springs Superfund site in Taylor Springs, Ill. “Alongside Illinois’ rich industrial history lies the sobering reality of polluted sites that pose significant risks to public health and the environment,” said Sen. Dick Durbin. “This federal funding is critical in our mission to restore contaminated sites for the benefit of every Illinois resident.” “Eliminating contaminated sites is an important part of protecting the health of children and families,” said Sen. Tammy Duckworth. “And it is also a necessary part of helping spur development, job creation and economic growth for affected communities.” “Rehabilitating polluted properties is critical in our efforts to revitalize underserved communities and drive economic growth,” said Rep. Nikki Budzinski. “In Springfield, the Moving Pillsbury Forward project has shown us the promise that Superfund site resources have in transforming neighborhoods that have been left behind for too long.”\n\nIs there still more work to be done? 100%! Lots more work. But Biden did more than many people guessed could be done. He deserves a lot of credit. AND he deserves to be re-elected.\n\nWhat can you do to help?\n\nYour donation will come bundled with others from our Good News community and will show Biden that there are many of us who support him and combine hard work with optimism in our battles for a better America!\n\nWant to do something else?\n\nRec and comment on these posts to keep them alive at DKos and share them with others who might not realize how great a president Joe Biden has been.\n\nLooking for something else? Here are some other ideas:\n\nThis is an entry in my ongoing series Boosting Biden.\n\nCheck the comments for more information on how to find other entries and subscribe.\n\nThese posts are written by Goodnewsroundup (Goodie),\n\nedited by Matilda Briggs, and supported by 2thanks and WolverineForTJatAW\n\nas well as several other notable Kossacks!\n\nAs with all good things, it takes a village.",
    "title": "President Biden Saved the State of Illinois! Boosting Biden Day 58",
    "date": "2024-03-20T02:00:00.000+02:00",
    "url": "https://www.dailykos.com/stories/2024/3/20/2226676/-President-Biden-Saved-the-State-of-Illinois-Boosting-Biden-Day-58",
    "author": null
}