{
    "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nFormer President Barack Obama met with U.K. Prime Minister Rishi Sunak on Monday, just hours after a report came out about a rivalry between Obama and President Biden.\n\nThe Monday meeting was Obama's first in-person meeting with Sunak since he became prime minister. Obama was only spotted when he was leaving Sunak's residence Monday afternoon. He said only that it was a \"courtesy visit\" made while conducting other business in London.\n\nThe meeting comes less than a day after a report detailing a decadelong rivalry between Obama, Biden and their aides.\n\nBiden aides have complained that \"Obama and his team did not fully appreciate Biden's experience with foreign policy, Congress and grip-and-grin politicking — and were disrespectful,\" Axios reported this weekend.\n\nOBAMA BALKED AT BIDEN'S ASSERTION THAT RUSSIA SHOULD 'PAY IN BLOOD AND MONEY' AFTER 2014 INVASION: BOOK\n\n\"The Obama people thought Biden would suck as president,\" one former Biden aide told Axios. \"They didn't think he'd be organized enough to execute.\"\n\nNETANYAHU BLASTS SCHUMER, BIDEN OVER WANING SUPPORT FOR ISRAEL\n\n\"We do have too many Obama people who don't care about Joe Biden. It's about them,\" a former White House official said.\n\n\"When people say, 'This is what worked for Obama,' their first response is often, 'We're not Obama,'\" a \"senior Democrat\" reportedly said, referring to Biden's staff.\n\nWhite House deputy press secretary Andrew Bates denied that the relationship between Biden and Obama was at all frayed in a statement to Fox News Digital, saying that Biden has not taken potshots at Obama in private.\n\nBIDEN PRIVATELY DEFIANT THAT HE DIDN'T BOTCH AFGHANISTAN WITHDRAWAL: BOOK\n\n\"We recognize that the actual level of drama in this White House is insufficient to meet some reporting quotas, but President Biden does not make such comments in private,\" Bates said. \"As President Biden has said, President Obama is family to him.\"\n\nBates described Obama and Biden as having a close \"personal bond\" and agreeing \"overwhelmingly on the issues facing the country, including building an economy that works from the bottom-up and middle-out, protecting our critical freedoms, and opposing attacks on our democracy.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nA spokesperson for the Office of President Barack Obama told Fox News Digital in a statement that the Obama Alumni Association hosted an event for Biden's re-election campaign, during which attendees chanted, \"Fired up, ready to go,\" in support of the president.\n\nFox News' Jeffrey Clark contributed to this report",
    "title": "Obama holds surprise meeting with world leader after report about Biden 'rivalry' | Fox News",
    "date": "2024-03-18T02:00:00.000+02:00",
    "url": "https://www.foxnews.com/politics/obama-holds-surprise-meeting-world-leader-report-biden-rivalry",
    "author": "Anders Hagstrom"
}