{
    "text": "rewrite this content and keep HTML tags\n\n\n\nThe U.S. Justice Department will file a blockbuster antitrust lawsuit against Apple on Thursday, according to three people familiar with the matter.\n\n\n\nThe long-anticipated lawsuit comes after years of allegations by critics that Apple has harmed competition with restrictive app store terms, high fees and its “walled-garden” approach to its hardware and software, in which Apple tightly controls how third-party tech companies can interact with the tech behemoth’s products and services.\n\n\n\nFor example, Apple allows iPhone customers to send high-quality photos and videos seamlessly to one another, but multimedia texts to Android phones are slower and grainy. The company late last year relented and agreed to improve the quality standard it uses to interact with Android phones via text message.\n\n\n\nThe company also gives its own products the ability to access certain parts of its hardware that it restricts other companies from using. That unleashes an almost magical experience for how iPhones interact with AirTags, when competitors’ products are far more limited in their capabilities.\n\n\n\nThis year, European regulations forced Apple to give other companies access to the iPhone’s tap-to-pay hardware chip, enabling the creation of competing digital wallets. But those rules are limited to the European Union.\n\n\n\nAnd Apple maintains a large 30 per cent commission on most sales through its app store – a frequent complaint from companies that try to sell subscriptions, saying Apple’s enormous share of the smartphone market forces them to pay what they argue is an unnecessarily high commission.\n\n\n\nYears of scrutiny\n\n\n\nApple has shrugged off legal challenges and criticism for years that its practices are anticompetitive. Its sterling consumer reputation and a disciplined public relations and legal strategy mirrors the precision in which Apple manufactures and oversees its products.\n\n\n\nBut the Justice Department’s landmark suit is expected to challenge a broad range of Apple’s practices.\n\n\n\nThe case represents the Biden administration’s latest effort to hold a Big Tech giant accountable under US antitrust law. Apple is the only major tech company the federal government has yet to sue for alleged antitrust violations.\n\n\n\nApple was named in a sprawling House report in 2020 finding that the iPhone maker, along with Meta, Google and Amazon, hold “monopoly power.”\n\n\n\nThe legal action could weigh on Apple’s stock price that currently values the company at just under US$3 trillion and could force changes to policies, business strategies, products and applications by the tech giant. Even divestment of some assets is not out of the question for Apple, the tech company founded by Steve Jobs in the 1970s.\n\n\n\nApple’s (AAPL) stock fell less than one per cent Thursday. The lawsuit was widely anticipated.\n\n\n\nAlong with a pair of ongoing antitrust cases against Google, the DOJ lawsuit against Apple is likely to become a symbol of the Biden administration’s commitment to competition and lowering prices. It will also be a test of how far courts are willing to go to apply decades-old antitrust law to the modern digital economy.\n\n\n\nThis is a developing story and it will be updated.",
    "title": "Biden administration to sue Apple: sources",
    "date": "2024-03-21T16:15:00.000+02:00",
    "url": "http://swifttelecast.com/biden-administration-to-sue-apple-sources",
    "author": "Andrew Shawn"
}