{
    "text": "(NewsNation) — President Joe Biden’s campaign is on the offensive, addressing Americans’ economic concerns amid poor approval ratings despite a spate of positive economic news.\n\nThe Dow Jones Industrial Average, S&P 500, and Nasdaq indexes all notched new records Thursday, topping all-time highs reached just Wednesday. The Dow is on the brink of hitting the 40,000 mark for the first time.\n\nThe positive economic news, however, has not lifted Biden’s job approval numbers and a majority of Americans disapprove of his handling of the economy.\n\nDemocrats in survival mode rebuilding Biden’s 2020 coalition\n\n\n\nFormer President Trump has seized on the dour outlook, posting online: Are you better off than four years ago?\n\nSenior Biden campaign spokesman Kevin Munoz joined “The Hill on NewsNation” to discuss the question, saying, “I think that the president, our campaign is happy to talk about the continued strong progress the Biden economy is having for the American people.”\n\n“Wages are increasing, inflation is down, jobs are being created,” he said. “And you have one candidate in this race who has a proven record of fighting for lower costs, fighting against junk fees, and that is Joe Biden.”\n\nRSC budget suggests raising retirement age\n\n\n\nMunoz pointed out that the U.S. is experiencing record job creation.\n\n“We’re looking at jobs coming back to the United States,” he said, “good paying union manufacturing jobs.\n\nMunoz also Biden’s effort to lower prescription drug costs.\n\n“And then you look at Donald Trump, the guy we’re running aginst,” Munoz said. “Not only does he have all the issues … but he also has no plan to actually address the real issues the American people want. He, in fact, has rooted for the stock market to crash. So we want to remind the American people who is fighting for them, and that’s Joe Biden.”\n\nWatch the full video in the video player at the top of the page.\n\nFOLLOW US ON GOOGLE NEWS\n\nRead original article here",
    "title": "Biden 'fighting to lower costs, junk fees': Campaign spokesperson",
    "date": "2024-03-22T04:18:00.000+02:00",
    "url": "https://todayschronic.com/biden-fighting-to-lower-costs-junk-fees-campaign-spokesperson",
    "author": "Valentin Shriner"
}