{
    "text": "As if the Biden’s needed more problems on the Hunter Biden front…\n\nKathleen Buhle, Hunter Biden’s ex-wife, recently released her own memoir.\n\nIn “If We Break,” she spills the beans about some of Hunter Biden’s escapades.\n\nMatched with the laptop, this is going to be a problem if the media ever treats this story seriously.\n\nTelling All\n\nHunter and Buhle were married in 1993.\n\nThe couple split up in 2015 after it was revealed that Hunter was having an utterly disgusting affair with his dead brother’s widow.\n\nThat relationship would also come to an end in 2019.\n\nIn her divorce filing, Buhle cited how Hunter had “spent money on drugs, alcohol, prostitutes, and strip clubs.”\n\nFox News also reported, “Divorce lawyers for Hunter Biden and his ex-wife Kathleen Buhle were aware of money hitting Hunter’s bank account from a Romania deal, emails show, appearing to contradict Buhle’s previous claims she had her ‘head buried in the sand’ when it came to Hunter’s finances.”\n\nThis is a fairly big deal because Buhle has always claimed ignorance on this front.\n\nShe clearly knows something, so it is just a matter of how much.\n\nDuring Rep. Comer’s (R-KY) investigation, he found that Buhle received $1 million, one of many Biden family members that received payments from Hunter’s alleged business activities.\n\nHer book also revealed that the family finances were largely behind handled by Eric Schwerin, who was one of Hunter’s business partners at the time.\n\nIn one communication, it was revealed that Schwerin was using Buhle as a conduit to communicate with Joe Biden.\n\nThe corruption is clearly there… but again, will the media ever take this seriously.\n\nSource: Conservative Brief",
    "title": "Wow! Biden Family Insider Flips, Spills the Beans",
    "date": "2024-03-20T18:20:00.000+02:00",
    "url": "https://newshourfirst.com/2024/03/20/biden-family-insider-flips-spills-the-beans",
    "author": "Anthony Smith"
}