{
    "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nThe Senate voted Thursday afternoon in favor of passing a bill reversing the Biden administration's recent actions allowing beef imports from Paraguay, which has a history of cattle-borne illness.\n\nIn a 70-25 vote, the Senate approved the Congressional Review Act resolution, rendering it veto-proof. Sens. Jon Tester, D-Mont., and Mike Rounds, R-S.D., introduced the bipartisan resolution in February, which has been widely endorsed by cattle and farm industry groups, arguing that the Department of Agriculture's (USDA) actions could have negative consequences on the U.S. food supply.\n\n\"President Biden butchered this decision,\" Tester said in a statement after the bill passed. \"By cutting corners to resume beef imports from a country with a recent history of foot-and-mouth disease, the Biden Administration is jeopardizing our food supply and giving Montana consumers and producers a raw deal.\"\n\n\"We cannot allow beef imports from Paraguay until we have data that shows they are meeting the same high animal health standards as American ranchers, and I’m proud to have secured bipartisan support in the Senate to force the Biden administration to reverse course.\"\n\nGOP REP INTRODUCES RESOLUTION CONDEMNING UN FOR CALLING ON AMERICANS TO STOP EATING MEAT\n\nIn November, the USDA's Animal and Plant Health Inspection Service finalized regulations allowing Paraguayan beef imports and issued a series of conditions that importers must meet to ensure that livestock diseases are not present in shipped products. The agency then began implementation of the rules one month later, despite criticism from lawmakers and U.S. industry groups.\n\nParaguay's livestock industry, though, has a history of foot-and-mouth disease (FMD), which spreads quickly among livestock and could severely threaten the U.S. economy . As a result, beef imports from the South American nation have been barred in the U.S. for years.\n\nLOCAL RESIDENTS EXPLODE AT BIDEN OFFICIALS OVER PLAN TO RELEASE GRIZZLY BEARS NEAR THEIR COMMUNITIES\n\n\"South Dakota is known for having high quality beef produced by hard-working farmers and ranchers across the state,\" said Rounds. \"We have very high standards regarding the quality of our beef. Unfortunately, Paraguay does not have the same history of enforcing health and safety standards that we do. Our inspectors haven’t been to Paraguay in ten years.\"\n\nUSDA's actions came after a push from Paraguayan officials who argued that the industry was vital for the nation and that the country's government had taken steps to ensure the health of its cattle.\n\nAccording to a readout of a September meeting between the Paraguayan government and the White House Office of the United States Trade Representative , the two sides discussed the process of authorization. Paraguayan officials expressed their desire to resume raw beef product trade \"as soon as possible.\"\n\nParaguayan cattle industry associations and government agencies, including the Embassy of Paraguay to the U.S., submitted comments in May 2023 in response to the proposed version of the regulations finalized last year. The comments similarly urged the USDA to immediately allow beef imports.\n\nBIDEN ADMIN BACKS OFF PROTECTIONS FOR APEX PREDATOR, ANGERING ENVIRONMENTALISTS\n\n\"The Government of Paraguay and its diplomatic representation here in Washington are more than open to providing additional assurances regarding our compliance with the United States' safety standards,\" a spokesperson for the Embassy of Paraguay told Fox News Digital in a statement.\n\n\"We believe that the meat industries of our two countries have a lot of potential for opportunities and collaboration, especially in the exchange of knowledge in cattle breeding, herd management, sustainable practices, and trade and investment.\"\n\nThe spokesperson said that USDA Food Safety and Inspection Service agents conducted two on-site audits in Paraguay in December 2021 and June 2022. And they said that the nation has demonstrated its capability to comply with U.S. standards and regulations.\n\nThe White House issued a statement disapproving the resolution, saying it would \"mark a significant setback in the United States-Paraguay bilateral relationship and U.S. credibility as a reliable economic partner across Latin America.\"\n\nCLICK TO GET THE FOX NEWS APP\n\nHowever, the National Cattlemen’s Beef Association (NCBA), U.S. Cattlemen’s Association, Livestock Marketing Association, R-CALF USA, National Farmers Union, Montana Farmers Union, Montana Stockgrowers Association and Montana Farm Bureau Federation all praised the Senate's passage of the resolution.\n\n\"Given Paraguay’s long history of foot-and-mouth disease outbreaks, it is simply too risky to allow Paraguayan imports without recent site visits to confirm Paraguay’s safety claims,\" said NCBA Executive Director of Government Affairs Kent Baucus. \"U.S. cattle producers are thankful for the leadership of Senators Jon Tester and Mike Rounds for applying the Congressional Review Act to hold USDA accountable and protect our nation’s cattle herd.\"",
    "title": "Senate strikes down Biden move allowing potentially diseased beef into US | Fox News",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.foxnews.com/politics/senate-strikes-down-biden-move-allowing-potentially-diseased-beef-into-us",
    "author": "Thomas Catenacci"
}