{
    "text": "Does Joe Biden have a little momentum? On the back of his fiery State of the Union speech, a robust economy, and, now, a handful of favorable polls, it sure seems as if things are looking up for the president.\n\nAnd if the success of his own policies and oratory has given him a boost, he’s getting even more help from Republicans. Recently, both Trump and Republican members of Congress have generously (inadvertently) taken to making Biden’s case for him—grabbing the third rail of American politics with both hands by pledging to cut beloved entitlement programs like Social Security and Medicare.\n\nOn Wednesday, the Republican Study Committee rolled out its newest budget plan. It calls for raising the eligibility age for Social Security, a major benefit cut; overhauling Medicare into a voucherlike “premium support” system, a privatization gambit Paul Ryan once pined for, ultimately to his own political disadvantage; and an endorsement of the Life at Conception Act, which was already under attack because it would severely restrict not just abortion but likely in vitro fertilization as well.\n\nPublication of this budget, by the way, is totally optional. This proposal is usually created as a forward-looking wish list, not a practicable charter. But there was nothing compelling the influential RSC to put out this document, particularly in an election year. (Also, the committee has other immediate, practical budget concerns, as it tries to put together a package to keep the government funded.) And yet, the RSC—which numbers some 170 members, including Speaker Mike Johnson and his top three deputies in Republican leadership—went ahead and published it anyway, putting some extremely unpopular policy proposals on the record. The attack ads will be functionally written with a simple copy-paste.\n\nAdvertisement\n\nIt’s no secret that, for years, Republicans have longed for cuts to social welfare programs. The one defiant exception to that group has been Donald Trump, who used to be able to distance himself from this stuff. He famously ran in 2016 as the only Republican presidential candidate resolutely opposed to Medicare and Social Security cuts. No longer, it seems. In a recent interview on CNBC, Trump seemingly admitted to being on board with the broader Republican plan of curtailing both programs, saying that there was “a lot you can do in terms of entitlements, in terms of cutting,” grabbing that third rail himself.\n\nAdvertisement\n\nAdvertisement\n\nAdvertisement\n\nThose comments, predictably, led to criticism, and the Trump campaign tried to walk them back.\n\nAdvertisement\n\nBut the Biden campaign had already pounced. There is no point of comparison between the two candidates the White House would rather talk about. Trump’s comments have already been clipped and circulated widely, and they will be a constant fixture of the Biden messaging strategy until November.\n\nNot on my watch. https://t.co/RAHjjUlGDa — Joe Biden (@JoeBiden) March 11, 2024\n\nAdvertisement\n\n“Many of my Republican friends want to put social security and Medicare back on the chopping block again,” Biden said in a campaign speech in New Hampshire. “I’m never going to allow that to happen.” In fact, the White House has now pledged to increase benefits.\n\nAdvertisement\n\nThere’s good reason the Biden camp is loving this. In an age of great polarization, polling on these particular policies is resounding and bipartisan. Data for Progress found that only 8 percent of likely voters support raising the retirement age. Of Republican voters, only 9 percent are in support. It is “among the most unpopular policies we have tested,” the polling group wrote in a tweet.\n\nThe Trump team’s attempt to split the difference on Social Security and Medicare cuts, already a near-impossible task, is made even more difficult by the RSC’s new vision. It’s a similar dynamic with abortion bans: Trump’s equivocation on them will be a harder sell with the American public now that the House Republican Conference has seemingly lined up behind a bill that would likely enact some sort of IVF ban nationwide.\n\nAdvertisement\n\nAdvertisement\n\nThe conversion of Medicare to a voucherized, private market competitor is similarly unpopular. When Ryan, along with running mate Mitt Romney, championed it in 2012, the Obama-Biden ticket seized on it with glee. Attacking that policy became a fixture of the race and no doubt helped the Democratic president win reelection that year.\n\nSo, despite Biden’s weaknesses, Republicans have now cleared the path for him to run on one of the simplest, most popular policies in America—while embracing a platform reviled by 9 in 10 members of the Republican Party. It’s the sort of advantage a presidential campaign can only dream about, and Republicans have dropped it in Biden’s lap without antagonization.\n\nOf course, Republicans may be so confident about their election prospects that they feel no need to withhold their intentions to pursue radically unpopular policy changes come 2025. But there’s a lot of this election cycle left to go, and voluntarily yoking themselves to something a lot of people would really hate is a bold choice.",
    "title": "House Republicans Just Can’t Stop Themselves From Making the Case for Biden",
    "date": "2024-03-21T22:43:00.000+02:00",
    "url": "https://slate.com/news-and-politics/2024/03/social-security-medicare-johnson-biden-congress-republicans-budget.html",
    "author": "Alexander Sammon"
}