{
    "text": "The economic toll of inflation rates in the U.S. remains a top issue for voters in the 2024 presidential cycle.\n\nAccording to the Pew Research Center, nearly three-quarters of Americans say strengthening the economy is their top priority, driven by worries about inflation. 72% of adults are very concerned about the price of food and consumer goods and 63% are very worried about the cost of housing.\n\nDespite inflation having fallen by about 6 percent since its high in 2022 and the U.S. enjoying the lowest inflation among countries in the G7, an informal group of advanced economies including Germany, Japan and the U.K.\n\nThe tide might be starting to turn as views on the economy shift: a Suffolk University and USA TODAY poll shows that 33 percent of respondents describe the economy as being in “economic recovery,” up from 9 percent less than two years ago.\n\nWith voters so concerned about inflation and the economy, they will likely consider President Joe Biden’s and former President Donald Trump’s inflation-reducing plans when making their decision.\n\nHow does Biden plan to fix inflation?\n\nBiden has touted his Inflation Reduction Act, enacted in August of 2022, but it hasn’t yet curbed prices—which even he admits.\n\n“I wish I hadn’t called it that because it has less to do with reducing inflation than it has to do with providing alternatives that generate economic growth,” the president said in August 2023.\n\nHowever, the law also hasn’t caused prices to increase, and it has the potential to bring down inflation in the future. By 2030, the White House says it will cut electricity rates by as much as 9 percent through tax credits for renewable energy, and lower gas prices by as much as 13 percent through electric vehicle tax credits.\n\nThe law could also bring down inflation through its health care provisions, which include capping monthly insulin prices and out-of-pocket prescription drugs.\n\nBiden has pledged to do more on inflation. In a statement on March 12, he said that his recent budget proposal would lower prescription drug costs, health care, child care, and education costs, rents by building two million homes, and taxes on the wealthy and corporations. However, the proposal is unlikely to pass the Republican-controlled House.\n\nMore:Taxing the rich to cut deficit: Five takeaways from President Biden's proposed budget\n\nWhere does Trump stand on fixing inflation?\n\nTrump voters have mentioned inflation and the economy as reasons for voting for the former president. However, according to economists, his agenda includes few inflation-reducing policies.\n\nOne of Trump’s plans to curb inflation would be more gas production. He said that America should “drill, baby, drill.” But America is already drilling: U.S. oil output hit record highs last year.\n\nOne of Trump’s plans is to increase tariffs on goods from China by as much as 60 percent or more. But these tariffs wouldn’t just hurt foreign producers; costs could be passed onto the goods themselves, raising prices for consumers.\n\nThe campaign also promises a large-scale deportation of undocumented immigrants. If that plan were implemented, labor shortages would raise prices because of either fewer goods or raised wages.\n\nTrump has also mentioned his intent to deregulate businesses, which could reduce inflation as businesses save costs. But he has not offered any more details on those plans.\n\nOther factors that lower inflation\n\nThe president often gets celebrated when the economy is doing well, and blamed when it’s doing poorly. But the reality is that the administration usually has little control over how the economy performs.\n\nFor one, it’s not just the White House that controls inflation; in reality, the Federal Reserve is the agency mainly responsible, and makes decisions independent of the president. To keep inflation low, the Fed’s principal tool is raising interest rates. However, higher interest rates can make home ownership more expensive.\n\nOil and gas prices have a significant impact on inflation. Recently, their rise and fall have been tied to Russia’s invasion of Ukraine. In general, oil prices are driven by global events rather than U.S. domestic policy.\n\nThe pandemic is also to blame. Supply chain issues caused by the COVID-19 pandemic increased shipping costs, which in turn increased the prices of goods. As those kinks have been worked out recently, prices have fallen.\n\nInflation is receding: while not yet at the 2% recommended by the Federal Reserve, it’s at 3.1 percent right now—much lower than 9.1 percent in 2022.\n\nYet, high prices remain fresh in voters’ minds, and both Biden and Trump will likely want to prove themselves the best candidates for the job.",
    "title": "U.S. inflation: Here's where Biden, Trump stand on how to fix it",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.delmarvanow.com/story/news/politics/elections/2024/03/21/how-to-fix-inflation-biden-trump-plans-as-president/73033322007",
    "author": "Margie Cullen"
}