{
    "text": "NEW YORK — Former President Donald Trump's fundraising picked up last month, but his political operation is still struggling to catch up to President Joe Biden and the Democratic Party in money coming in.\n\nTrump's campaign and his Save America political action committee, two key committees in his political operation, reported raising a combined $15.9 million in February and ended the month with more than $37 million on hand, according to filings with the Federal Election Commission Wednesday night.\n\nThat's up from January, when the committees raised only $13.8 million. As Trump in February handily won primary contests in Nevada and New Hampshire, the prospects of any Republican challenger overtaking him in the presidential race dimmed significantly.\n\n''Americans know that they were better off with President Trump four years ago than with Crooked Joe Biden and his disastrous policies. We need a return to America First policies that successfully kept our country safe and supercharged the economy for all Americans,\" Trump's campaign Communications Director Steven Cheung said in a statement.\n\nUnimpressed, Biden campaign Communications Director Michael Tyler said in a statement, ''If Donald Trump put up these kinds of numbers on The Apprentice, he'd fire himself,.\"\n\n''But here's why he ain't got it: his extreme, toxic agenda of banning abortion, slashing Social Security, and promoting political violence is repelling donors and doing exactly (asterisk)nothing(asterisk) to earn support from the voters who will decide this election.''\n\nBiden's campaign, meanwhile, said his political operation raised $53 million last month and ended February with $155 million on hand. That includes Biden's joint fundraising with the Democratic National Committee. The full picture will not be available until April when some of the committees in his political operation are due to file reports.\n\nHis main campaign account raised $21 million in February, according to its latest filing with the FEC, and ended the month with $71 million on hand.\n\nThe monthly numbers reported by the two Trump committees are key to his fundraising operation but only a portion of the full picture, with other committees scheduled to report their latest numbers in April. The Save America committee has been paying the bulk of Trump's legal fees in his various court cases. Legal spending made up 85% of its total operating expenses during the first two months of this year, roughly the same as 2023, when such expenses were about 89%. It has spent $8.5 million on legal fees so far this year.\n\nTrump's February numbers did not include any fundraising with the Republican National Committee. Earlier this month, days after his last major opponent Nikki Haley dropped out of the GOP primary, Trump's political team took over the cash-strapped RNC and installed a new leadership team.\n\nThe campaign this week set up joint fundraising operations with the RNC.\n\n___\n\nKessler reported from Washington.",
    "title": "Trump's latest 2024 campaign fundraising report shows him lagging behind Biden in cash",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.startribune.com/trumps-latest-2024-campaign-fundraising-report-shows-him-lagging-behind-biden-in-cash/600352956",
    "author": "MICHELLE L. PRICE"
}