{
    "text": "CNN —\n\nAs legal fees for Donald Trump and his associates mount, the former president’s leadership PAC that has been used to pay many of these bills requested a refund on a $60 million contribution it made to a super PAC supporting Trump, a source familiar with the matter told CNN. It was not immediately clear if any of the money had been refunded.\n\nThe leadership PAC, Save America, spent more than $40 million on legal fees for him and many of his associates since the start of 2023.\n\nThe refund request was first reported by The New York Times.\n\nCNN previously reported that Trump’s team is creating a legal defense fund to help offset some of the enormous bills incurred amid a multitude of investigations into the former president.\n\nSpecial counsel Jack Smith filed new charges on Thursday against the former president, his aide Walt Nauta and a third defendant, Carlos De Oliveira, in the case alleging Trump mishandled classified documents after leaving the White House. The new charges included allegations that Trump and his employees attempted to delete Mar-a-Lago security footage sought by the grand jury. Both Nauta and De Oliveira are being represented by attorneys paid for by Trump world.\n\nAdditionally, earlier this year, Trump was indicted by a Manhattan grand jury on more than 30 counts related to business fraud. He also faces potential charges in the special counsel’s grand jury investigation into the leadup to the January 6, 2021, Capitol riot as well as an investigation by the Fulton County District Attorney’s office in Georgia relating to claims of voter fraud after the 2020 election.\n\nThe fund is expected to cover the bills of some of Trump’s current and former aides and employees who have been wrapped up in these investigations.\n\nThe new fund will be called the Patriot Legal Defense Fund Inc., sources previously told CNN, and will be led by Trump associate and adviser Michael Glassner.",
    "title": "Trump leadership PAC requests $60 million refund from super PAC as legal fees mount",
    "date": "2024-03-21T00:21:00.000+02:00",
    "url": "https://www.cnn.com/2023/07/31/politics/trump-pac-legal-fees/index.html",
    "author": "Kristen Holmes"
}