{
    "text": "was “crypto,” now “onchain”\n\nOn the Unchained podcast on Friday, host Laura Shin wisely noticed that her guest – Coinbase’s Jesse Pollak, who originally created his company’s Layer 2 blockchain Base – was using the term “onchain” rather than “crypto” in the course of their conversation on the latest Ethereum upgrade.\n\nShe asked him why “onchain” and not “crypto”? He replied in part (edited):\n\n“(…) The thing that I think is really powerful is… instead of hearing ‘crypto’ or ‘web3’ and thinking about speculation, pump and dump and all of this legacy of the crypto industry that has really been driven by speculation for the last decade… people hear ‘onchain,’ they get to see it in a new light, they get to analogize it to ‘online’ – which is this thing that has transformed their lives over the last 20 years – and they see it first and foremost as a technology.\n\nThey say, ‘If I come onchain, I can earn more money for my business or I can cut out the middlemen who are taking my creative work and profiting off of it. Or I can play this new game that wasn’t previously possible, or I can collaborate and send money to anyone in the world instantly and for free….\n\nThose are not about speculation, it’s not about making more money, it’s about taking a technology and making your life better. I think that is the theme of onchain – it’s about upgrading our systems.\n\nIt’s about acknowledging that a lot of the stuff we’ve been doing with money is built on systems that are 50-100 years old. And if we use technology, software, blockchains to build new experiences and to bring the world onchain, we actually make everyone’s life better.\n\n(…) Our mantra for the industry is that it’s time for change. And it’s time for us to embrace this new language – the language of ‘onchain’ – that really centers crypto as a technology change that is upgrading our systems to make the world a better place.”\n\nmore tips:\n\n“How Ethereum’s Dencun upgrade could lead to the rise of millions of Layer 3s” (podcast) – Unchained\n\n\n\nwhat you should know: In addition to a mantra, Pollak’s response could be the leading edge of a maturation for an industry. For cynics, the view could be that Pollak’s serving another cupful of wishful crypto thinking.\n\ndigital assets taxes\n\nIn his Friday newsletter, Cap Hill Crypto’s George Leonardo dissected the Biden Administration’s new 2025 budget proposal which could impact digital assets. Leonardo writes, “Like last year, the Budget proposes a tax on energy used for mining and several updates to the existing tax code aimed at incorporating digital assets.”\n\nHe reviews the “Digital Asset Mining Excise Tax” and notes, “The Budget proposes a new tax on energy used for digital asset mining. Specifically, mining firms would have to pay a tax equal to 30% of the costs of electricity used for mining. The tax would be phased in over three years, with a rate of 10% in the first year, 20% in the second year, and 30% each year thereafter…”\n\nRead the Cap Hill Crypto breakdown.\n\nRep. Hill running\n\nPunchbowl News’ The Vault newsletter reports that House Financial Services (HFS) Committee Vice Chair and Subcommittee on Digital Assets, Financial Technology and Inclusion Chair French Hill (R, AR) is definitively running for the head of the HFS Republican caucus saying, “Communications Director Brooke Nethercott confirmed to us that Hill is in the running for the committee job overseeing Wall Street and the federal financial regulators.” Read more (subscription).\n\nwhat you should know: It’s a good sign for digital assets aficionados, but with the dwindling momentum for the majority House Republicans in the November general election, who controls the HFS agenda looks increasingly in question.\n\ncampaign finance\n\nCoinciding with pro-crypto super PACs expressing their interest in the primary, two candidates in the Maryland Senate primary have announced they are pro-crypto. Politico’s Jasper Goodman reports that one of the candidates, Rep. John Trone (D), was one of 100 Democrat co-signers of Sen. Elizabeth Warren’s (D, MA) October 17 letter to the White House and U.S. Treasury expressing concern about crypto’s connection to the financing of terrorism and Hamas in light of the October 7 terrorist attacks in Israel.\n\nTrone tells Politico he supports new digital assets regulation and adds, “We cannot let the U.S. fall behind in the global race for technological advancement and economic competitiveness.” Read more.\n\nwhat you should know: Trone’s House Committee appointments (Appropriations, Joint Economic Committee and Budget Committee) in the 118th Congress have been outside of the House’s digital assets discussion in Financial Services and Agriculture. If the digital asset market structure bill [H.R.4763] can make it to the House Floor before the August Congressional recess, it will be interesting to see how he and other Dems would vote – especially with campaign “kibble” from Super PACs potentially waiting for them.\n\nuse case – DLT for finance\n\nA new study from Broadridge, a multi-billion dollar, public, fintech infrastructure company, says that distributed ledger technology investment is nearly matching the increase in investment in artificial intelligence (AI) by the world’s financial industry today. See the report.\n\nLedger Insights covers the report and observes, “One of the questions asked whether DLT would reduce the need for custodians and clearinghouses for post-trade and issuance. Thirty-six percent of respondents agreed.” Read the summary.\n\ncentralized decentralization\n\nIn the Financial Times, reporter Josh Oliver offers a long opinion piece on what’s wrong with crypto. In the process, he offers a bulleted list beginning with centralization: “Technical explanations will almost always tell you that crypto’s key attribute is that it is decentralised. It is not. This is problem number one.” Read more.\n\nCoinciding with the essay, Oliver published a new book on crypto called, “Hype Machine: How Greed, Fraud and Free Money Crashed Crypto.”\n\nstill more tips\n\nStarbucks Is Shutting Down Its NFT Rewards Program—Will It Return? – decrypt\n\nEl Salvador Has Thousands More Bitcoins Than Previously Known – CoinDesk\n\nGenesis to Face Off Against Parent in Final Showdown Over Digital-Asset Disputes – The Wall Street Journal\n\nSam Bankman-Fried Should Get 40 to 50 Years in Prison, Prosecutors Say – The New York Times",
    "title": "Moving From Crypto To Onchain Says Coinbase Exec; Campaigning for Crypto And 2024",
    "date": "2024-03-18T07:34:00.000+02:00",
    "url": "https://blockchaintipsheet.com/news/onchain-crypto-dlt",
    "author": "John Ebbert"
}