{
    "text": "Reading Time: 2 minutes\n\nPresident Biden on Tuesday aimed to court Latino voters while fundraising in Arizona, outlining the comparison between himself and former President Trump.\n\n“You’re the reason why, in large part, I beat Donald Trump,” Biden said at a campaign event in Phoenix. “I need you badly.”\n\nHe then pointed to Trump’s comments about Latino immigrants. Trump recently made controversial comments that received pushback, including that immigrants are “poisoning the blood” of America, and said that some undocumented immigrants as “not people.”\n\n“He only cares about the wealthy,” Biden said on Tuesday, referring to Trump.\n\nThe president highlighted Latino members of his administration, including Health and Human Services (HHS) Secretary Xavier Becerra and Education Secretary Miguel Cardona.\n\nThe focus on Latinos comes as Biden’s campaign launched a national program to engage and mobilize Latino voters. Latinos con Biden-Harris kicked off on Tuesday and is intended to jump-start a series of events to engage, train, and mobilize Latino supporters.\n\nBiden went to Nevada and Arizona with the strategy to target Trump on top issues like immigration, as well as defending democracy, abortion rights, and unions.\n\nBiden lags behind Trump in Arizona, with the former president holding a 5.1 percent lead, according to an aggregation of polls by Decision Desk HQ. Trump is also ahead in Nevada, holding a 5.7 percent lead, according to an aggregation of polls.\n\nThe president earlier on Tuesday, while in Nevada, defended his low poll numbers and said that in the last few national polls, he was beating Trump. He called the press all “good guys,” as some Democrats have pushed back on the media’s focus on the president’s poor polling numbers against Trump.",
    "title": "Biden courts Latino voters while fundraising in Arizona",
    "date": "2024-03-20T03:15:00.000+02:00",
    "url": "https://dcnewssource.com/biden-courts-latino-voters-while-fundraising-in-arizona",
    "author": "Lainey Steadman"
}