{
    "text": "The Biden administration announced on Wednesday new regulations on tailpipe emissions that could reshape the nation’s transportation sector. The rule, which calls for a 56% reduction in fleetwide average carbon emissions by 2032, constitutes the strictest-ever limit on pollution from the nation’s cars and light trucks.\n\n“Today, we’re setting new pollution standards for cars and trucks,” Joe Biden said in a statement. “US workers will lead the world on autos making clean cars and trucks, each stamped ‘Made in America.’ You have my word.”\n\nThe new standards come as part of the White House efforts to slash greenhouse gas emissions. Transportation is the largest source of planet-warming emissions in the US, and passenger cars and trucks account for the majority of that pollution.\n\nBy the time the rule is fully implemented in 2055, it will have cumulatively slashed more than 7bn tons of carbon dioxide emissions, senior administration officials told reporters on Tuesday. It will also tackle toxic pollution, they said, slashing fine particulate emissions by 95% and emissions of NOx and volatile organic compounds by 75%.\n\nBut the regulation has been weakened since it was first proposed last spring.\n\nThe final rule would result in the same endpoint – a 56% reduction in fleetwide average carbon emissions by 2032 from 2026 levels – but the year-over-year tightening of the pollution standards between 2027 and 2030 will happen at a more gradual pace.\n\nThe change aligns with asks from auto manufacturers and the United Auto Workers. UAW, which has long noted that EV jobs often pay less than traditional autoworker jobs, last year said the Environmental Protection Agency (EPA) should revise its standards to increase stringency “more gradually” in an effort to ensure they do not “disproportionately impact domestic union auto production”.\n\nBut critics say the slower cuts will allow automakers to continue selling fossil fuel-powered vehicles longer and will produce more cumulative pollution.\n\n“This rule could’ve been the biggest single step of any nation on climate, but the EPA caved to pressure from big auto, big oil and car dealers, and riddled the plan with loopholes big enough to drive a Ford F150 through,” said Dan Becker, director of the safe climate transport campaign at the environmental advocacy group Center for Biological Diversity.\n\nThe rule is expected to boost to national electric vehicle sales, but it does not mandate the sale of any type of vehicle. Last spring, the EPA projected that electric vehicles would need to make up about two-thirds of car and light truck sales by 2032, up from less than one-tenth in 2023, to meet emissions reduction goals.\n\nIn a shift from the 2023 proposal, which did not mention plug-in hybrid vehicles, the EPA’s final rule says manufacturers could achieve the same reduction if 56% of cars sold are fully electric and 13% are plug-in hybrids by 2032. The move comes after automakers criticized the earlier omission.\n\nThe EPA says the rule will save the nation $99bn a year, including $46bn in reduced fuel costs and nearly $16bn in auto repair and maintenance. The rule is also expected to prevent 2,500 premature deaths by 2055 thanks to cuts in pollution.\n\nSome environmental groups applauded the new limits.\n\nskip past newsletter promotion Our US morning briefing breaks down the key stories of the day, telling you what’s happening and why it matters Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy. We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\n“Every single day, millions of Americans suffer under the weight of vehicle pollution, unsustainable gas prices and the climate crisis, all fueled by tailpipe emissions spewing from gas cars throughout our communities,” said Ben Jealous, executive director of the Sierra Club. “Today, President Biden, in one of the most significant actions his administration can take on climate change, has put forward standards with benefits extending far beyond reducing greenhouse gas emissions.”\n\nThe new standards, Jealous said, will “save lives and money for families”.\n\nRepublicans have already launched plans to go after the new regulation. Two GOP lawmakers are preparing a resolution aiming to kill the rule, E&E News reports. On the campaign trail, Donald Trump has said he would repeal Biden’s “insane electric vehicle mandate” on his first day in office.\n\nEV sales are accelerating. Last year, they were up by 54% compared with 2022, which was a 46% increase from 2021, according to Wards Auto Data.\n\n“From plug-in hybrids to fuel cells to fully electric, drivers have more choices today,” said Biden’s national climate adviser, Ali Zaidi, in emailed statement. “This growth means jobs, and it means we are moving faster and faster to take on the climate crisis.”",
    "title": "Biden announces new tailpipe emission rule that could reshape vehicle sector | Biden administration - WDC NEWS 6",
    "date": "2024-03-20T17:30:00.000+02:00",
    "url": "https://wdcnews6.com/biden-announces-new-tailpipe-emission-rule-that-could-reshape-vehicle-sector-biden-administration",
    "author": "WDC NEWS 6 STAFF"
}