{
    "text": "Former business associates of Hunter Biden are expected to testify publicly on Capitol Hill Wednesday as congressional Republicans begin the next phase of the impeachment inquiry against President Biden.\n\nHouse Oversight Committee Chairman James Comer is expected to open the hearing by explaining that throughout the impeachment inquiry, investigators have \"found no credible evidence of the Bidens providing any work product\" and has \"identified no legitimate value or document or even one single hour of work that the Bidens have provided their business partners.\"\n\n\"What is apparent, after over a year of investigation, is that the Bidens do not work in any traditional sense of the word. They do not work as consultants. Or lawyers. Or advisors. The Bidens don’t sell a product or a service or a set of skills,\" Comer will say, according to excerpts of his opening statement obtained by Fox News Digital. \"The Bidens sell Joe Biden.\n\nComer will say that Joe Biden \"has taken action after action to further his family’s plans to get rich.\"\n\n\"The scam is simple. The Biden family promises they can make a foreign partner’s problems go away by engaging the U.S. government,\" Comer will say. \"It’s done over and over again. The Biden family promises Joe’s power, Joe Biden shows up, and millions of dollars come into the Bidens’ pockets.\"\n\nComer will add: \"Joe Biden is the Biden family’s closer.\"\n\nTony Bobulinski, a U.S. Navy veteran, will appear publicly for a joint hearing of the House Oversight and Judiciary committees Wednesday morning.\n\nJason Galanis, who is serving a 14-year prison sentence, will also testify but will do so virtually from Federal Prison Camp, a minimum-security prison for male inmates in Montgomery, Alabama.\n\nHUNTER BIDEN REFUSES TO ATTEND HOUSE HEARING WITH FORMER BUSINESS ASSOCIATES\n\nDemocrats have invited Lev Parnas, a former associate of former Trump attorney Rudy Giuliani, to testify publicly as well.\n\nIn announcing the hearing earlier this month, Comer invited Hunter Biden to testify publicly as well, per the first son’s repeated requests. Through his attorney Abbe Lowell, Hunter rejected the invitation.\n\nLowell, in a letter to the committees, called the hearing a \"carnival side show.\"\n\nComer also invited Hunter Biden’s former associate, Devon Archer. Archer is not expected to attend.\n\nComer, though, has said he has \"called Hunter Biden's bluff.\"\n\nHUNTER BIDEN ADMITS HE PUT HIS FATHER ON SPEAKERPHONE, INVITED HIM TO MEETINGS, BUT DENIES 'INVOLVEMENT'\n\n\"Hunter Biden for months stated he wanted a public hearing, but now that one has been offered alongside his business associates that he worked with for years, he is refusing to come,\" Comer said. \"During our deposition and interview phase of our investigation, Hunter Biden confirmed key evidence, including evidence that his father, President Joe Biden, lied to the American people about his family’s business dealings and, in fact, attended meetings, spoke on speakerphone and had coffee with his foreign business associates who collectively funneled millions to the Bidens.\"\n\nComer had subpoenaed Hunter Biden for a deposition scheduled for early December, but the president's son defied that subpoena for a closed-door deposition, demanding a public hearing instead. Comer vowed to give Hunter Biden that public hearing after the committee had him for a deposition — like all other witnesses.\n\n\"When you're investigating a family for this level of corruption you deserve the truth, the American people deserve the truth,\" Comer said. \"We're giving Hunter Biden a venue to testify publicly.\"\n\nHunter Biden appeared for his highly anticipated deposition last month before both the House Oversight and Judiciary committees and maintained that his father was never involved in and never benefited from his businesses.\n\nThe committee also heard testimony from James Biden, the president’s younger brother, who testified the same.\n\nJOE BIDEN ALLEGEDLY CONSIDERED JOINING BOARD OF CCP-LINKED COMPANY, WITNESS TESTIFIES FROM PRISON\n\nHunter Biden did admit, however, that he put his father on speakerphone with his business associates and invited him to drop by his business lunches.\n\nArcher testified before the House Oversight Committee last year that Hunter Biden put his father on speakerphone at least 20 times with business associates.\n\nWithout Hunter and Archer, the hearing Wednesday will feature testimony from Bobulinski, who worked with Hunter Biden to create the joint venture SinoHawk Holdings with Chinese energy company CEFC. Bobulinski testified behind closed doors that he personally met with Joe Biden in 2017 for more than 45 minutes.\n\nBobulinski also testified that Joe Biden \"enabled\" his son Hunter to sell access to the \"most dangerous adversaries\" of the U.S., including the Chinese Communist Party, Russia and others.\n\nJOE BIDEN 'ENABLED' FAMILY TO SELL ACCESS TO 'DANGEROUS ADVERSARIES,' TONY BOBULINSKI TESTIFIES\n\nGalanis’ testimony will also focus on whether Joe Biden was involved in the businesses he worked on with Hunter Biden.\n\nGalanis, who was interviewed by congressional investigators in prison last month, testified that Joe Biden was considering joining the board of a joint venture created by Hunter Biden and his business associates with ties to the Chinese Communist Party after he left the vice presidency.\n\nGalanis also said that the words \"lean in\" were \"used often by Devon and Hunter in our business dealings as a term for access to Vice President Biden’s political influence.\"\n\nERIC SCHWERIN CONFIRMS JOE BIDEN USED 'ROBINWARE456' EMAIL ALIAS WHILE SERVING AS VICE PRESIDENT\n\nGalanis is serving a 14-year prison sentence after pleading guilty to securities fraud based on bonds issued by a company affiliated with a Native American tribe in South Dakota. The funds were reportedly supposed to be used for certain projects but were instead used for his personal finances. He was sentenced in 2017.\n\nDEVON ARCHER: HUNTER BIDEN, BURISMA EXECS ‘CALLED DC’ TO GET UKRAINIAN PROSECUTOR FIRED\n\nDemocrats have blasted what they call the \"hopeless impeachment investigation,\" with the top Democrat on the Oversight Committee, Rep. Jamie Raskin, D-Md., telling Fox News Digital the inquiry \"originated with a bunch of lies told by an indicted liar in close proximity to Russian agents.\"\n\n\"So who better than Lev Parnas himself — Rudy Giuliani’s right-hand man on the original mission to smear Joe Biden — to tell the story of how this campaign of lies and slander works?\" Raskin said. \"Lev Parnas can debunk the bogus claims at the heart of the impeachment probe and, in the process, explain how the GOP ended up in this degraded and embarrassing place.\"",
    "title": "Former Hunter Biden associates to testify publicly in next phase of impeachment inquiry | Fox News",
    "date": "2024-03-20T02:00:00.000+02:00",
    "url": "https://www.foxnews.com/politics/former-hunter-biden-associates-testify-publicly-amid-next-phase-impeachment-inquiry",
    "author": "Brooke Singman"
}