{
    "text": "Texas immigration law SB4 gives the state power to secure the border and deport illegal immigrants to Mexico — since the federal government is refusing to do so.\n\nWhile the Supreme Court allowed the law to remain in effect while the Biden administration challenges it, the 5th Circuit Court of Appeals has decided to stop it.\n\n“Yesterday, the Supreme Court said Texas can begin arresting, and then, I get up this morning and the appellate court says, ‘No, no, no, not so fast,’” Glenn Beck says to Texas Attorney General Ken Paxton.\n\nPaxton is completely floored by the decision.\n\n“I’ve never seen anything like it; I don’t understand it,” Paxton tells Glenn, adding, “it’s bizarre.”\n\n“What we have going on here is a whole lot of harm. We have crime, we have killers, we have just an invasion of our border,” Glenn says. “It should be that the court should say, ‘No, no, no, let them arrest until we look at everything. Instead, the harm that is being perceived, I guess by the court, is to the illegal alien.”\n\nPaxton believes it's not just illegal immigrants who the court is afraid of harming.\n\n“Yes, to the illegal aliens and to the Biden administration’s partnership with cartels, that’s the harm. We are harming the cartel relationship, and I don’t know how else to put it,” Paxton says.\n\n“If the court defends this, if they block us from enforcing legitimate path law by the legislature signed by the governor, then they are saying, ‘We want to protect any harm that might come to the illegal immigrants and to the Biden administration’s work with the cartels,’” Paxton adds.\n\nWant more from Glenn Beck?\n\nTo enjoy more of Glenn’s masterful storytelling, thought-provoking analysis, and uncanny ability to make sense of the chaos, subscribe to BlazeTV — the largest multi-platform network of voices who love America, defend the Constitution, and live the American dream.",
    "title": "Texas' SB4 blocked PRESERVE Biden admin partnership cartels? | Blaze Media",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://www.theblaze.com/shows/the-glenn-beck-program/was-texas-sb4-blocked-to-preserve-the-biden-admin-s-partnership-with-cartels",
    "author": "BlazeTV Staff"
}