{
    "text": "Given the inability thus far of Democrats and the Washington D.C. establishment to metaphorically \"kill\" former President Donald Trump politically, there are growing concerns among some of Trump's supporters that his enemies might resort to an actual assassination attempt to prevent him from returning to the White House.\n\nRhetorical fuel was just poured on that smoldering fire by outspoken Democratic strategist James Carville, who admittedly used a phrase synonymous with assassinations to describe what President Joe Biden's campaign needed to do to secure victory over Trump, according to RealClearPolitics.\n\nCarville has long been known to use overly hyperbolic and controversial commentary in his partisan rhetoric, but his remarks that could be construed by some as a call for the murder of the former president likely went too far and deserve condemnation from his fellow Democrats.\n\nCarville uses assassination euphemism against Trump\n\nOn Wednesday, according to Breitbart, Carville appeared on CNN with host Anderson Cooper and suggested that President Biden's \"surrogates\" engage in \"wet work\" -- which he himself admitted meant \"to take a guy out\" -- on his behalf against former President Trump.\n\nCooper played a clip of Biden criticizing specific prior controversial comments from Trump and reminded Carville that he'd previously suggested that Biden and his campaign needed to be doing exactly that \"more and more.\"\n\n\"Not so much him,\" Carville said of Biden. \"I mean, to be candid Anderson, President Biden is not the best attack politician I've ever seen in my life, and we'll leave it at that. But there are a lot of people to do what I call, quote, the wet work, unquote.\"\n\nAccording to the Merriam-Webster Dictionary, \"wet work\" is a well-known euphemism for \"work involving murder or assassination,\" and Breitbart noted that it references \"spilling blood\" while taking a life.\n\nCarville admits \"CIA term\" means \"to take a guy out\"\n\nRather than castigate Carville for his violent \"wet work\" rhetoric, CNN's Cooper let out a slight chuckle in response and smiled as he joked, \"It sounds like a mob hit.\" Carville replied with a smirk, \"Well, it kinda is but it's paid TV and stuff like that. But yes, it's a CIA term -- to take a guy out.\"\n\nReturning his attention to Biden and his re-election campaign, the longtime Democratic operative said, \"But he doesn't need to do the wet work. People like me and other groups in the party need to do that. He's not very good at it. I don't think people want to hear\" that from him.\n\n\"And he can -- he can cruise along at a better altitude, but this has got to be done and they've got to press this advantage right now while they have it,\" Carville added.\n\nTucker Carlson believes Trump's opponents will try to assassinate him\n\nThere are a few voices on the right, none more prominent than former Fox News host Tucker Carlson, who have suggested that Democrats and the political establishment, having failed at all other prior attempts to politically and financially destroy, may actually resort to physical violence and assassination to ensure that former President Trump can't serve a second term in the White House.\n\nBusiness Insider reported in September 2023 that Carlson, during an interview with comedian Adam Carolla, warned, \"If you begin with criticism, then you go to protest, then you go to impeachment, now you go to indictment, and none of them work. What's next? Graph it out, man. We're speeding toward assassination, obviously.\"\n\nHe added, \"They have decided -- permanent Washington, both parties have decided -- that there's something about Trump that's so threatening to them, they just can't have him.\"\n\nThe outlet noted that just one week earlier Carlson had directly asked Trump if he was worried about assassination attempts against him, and though Trump seemed to sidestep a direct response to that question, he did point out that his partisan opponents were \"savage animals. They're people that are sick.\"",
    "title": "Dem operative Carville calls for Biden campaign 'wet work' - a euphemism for assassination - against Trump",
    "date": "2024-03-22T11:33:00.000+02:00",
    "url": "https://www.patriotnewsalerts.com/carville-biden-campaign-wet-work-euphemism-assassination-trump",
    "author": "Ben Marquis"
}