{
    "text": "The U.S. Department of Justice filed a landmark lawsuit against Apple on Thursday, accusing it of monopolizing the smartphone market.\n\nThe civil suit, joined by attorneys general for 15 states and the District of Columbia, accuses Apple of restricting its smartphone operating system in a way that drives up costs for consumers and prevents developers from successfully releasing products on other smartphone systems.\n\n“Consumers should not have to pay higher prices because companies violate the antitrust laws,” Attorney General Merrick Garland said in a news release.\n\nAmong the suit's allegations:\n\nApple prevents the successful deployment of what the DOJ calls \"super apps\" that would make it easier for consumers to switch between smartphone platforms.\n\nApple blocks the development of cloud-streaming apps that would allow for high-quality video-game play without having to pay for extra hardware.\n\nApple inhibits the development of cross-platform messaging apps so that customers must keep buying iPhones. The DOJ specifically highlights the frequent consumer complaint of seeing a message sent from a non-iPhone device show up as green instead of the standard iMessage blue — and with fewer features than one sent between two iMessage users.\n\nIn a press conference Thursday following the release of the suit, Garland acknowledged Apple's dominance as a company — noting its market capitalization was larger than the GDP of more than 100 countries — but that this success was not the result of its superior products, but rather through its \"exclusionary\" tactics.\n\nApple's performance, he said, has come \"not by making its own products better, but by making other products worse.\"\n\nIn a statement, Apple denied the allegations and accused the government of overreach.\n\nIt said it was under no obligation to use designs or policies that may be preferred by competitors, especially when those designs would make iPhone users’ experience worse.\n\nFor example, Apple said, it has not developed a version of iMessage compatible with non-iPhone devices because it would not be able to provide a comparable user experience that meets the company's standards.\n\n“At Apple, we innovate every day to make technology people love —designing products that work seamlessly together, protect people’s privacy and security, and create a magical experience for our users,\" it said. \"This lawsuit threatens who we are and the principles that set Apple products apart in fiercely competitive markets. If successful, it would hinder our ability to create the kind of technology people expect from Apple — where hardware, software, and services intersect. It would also set a dangerous precedent, empowering government to take a heavy hand in designing people’s technology. We believe this lawsuit is wrong on the facts and the law, and we will vigorously defend against it.”\n\nThe case is part of President Joe Biden’s broader antitrust crackdown on Big Tech. The U.S. Justice Department is already suing Google for allegedly monopolizing digital advertising services, while the Federal Trade Commission has a long-running anti-monopoly case pending against Facebook parent Meta, as well as a more recent one against Amazon. And in December, the Federal Trade Commission sought to block Microsoft’s now-closed acquisition of game maker Activision.\n\nThe suit against Apple represents the third attempt by an attorney general to go after the Cupertino, California-based tech behemoth — but the first to challenge Apple on such a broad basis.\n\n“This clearly escalates the Biden Administration antitrust efforts against Big Tech giants and adds to the current ongoing antitrust case against Google and other various cases against Meta and Amazon,” Dan Ives, a managing director and senior equity research analyst at Wedbush Securities, said in an investor note.\n\nThe complaint goes on to allege that Apple’s monopoly also extends to web browsers, video communication, news subscriptions, entertainment, automotive services, advertising, location services and more.\n\n“For years, Apple responded to competitive threats by imposing a series of ‘Whac-A-Mole’ contractual rules and restrictions that have allowed Apple to extract higher prices from consumers, impose higher fees on developers and creators, and to throttle competitive alternatives from rival technologies,” said Assistant Attorney General Jonathan Kanter of the Justice Department’s Antitrust Division. “Today’s lawsuit seeks to hold Apple accountable and ensure it cannot deploy the same, unlawful playbook in other vital markets.”\n\nIn a statement, the Chamber of Progress, a trade group funded by tech companies like Apple, criticized the suit.\n\n“Consumers who buy iPhones like Apple’s highly curated mobile ecosystem,” said Chamber of Progress CEO Adam Kovacevich. “That’s not an antitrust violation, that’s why millions of people buy iPhones for security and ease of use. If DOJ forced Apple to open up its software and hardware, it would make iPhones more like Androids, depriving consumers of choice between two very different types of device.”\n\nEarlier this month, Apple was hit with a $2 billion fine by the European Union for restricting competition for music-streaming services in the app store. Apple said it would appeal.\n\nThe full lawsuit is below.",
    "title": "Apple sued by Biden administration over alleged iPhone 'monopoly power'",
    "date": "2024-03-21T16:30:00.000+02:00",
    "url": "https://www.nbcnews.com/business/business-news/apple-sued-doj-antitrust-monopoly-biden-rcna144424",
    "author": "Rob Wile"
}