{
    "text": "Charges were dropped against a Gold Star father arrested for heckling President Joe Biden during a State of the Union speech on March 7.\n\nAccording to National Review, Brian Schwalb, the Democrat attorney general in Washington, D.C., will not prosecute Steve Nikoui, the father of Lance Cpl. Kareem Nikoui, one of 13 U.S. Marines killed in the Abbey Gate bombing during the American withdrawal from Afghanistan in August 2021.\n\nSteve Nikoui attended the State of the Union as a guest of Rep. Brian Mast, R-Fla., and was arrested by Capitol Police for repeatedly shouting \"Abbey Gate\" and \"Second Battalion, First Marines!\" at Biden during the speech.\n\nNikoui, 51, was charged with crowding, obstructing, or incommoding Congress, a misdemeanor that is typically resolved after a $50 fine is paid.\n\nAfter writing a letter to Capitol Police calling for an end to the prosecution of the Gold Star father, Rep. Darrell Issa, R-Calif., took to social media Tuesday to announce that all charges against Nikoui were dropped.\n\n\"He did nothing wrong. And this is the right decision,\" Issa said in a post on X.\n\nAccording to Fox News, Nikoui was \"thrilled and humbled\" when Issa gave him the news.\n\nHouse Foreign Affairs Committee Chair Michael McCaul, R-Texas, posted a statement on X on Tuesday about the turn of events.\n\n\"I am glad the D.C. Attorney General dropped these ludicrous charges against Gold Star father Steve Nikoui after my hearing on President Biden's deadly Afghanistan withdrawal,\" McCaul said. \"The President has yet to apologize to families like Steve's who lost loved ones in the terrorist bombing at Abbey Gate. These families deserve justice, not prosecution and persecution.\"\n\nAccording to National Review, a number of Gold Star families attended the Foreign Affairs Committee hearing on Tuesday, which examined the Biden's administration's failures in withdrawing from Afghanistan and featured testimony from former Joint Chiefs Chairman Gen. Mark Milley and U.S. Central Command retired Gen. Frank McKenzie.\n\nNikoui previously said that it was \"devastating\" to hear Biden mention slain Georgia nursing student Laken Riley at the State of the Union, given the fact that the president has never mentioned his son and the others who were killed in Afghanistan.\n\n\"I was just strongly convicted by the Holy Spirit to stand up and say that after sitting there for almost an hour of just total disrespect to us,\" Nikoui said. \"He knew that there were other Gold Star family members. He could have at least just said their names and this would have been done.'\"",
    "title": "Gold Star Father Who Heckled Biden Won't Face Charges | Newsmax.com",
    "date": "2024-03-20T19:59:00.000+02:00",
    "url": "https://www.newsmax.com/newsfront/steve-nikoui-gold-star-families-sotu/2024/03/20/id/1157981",
    "author": "Nicole Wells"
}