{
    "text": "Hearing breaks down in chaos as witnesses throw accusations at each other\n\nWednesday's joint House Oversight and Judiciary Committee hearing investigating the Biden family finances broke down in chaos as two of the witnesses began lobbing accusations at each other.\n\nThe exchanged began after Rep. Matt Gaetz, R-Fla., slammed Democrats for inviting former Rudy Giuliani associate Lev Parnas as their witness, referencing his past criminal convictions, and asking GOP witness Tony Bobulinski for his reaction.\n\n\"I think it's laughable that the Democrats are asking Lev Parnas to weigh in on my credibility. A convicted felon, who served jail time. I have an impeccable record,\" Bobulinski said.\n\nBobulinski added that Parnas \"warned\" him earlier in the hearing that Democrats were coming after him, to which Parnas responded, \"I didn't warn you. I said just keep talking, you'll be there soon.\"\n\n\"I look forward to that, Mr. Parnas,\" Bobulinski responded.\n\n\"Keep lying, you'll be there soon,\" Parnas hit back.\n\nBobulinski then asked if that was \"a threat,\" to which Parnas answered, \"No, it's just the truth.\"\n\n\"Did you say they were coming for me?\" Bobulinski asked.\n\n\"No, I said if you keep lying, you will end up in prison,\" Parnas responded.\n\n\"I'm not lying. You're the one who is lying. You're the one that went to prison for lying,\" Bobulinski said.\n\n\"Tell me what I'm lying for, Mr. Bobulinski. You don't even know what you're talking for,\" Parnas said.\n\nThen two continued going back and forth until Parnas turned on Gaetz and criticized him for not asking him a direct question, to which Gaetz responded that he did ask him about his \"illegal business dealings\" earlier in the hearing.",
    "title": "Congress holds public hearing on Biden family business dealings, ex-Hunter Biden associates | Live Updates from Fox News Digital",
    "date": "2024-03-20T02:00:00.000+02:00",
    "url": "https://www.foxnews.com/live-news/joe-biden-gop-impeachment-inquiry-hearing-hunter-biden-business-dealings",
    "author": "Brandon Gillespie,Kyle Morris,Aubrie Spady,Matteo Cina,Julia Johnson,Liz Elkind,Brooke Singman,Cameron Cawthorne,Anders Hagstrom"
}