{
    "text": "Hunter Biden had access to then-VP Joe Biden’s Top Secret/SCIF-designated materials including national defense information related to US troop deployment while he was on vacation in Nantucket.\n\nVia Paul Sperry: China influence-peddling Hunter Biden had access to TOP SECRET/SCI materials including “nat’l defense information” –e.g. US troop deployment/movement– while on vacation in NANTUCKET with his then-VP father where he kept docs out in the open and received daily intel briefings\n\nBREAKING: China influence-peddling Hunter Biden had access to TOP SECRET/SCI materials including “nat’l defense information” –e.g. US troop deployment/movement– while on vacation in NANTUCKET with his then-VP father where he kept docs out in open and rec’d daily intel briefings — Paul Sperry (@paulsperry_) March 19, 2024\n\nLast year TGP reported that Hunter Biden likely received classified information from Joe Biden on Ukraine and then emailed the information to his business partner Devon Archer.\n\n\n\nDevon Archer (L) with Joe and Hunter Biden\n\nAccording to emails uncovered from the “Laptop from Hell,” Hunter Biden sent his business partner Devon Archer a very detailed email on Ukraine on April 13, 2014 – just one week before Joe Biden visited Ukraine to meet with then-Prime Minister Arseniy Yatsenyuk.\n\nIt appears Hunter Biden was emailing Devon Archer information he received from a briefing from his father Joe Biden or directly from top-secret documents.\n\n“A curiously well-informed email about Ukraine, Russia and the UK on Hunter Biden’s laptop is a thread that links the President’s classified documents scandal to the Delaware federal investigation into his son’s foreign business dealings.” – the New York Post’s Miranda Devine wrote.\n\nHere is a screenshot of Hunter Biden’s original 22-point Ukraine email cited in the column. Note the strategic detail. pic.twitter.com/kt6GNdQD85 — Miranda Devine (@mirandadevine) January 23, 2023\n\nJoe Biden STOLE SCIF-designated classified documents and improperly stored them at the Penn Biden Center, his Delaware garage, his Virginia rental home, and his lawyer’s Boston office.\n\nSome of the most highly sensitive documents were stored at Penn Biden Center in an unlocked office and closet.\n\nAccording to Special Counsel Robert Hur, Joe Biden kept more than 600 pages of classified documents in unlocked drawers/closets at the Penn Biden Center and stored some of them in dilapidated boxes in his Delaware garage and other unsecured locations where Hunter Biden could easily access them.\n\nThe FBI identified numerous folders, including many labeled “EYES ONLY VPOTUS” which contained highly classified material related to intelligence sources and methods.\n\n“Mr. Biden’s office did not lock,” Hur said in his 345-page report, “and the adjoining outer office where Mr. Biden’s executive assistant maintained his files was always accessible through Mr. Biden’s office.” In a footnote, Hur added that “the Vice President’s office could only be locked from the inside using a panic button.”\n\nVisitors from all walks of life, including dangerous actors from China and Ukraine had access to the classified documents stored at Penn Biden Center.\n\nThere was virtually no real security at the Penn Biden Center and in 2019 visitors no longer needed a key fob or security escort to access the floor where all of the stolen classified documents were stored, according to Hur’s report reviewed by this reporter.\n\nRobert Hur also couldn’t determine who had access to Biden’s unsecured classified documents because the Penn Biden Center’s security deleted all the visitor logs from 2017-2021.\n\nBiden was still not charged and none of his aides, handlers or gatekeepers were charged with obstruction or conspiracy (unlike Trump’s aides).",
    "title": "Report: Hunter Biden Had Access to Joe Biden's Top Secret/SCIF-Designated Materials Including National Defense Info Related to US Troop Deployment Cristina Laila",
    "date": "2024-03-20T15:00:00.000+02:00",
    "url": "https://www.thegatewaypundit.com/2024/03/hunter-biden-had-access-joe-bidens-top-secret/",
    "author": "Cristina Laila"
}