{
    "text": "Worried about having enough money to keep a roof over your head or even just put food on the table as prices continue to climb?\n\nBill Maher is here to tell you with the utmost confidence that your distress is all in your head.\n\nIn the latest episode of his long-running HBO series “Real Time with Bill Maher,” the comedian-commentator used his closing monologue — that night titled “Cheer Up” — to berate the millions of Americans he thinks don’t properly appreciate President Biden.\n\n“Why are Biden’s approval ratings so low when things are generally pretty good?” Maher inquired.\n\n“Now, of course there are problems: America is a big place. But wages are rising, unemployment is negligible, the stock market is soaring, we somehow brushed off both the Trump presidency and the pandemic.”\n\nAnd hey, you can see pictures of naked women pretty much whenever you want.\n\n“Yes, inflation persists for a lot of things, but an actual good, nice-sized TV now costs 60 bucks. Who gets credit for that? We’ve got next-day shipping, stuffed-crust pizza, legal weed, GPS and porn on the phone. Cheer the f–k up!” he scolded.\n\n“Stop acting like life in America in 2024 is unbearable. Biden’s ratings are in the toilet not because he’s doing such a bad job but because a lot of Americans like to live with their head in the toilet!”\n\nMaher occasionally likes to pretend he’s a man of the people since he tours Middle America on a private jet, but his comedy shows involve him speaking to an audience that he doesn’t have to listen to.\n\nHe doesn’t have to reconcile the struggle of the average American who hasn’t seen a raise in wages in years and dares not complain because his or her choice of employment is more limited than the seating on Maher’s private jet.\n\nIf he truly understood what’s going on, he wouldn’t think most Americans’ economic satisfaction is related to the stock market’s success — when the top 1% of earners holds ownership of 54% of the stocks, valuing more than $19 trillion.\n\nMaher minimizes the impact of inflation as a side dish to our economic woes when it’s really the main course.\n\nAnd it’s worse than the official numbers show.\n\nKeep up with today's most important news Stay up on the very latest with Evening Update. Thanks for signing up! Enter your email address Please provide a valid email address. By clicking above you agree to the Terms of Use and Privacy Policy. Never miss a story. Check out more newsletters\n\nStrategas Research Partners CEO Jason Trennert created the Common Man Consumer Price Index to measure inflation among a basket of necessities, taking out the luxuries included in the government’s CPI — in other words, it looks at the cost of things like food, shelter and energy and not those cheap TVs Maher trumpets.\n\nThe inflation burden under Biden has made the average working person’s standard of living deteriorate by around 7% since 2021, according to the Common Man CPI.\n\nMaher can’t comprehend how we in the middle class are not only being squeezed with the value theft of inflation, we’re being closed off from experiencing the American dream of homeownership and left behind with the nightmare of dramatically rising rent.\n\nMaher is effectively gaslighting people like me by telling us that our eyes are lying to us about what we are seeing becoming out of reach and he’s doing it to dramatize the supposed effectiveness of Biden.\n\nNone of this surprises me because Maher is the same man who hoped for a recession to occur during the last administration to guarantee Donald Trump wouldn’t get re-elected.\n\n“I feel like the bottom has to fall out at some point, and by the way, I’m hoping for it because I think one way you get rid of Trump is a crashing economy,” stated Maher.\n\n“So please, bring on the recession.”\n\nMaher doesn’t know what the bottom falling out looks like for people who barely have a savings account to lean on, but I’ve experienced it firsthand.\n\nYou can’t quite follow Maher’s prescription of simply “cheering up” when you don’t have a home to call yours and need to take handouts just to eat, like I did.\n\nBiden may not be responsible for every economic situation in America, but pretending our troubles aren’t real from the comfort of a California mansion is the epitome of elitism.\n\nBroadcasting a dismissive message on HBO — and soon CNN, which will start airing show replays — about how we should feel grateful because we have stuffed-crust pizza and porn on our phones is the modern-day “Let them eat cake,” and that’s not what we’re hungry for.\n\nMaher is among many men who enjoy the sunshine from the top of their ivory tower and can’t comprehend our complaints about living in the darkness of their structure’s shadow: Old habits die hard.\n\nAdam B. Coleman is the author of “Black Victim to Black Victor” and founder of Wrong Speak Publishing. Follow him on Substack: adambcoleman.substack.com.",
    "title": "Bill Maher scolds Americans struggling with inflation as he praises Biden from his private jet",
    "date": "2024-03-21T10:12:00.000+02:00",
    "url": "https://nypost.com/2024/03/19/opinion/bill-maher-scolds-americans-struggling-with-inflation-as-he-praises-biden-from-his-private-jet",
    "author": "nypost.com"
}