{
    "text": "Senate Majority Leader Chuck Schumer of N.Y., speaks during a news conference on Capitol Hill, Wednesday, Jan. 25, 2023, in Washington.\n\nSenate Majority Leader Chuck Schumer, D-N.Y., set off a firestorm of his own making last week as he decided to intervene in Israeli politics by telling Israel to abandon its leader right in the middle of sensitive negotiations with Hamas.\n\nI don’t think Schumer will do that again. He heard from pretty much the world and it’s clear that Schumer is out of touch with Israel or he would have known that telling Israelis what to do is likely to produce the opposite result.\n\nIsraeli Prime Minister Benjamin Netanyahu fired right back, calling it inappropriate to tell an ally and a democracy when they should hold elections and who they should vote for, especially during a war. Israel is the only democracy within the region which otherwise features everything from monarchies, theocracies, Putin puppets, and terrorist regimes. In fact, 72% in the February Economist/YouGov poll see Israel as an ally and friend, while most Americans (57%) see “Palestine” as an enemy and unfriendly.\n\nSCHUMER CALLS FOR NEW ISRAELI LEADER TO REPLACE NETANYAHU IN SENATE FLOOR SPEECH\n\nAre Schumer and Biden genuinely motivated by the conditions in war-torn Gaza or by the politics of Michigan? There are two million people in Gaza dislocated by the heinous attacks of October 7th and the resulting war to eliminate Hamas. There are 11 million people in Haiti now suddenly thrown into riotous gang rule – yet not much of a word about them nor boatloads of aid going to them. The answer is obvious – politics.\n\nSchumer appeared to be looking to throw a bone to the left wing of the party that, for reasons of intersectional identity, now supports a movement that subjugates women and allows honor killings of gays and lesbians.\n\nREAD ON THE FOX NEWS APP\n\nBy about 82 to 18 Americans support Israel over Hamas in this conflict and nearly two-thirds believe that any ceasefire should occur only after Hamas releases the hostages, according to the latest Harvard CAPS Harris poll. Other polls tend to incorrectly frame the conflict as between the Israeli and Palestinian peoples and even framed in this odd way, Americans support Israelis generally by about 3 to 1.\n\nKIRBY DODGES ANSWERING POINT-BLANK IF BIDEN BELIEVES NETANYAHU IMPEDES PEACE: ‘KNOWN EACH OTHER A LONG TIME’\n\nOf course, Americans support the well-being of the Palestinian people and support aid to those in Gaza. But no one would have framed World War II as whether you supported the British people or the German people. It was about Hitler – and this conflict is about Hamas, a terrorist group that captured, and is still holding, American citizens among its hostages today.\n\nThe administration agrees Hamas is an evil group but seems to have somehow bought into the idea that Netanyahu is at fault, as though any other country would do something different after an event on the scale of Pearl Harbor, which killed 68 civilians, or 9/11, which killed 3,000 civilians in a country of over 300 million.\n\nSCHUMER TRASHED FOR ‘DISGUSTING’ SPEECH CALLING ON ISRAEL TO DUMP NETANYAHU: ‘OUTRAGEOUSLY INAPPROPRIATE’\n\nThe danger in the politics of what Schumer and Biden are doing is that it emboldens Hamas and actually complicates arriving at any kind of peace. If Biden had remained steadfast in his support for Israel and put the blame on Hamas for creating a tunnel city intertwined with civilian life instead of singling out Netanyahu, Hamas would be fearing extinction and would be much more likely to send out the hostages. By blasting the Israeli prime minister for policies supported by the vast majority of Israelis, he is instead signaling to Hamas to hold out and not to worry. Help is on the way. Whether they intended to or not, that is the result of what they have done.\n\nCLICK HERE FOR MORE FOX NEWS OPINION\n\nAnd they are not really helping themselves politically either. The truth is that the electorate is about 2% Jewish and less than 2% Muslim and when asked to name the most important issue, 2% named the Israel-Hamas policy.\n\nIn Michigan, 100,000 votes for uncommitted is a small fraction of the 10 million people there and just how likely are they to help elect Donald Trump? And the more Biden has waffled on Israel, the lower his Israel approval ratings have sunk.\n\nThere is no genocide, no apartheid or anything like it. Jews are a diverse people and of the 9 million Israelis, 20% are Arab and 5% other minorities. In fact, The Economist/You Gov polls show that 58% believe it is Hamas that is committing genocide against the Jews and not Israel.\n\nSchumer put his foot in his mouth in so many ways in attacking Netanyahu. He should stick to commenting on American politics, which is not in great shape right now. And the pressure should be one hundred percent on the leadership of Hamas, which killed Americans and is holding American hostages, to release them now or face extinction.\n\nPlaying domestic politics with the issue will only backfire.\n\nCLICK HERE FOR MORE FROM MARK PENN\n\nOriginal article source: Schumer taught Democrats and Biden a powerful lesson\n\nNews Related",
    "title": "Schumer taught Democrats and Biden a powerful lesson",
    "date": "2024-03-21T20:10:00.000+02:00",
    "url": "https://newsexplorer.net/schumer-taught-democrats-and-biden-a-powerful-lesson-s2005601.html",
    "author": "VNExplorer"
}