{
    "text": "Every March, in celebration of National Women’s History Month, the Department of State issues its “Women of Courage” award. This award is given to women around the world who have advanced the cause of peace, justice, and human rights—often at great personal cost. This year, one name was glaringly absent from the list: Venezuela’s Maria Corina Machado. Machado is not only leading the charge against Nicolás Maduro’s dictatorship in Venezuela but also facing down the Biden administration’s push to yet again appease the dictatorship at the expense of our democratic allies.\n\nDespite heavy-handed repression and the regime’s control over electoral institutions, the Venezuelan opposition organized a decisive primary election in October 2023. Machado received an overwhelming mandate with 93 percent of the vote. Poll after poll in Venezuela shows widespread dissatisfaction with Maduro—upwards of 80 percent. Such figures indicate that even the most egregious attempts to steal the election likely won’t turn the tide.\n\nMaduro knows he does not stand a chance against her and is rightfully afraid of an open and competitive process. Despite her overwhelming victory in the primaries—or likely because of it—the regime-controlled Venezuelan Supreme Court has upheld an unconstitutional ban on Machado’s ability to hold office. The regime has also imprisoned her allies and staff. However, the state is not targeting her alone. In the last few months, we’ve seen extraordinary escalations in Venezuela, including the arrest and detention of human rights activist Rocio San Miguel, the legislative attempt to criminalize civil society, the murder of a Venezuelan dissident by Maduro-led gangs in Chile, the threat of a military invasion of Guyana, and the expulsion of the UN High Commissioner for Human Rights and her team. Over the years, the commissioner has diligently documented the extent of torture, arbitrary detention, extrajudicial killings, and other human rights abuses that have forced over 7.7 million Venezuelans out of their country—over 240,000 of whom illegally entered the United States last year alone.\n\nYet instead of holding the regime accountable for these actions, the White House has bizarrely relieved sanctions, providing the regime with additional resources for their human rights violations. They’ve politely asked for the regime to “define a process” to reinstate Machado and other ineligible candidates but have exerted minimal pressure as Venezuela slides further and further into totalitarianism. With the regime announcing a 2024 Presidential election on July 28, there are whispers that the White House will lean on Machado to step down from her candidacy in favor of an opposition leader more palatable to Maduro and his cronies. This translates to a candidate that the regime can defeat.\n\nLet’s call this what it is: Yankee imperialism. It’s a term the left loves to throw around but rarely admits its practices. What other phrase describes a global power telling a small, persecuted opposition movement that their attempts at democracy are cute but that Washington would prefer to call the shots there? Even worse than that, it is imperialism in favor of dictatorship—a capitulation to Maduro, a man whose greatest success prior to stealing the presidency of Venezuela was driving a bus—and letting him decide who he runs against. Those are not the actions of a country that won two world wars against global tyranny. We would never allow a candidate to determine his presidential opponent in the United States—we should not accept it in Venezuela, either.\n\nAt one point, the United States once stood shoulder-to-shoulder with the Venezuelan opposition. Sadly, they now stand alone in their fight for freedom thanks to the Biden administration’s failed policy of appeasement. Despite being abandoned, however, they remain undeterred. Venezuelans mobilized a primary candidate that garnered over 2.4 million votes. They organize daily both within the country and outside, drawing much-needed international attention to their suffering. In the opposition, we see an echo of the Venezuela that was once the most educated and wealthiest nation in South America. In them, we see an echo of the Venezuela that was a model for democracy in the region. But more importantly, in them—and Maria Corina Machado—we do not just see an echo of the past. We see a symbol of the future.\n\nThe Biden administration claims it rewards women with courage. Why, then, do we see them trying to penalize one in Maria Corina Machado?\n\nCarrie Filipetti is the Executive Director of The Vandenberg Coalition and the former Deputy Assistant Secretary and Deputy Special Representative for Venezuela in the Trump administration.\n\nImage: Shutterstock.com.",
    "title": "Joe Biden Should Not Abandon Maria Corina Machado",
    "date": "2024-03-20T18:46:00.000+02:00",
    "url": "https://nationalinterest.org/feature/joe-biden-should-not-abandon-maria-corina-machado-210131",
    "author": "Carrie Filipetti"
}