{
    "text": "In perhaps the least surprising news of the year, Vladimir Putin has triumphed at the Russian ballot box and been enthroned for the fifth time as president. He will serve for six more years.\n\nHe will be 77 years old in 2030. According to the constitution, which he re-wrote to his benefit in 2020, he then could stand again for a further six-year term.\n\nAcademic rigour, journalistic flair\n\nTHE CONVERSATION....\n\nBULLSHIT WITH RIGOUR AND JOURNALISTIC BIAS... CAPS ARE COMMENTS BY GUS....\n\nThe West can’t ‘solve’ its Russia problem. Here’s how it should handle 6 more years of Vladimir Putin\n\nTHE WEST DOES NOT HAVE A RUSSIA PROBLEM... RUSSIA HAS A WEST PROBLEM: THE WEST HAS BEEN DECEITFUL, WARMONGERING — AND SECRETLY WANTS TO DESTROY RUSSIA.\n\nBY Peter Tesch\n\nWHY NOT 6 MORE YEARS OF PRESIDENT PUTIN?\n\nTo put that in perspective, Putin already has ruled Russia as president or prime minister for 24 years, or the equivalent of eight Australian parliamentary terms. In that period, Australia has had eight prime ministers and changed governing party three times. The United States has had five different presidents; the United Kingdom seven different prime ministers.\n\nIn contrast to elections in the West, where the outcomes are genuinely in the hands of the voters [AHAHAHA] and adjudicated by independent electoral commissions, Russia is different. As the former UK ambassador to Moscow, Laurie Bristow, wrote:\n\nIn Russia, the purpose of elections is to validate the decisions of its rulers, not to discover the will of the people.\n\nIN THE WEST, THE PURPOSE OF ELECTIONS IS TO DECEIVE THE PEOPLE INTO BELIEVING THEY HAVE A CHOICE BETWEEN \"TWEEDUMDLE AND TWEEDUMDEE\"… WHILE THE PENTAGON IS RULING THE ROOST…\n\nPETER TESCH CONTINUES:\n\nPutin’s jaded view of the West\n\nPutin now will appoint a new government. His picks will be intensely scrutinised for clues to a succession plan and future policies. Although he is a master of surprise, we should not count on Putin leaving any time soon. Only four leaders of modern Russia and the USSR have left the top job alive; the rest have died in office of natural or other causes. SO?\n\nMoreover, Putin’s actions over the past two years have been directed at moving Russia from authoritarianism to semi-totalitarianism. The Carnegie Endowment’s Andrei Kolesnikov has written persuasively of these tectonic shifts that recall the darkest years of Soviet Stalinism.\n\nPutin has explicitly presented his war of choice in Ukraine as a proxy for a wider, long-term conflict with the West. He believes the West is irresolute, in decline, and easily distracted and deflected. PUTIN IS TOTALLY CORRECT.\n\nFormer US President Donald Trump’s “have at them” attitude towards US allies and partners, and the woeful Western vacillation over further military aid to Ukraine, will only embolden Putin further. Buoyed by his ritual success in this weekend’s election, he will embark on further risky and provocative adventurism. HE WON’T. PUTIN DOES NOT WANT MORE TROUBLES. THE WEST DOES.\n\nRead more: What can we expect from six more years of Vladimir Putin? An increasingly weak and dysfunctional Russia\n\nBULLSHIT. WEAK AND DYSFUNCTIONAL? THE WEST IS IN A FAR MORE WEAK AND DYSFUNCTIONAL SITUATION.\n\nConsequently, Putin – and the ideology of “Putinism” – pose a serious challenge for Western governments and policymakers who are genuinely accountable to their electorates, [DO YOU THINK VON DER LEYEN, THIS UNELECTED WITCH OF EUROPE IS ACCOUNTABLE?] the party room, the parliamentary opposition, a vocal and inquisitorial media [DO YOU THINK THE WESTERN MEDIA ASKS QUESTIONS OF ITS OWN RULERS?]and an independent judiciary [LIKE THE INQUISITION AGAINST TRUMP IN THE USA?].\n\nAs exiled Russian journalist Mikhail Zygar has argued, part of Putin’s statecraft is directed at making common cause with ultra-conservative Western political elements to contest global “wokeness”, demobilise support for [NAZI] Ukraine, and dull resistance to Russian territorial ambitions in its neighbourhood. PUTIN ONY HAS TERRITORIAL “AMBITIONS” TO TERRITORIES THAT WERE UNDER RUSSIAN CONTROL AND POPULATED BY RUSSIANS WHO BEG TO REJOIN RUSSIA… FAIR ENOUGH.\n\nHow democratic governments need to respond\n\nPutin is well aware that the inherent fractiousness of democracy and the need to court the fickle voters hobbles democratic governments’ long-term planning. THE WEST IS AS DEMOCRATIC AS A DUNNY IS USEFUL ON THE MOON.\n\nMoreover, our political culture is predisposed to wanting to “solve” issues. MOST OF THE TIMES, THE WEST DOES NOT SOLVE ANYTHING BUT CREATES MORE PROBLEMS. Sometimes, though, problems of the scale posed by Russia or the Middle East can only be managed, not solved – and then only through joint efforts with like-minded allies and partners. That requires persistence and resilience to rise above short-term politicking and the twitches of our “instant expert” social media culture. YES WE ARE EXPEDIENT AND BULLSHIT ABOUT OUR ABILITY OF “EXPERTISE”….\n\nIt also demands constant investment in building and sustaining public understanding of what really is at stake, beyond the borders of Europe that were drawn in the bloodshed and misery of the second world war. DOES THIS MEANS THAT THE WEST NEED TO TUNE THE STUPID PROPAGANDA TO 11? UKRAINE WAS ARTIFICIALLY DRAWN BY THE USSR...\n\nThis is difficult anywhere, not least in the West, where we have had it comparatively easy for most of the post-second world war era. [DID WE HAVE GOOD LEADERS THEN?] We need stalwart and principled leadership now more than at any other point in the last 50 years. Most of all, we need ongoing serious and informed public conversations [YES! WE LITTLE BOURGEOIS ENJOY THE SPOILS OF FOREVER WARS] about what we value in and wish for in democratic societies, and the price we are willing to pay to attain and preserve that. WE DO NOT HAVE TO PAY FOR OUR VALUES, BUT ACCEPT THAT RUSSIA HAS ITS OWN VALUES AND DOES NOT WANT TO TAKE OVER OTHER LANDS — EXCEPT THE DONBASS REGION, AS WARNED BY PUTIN SINCE AT LEAST SINCE 2008, TO PREVENT NATO ILLEGALLY “INVADING” UKRAINE.\n\nRead more: Why the US and its partners cannot afford to go soft on support for Ukraine now\n\nBULLSHIT. MAKING A PROPER DEAL ISN’T GOING SOFT, BUT RECOGNISING THAT UKRAINE 1991 IS NOT AN INTEGRAL COUNTRY… THE DONBASS WAS RUSSIAN AND IS NOW BECOMING RUSSIAN AGAIN.\n\nThat sort of discourse can be hard to generate in our politically rather apathetic society. However, it is vital when the institutions of our democracy are barraged by foreign information manipulation and interference designed to sow doubt and distrust and corrode popular faith in the integrity of our form of government. WE BULLSHIT FAR MORE THAN THE RUSSIANS WHO HAVE STUCK TO THE NARRATIVE SINCE AT LEAST 2014 IN REGARD TO UKRAINE.\n\nEspecially in Australia, we have allowed our already limited pool of Russia expertise to atrophy to near-extinction. It is well past time to re-invest, modestly but purposefully, in Russian language and associated studies at our universities. We need to boost “Russia literacy” and comprehension of a country that will remain a significant and disruptive player in the world. This matters to countries that matter to us. GREAT IDEA! YOU NEVER KNOW, WE MIGHT EVEN UNDERSTAND RUSSIA LIKE SCOTT RITTER DOES….\n\nWe should also honestly and critically assess the mistaken assumptions and indifference that at times have undermined effective Western policies towards post-Soviet Russia. However, we should not succumb to the propaganda peddled by Putin and his proteges abroad that Moscow is a blameless victim of Western perfidy and deception aimed at destroying the Russian state. THE WESTERN PERFIDY CANNOT BE GAUGED BY THE WEST, BECAUSE IT ORIGINATES FROM THE WEST.\n\nRather, as Australian professor Mark Edele writes in his recent book, Russia’s War Against Ukraine:\n\nRussia never came to terms – either as a society or as a polity – with its transformation from a continental empire with global reach into a nation-state and a regional power. professor Mark Edele WROTE SHIT. The Kremlin is marketing Russia as an ally of “the Global South” in resisting resurgent neo-colonialism and championing “multipolarity”.\n\nWE HATE MULTIPOLARITY IN THE WEST BECAUSE IT CHALLENGES OUR GOD-GIVEN RIGHT TO DOMINATE (COLONISE) THE WORLD WITH AN ENGLISH/AMERICAN/JEWISH HEGEMONY…\n\nThe Putin thesis is that Ukraine is a patsy of London and Washington, while Moscow is on the side of the formerly colonised. PUTIN IS CORRECT: WASHINGTON HAS CULTIVATED UKRAINE TO WEAKEN RUSSIA (THE AMERICAN ADMINISTRATION OWN WORDS). That argument is finding some ready ears, evident in the patchy support for sanctions on Russia [IT’S NOT PATCHY — OUT OF 190 COUNTRIES OR SO IN THE WORLD, ONLY 15 OR SO ARE IN FAVOUR OF SANCTIONS,. We cannot assume our own Indo-Pacific region is persuaded of the wrongness of the Kremlin’s claims. THE KREMLIN’S CLAIMS ARE CORRECT.\n\nThe reality confronting us is that of a sullen and resentful Russia [NO, NOT SULLEN NOR RESENTFUL, — BUT CONFIDENT AND POSITIVE], convinced that history, morality and even divinity is on its side in a de facto existential war with the West. RUSSIA DOES NOT WANT WAR WITH THE WEST. RUSSIA HAS WANTED TO COOPERATE WITH THE WEST, BUT THE WEST REJECTED RUSSIA…\n\nMoreover, as Bristow, my former colleague in Moscow, has written:\n\nwe would be unwise to assume that a rising generation of Russians will embrace a more democratic and pro-Western outlook.\n\nPRO-WESTERN OUTLOOK MEANS BUM-FIGHTS, RAMPANT ECONOMIC DOWNGRADE, SILLY LIES FROM ONE OR THE OTHER POLITICAL PARTIES, CORRUPTION WORSE THAN IN UKRAINE AND DELUSIONS OF GRANDEURS LONG VANISHED. NAPOLEON IS DEAD.\n\nYet, we must not turn away from those Russians – far from an irrelevant minority – who do not share Putin’s view that the future of their country lies in the perceived glories of its past. The challenge is to articulate what a better future would look like for Russia, beyond confrontation, and to keep that alternative clearly in view.\n\nDO YOU MEAN THAT THE WEST SHOULD POLITICALLY INTERFERE INSIDE RUSSIA? WOW!!!!!!\n\nPACK YOUR BAG, “THE CONVERSATION”….\n\nhttps://theconversation.com/the-west-cant-solve-its-russia-problem-heres-how-it-should-handle-6-more-years-of-vladimir-putin-225999\n\nFREE JULIAN ASSANGE NOW....",
    "title": "how old is biden again? how insane and senile is biden again?....",
    "date": "2024-03-20T10:27:00.000+02:00",
    "url": "https://yourdemocracy.net/drupal/node/50455",
    "author": "Peter Tesch"
}