{
    "text": "President Biden’s reelection campaign is eyeing North Carolina as a state to flip in 2024, a place where former President Trump barely eked out a win the last time the two went head-to-head.\n\nWhile the Biden campaign acknowledges it will “take relentless effort” to reach every voter it can by November, the Tar Heel State is seen as an opportunity, especially given a gubernatorial race that could boost Biden.\n\nBut strategists question how feasible that goal is, given the state hasn’t gone to a Democrat since 2008 and went to Trump in his last two White House bids.\n\n“It’s still aspirational, but the state is definitely in play,” said GOP strategist Doug Heye. “Trump should win it. If I were betting on it, I would bet Trump would win.”\n\nNorth Carolina is part of the Biden campaign’s pathway-to-270 strategy through critical swing states, which include the so-called blue wall made up of Michigan, Pennsylvania and Wisconsin; western battlegrounds including Nevada and Arizona; and southern states such as Georgia and North Carolina.\n\nNorth Carolina is included as part of a $30 million six-week advertising blitz the campaign announced after the State of the Union address to spend big in battleground states. Biden recently did radio interviews around Super Tuesday in Fayetteville and Charlotte to reach Black North Carolinians, one of several voting factions key to another victory.\n\nBiden and Vice President Harris will travel to North Carolina on March 26 as part of their effort to travel to every battleground state in March.\n\n“North Carolinians know that while President Biden is fighting for us, Donald Trump is fighting for billionaires, corporations, and an extreme agenda that hurts our families and our economy,” Biden campaign’s North Carolina communications director Dory MacMillan told The Hill. “Our campaign will continue to communicate across every corner of this state to reject Trump’s attacks on our families and earn four more years of progress with President Biden.”\n\nThe campaign currently has a $155 million war chest, but aside from spending and infrastructure, a major factor that strategists say can help Biden in the Tar Heel State is the governor’s race, which includes far-right Lt. Gov. Mark Robinson on the ballot.\n\n“Given the very weak Republican gubernatorial candidate in North Carolina and a very sophisticated operation from the Democratic candidate, the Biden team will have an even better opportunity to win there this time around because of the demographic shifts and a robust coordinated campaign in a state he barely lost,” said Michael LaRosa, first lady Jill Biden’s traveling press secretary during the 2020 campaign.\n\nMike Lonergan, the communications director for Mark Robinson for Governor, criticized Biden and Robinson’s Democratic opponent Josh Stein in a statement to The Hill, saying Stein “stands with President Biden’s open-borders policies and would turn North Carolina into a sanctuary state for illegal immigrants; and he’s backed by far-left radicals that want to defund the police.”\n\nThe statement continued, “The Democrats will stop at nothing to smear Mark Robinson because they know North Carolina voters have had enough of extremism and lies from career politicians like Joe Biden and Josh Stein.”\n\nTrump barely beat Biden in North Carolina last time around by less than 1 percentage point. The last Democrat to win the state in a presidential contest was then-Democratic nominee Barack Obama, but he lost his reelection bid there to 2012 GOP nominee Mitt Romney by 2 percentage points. Trump won the state when he ran for the White House the first time in 2016, beating Hillary Clinton by nearly 4 points.\n\nAn aggregation of polls shows Trump with a 7.4 point lead over Biden in North Carolina, a wider lead than the former president has managed in other battleground states.\n\n2024 could prove to be a split-ticket situation in North Carolina, where Democratic gubernatorial nominee Josh Stein wins while Trump takes the state, considering that when Trump won the state in 2020, Democratic Gov. Roy Cooper was reelected to a second term.\n\nThe GOP nominee for superintendent, who would oversee the public schools in North Carolina, is also troubling to some moderate Republicans. Social media posts have emerged of Michele Morrow calling for former President Obama to be publicly executed, CNN reported.\n\nGiven the slate of Republican candidates, Democrats believe pouring efforts into North Carolina is a good idea.\n\n“It’s a smart bet,” said Ivan Zapien, former official at the Democratic National Committee. “The Republicans have nominated some down-ballot candidates that are not going to do well in the suburbs, assuming the suburbs perform like they have been performing [in] the last cycles. It’s ripe for a pickup.”\n\nStill, Democrats acknowledge it’s an uphill battle.\n\n“North Carolina is ripe to flip, but it’s still North Carolina,” LaRosa said.\n\nRepublicans like Heye, a North Carolina native, say the state’s not a forgone conclusion given its demographic developments.\n\n“There’s an outside chance that the Democrats take it because of the closeness of the state, because of the fast growth in the state, particularly in two parts — Charlotte and Raleigh and their suburban areas,” he said.\n\nGrowth in areas like Charlotte and Raleigh has comprised an uptick in young, professional, suburban women, who helped give Democrats better-than-expected results in 2022 after the Supreme Court overturned Roe v. Wade.\n\nBlack voters are also a pivotal voting bloc in North Carolina, which is home to 11 historically Black colleges and universities.\n\nJim Kessler, executive vice president for policy at Third Way, compared North Carolina to Georgia, a state that helped push Biden over the edge in 2020 in large part because of support from Black voters.\n\n“They each have a growing share of college-educated voters that have become essential for Democrats. Georgia has more African American voters, which proved to be the difference in 2020, but North Carolina is starting to look like the kind of state where Democrats should prevail,” he said.\n\nThis story was updated at 8:57 p.m.\n\nFOLLOW US ON GOOGLE NEWS\n\nRead original article here",
    "title": "Biden campaign sets sights on flipping North Carolina in 2024 - TodaysChronic",
    "date": "2024-03-21T09:31:00.000+02:00",
    "url": "https://todayschronic.com/biden-campaign-sets-sights-on-flipping-north-carolina-in-2024",
    "author": "Valentin Shriner"
}