{
    "text": "While the anger was a bit misplaced, one can easily understand why liberals were furious that the now-deceased Supreme Court Justice Ruth Bader Ginsburg didn’t step down before the 2014 midterm elections.\n\nAfter all, the writing was on the wall. In the sixth year of Barack Obama in the White House, Americans had gotten fed up with the Democrats and the Senate was poised to change hands. If Republicans were to take control of the Senate, they would stall any nominee the then-president chose to fill a vacancy on the court.\n\nGinsburg was 81 at the time and had battled cancer. She was the liberal-appointed justice most likely to fall to tragedy, speaking in purely actuarial terms. In fact, she had made it to the age of 87 when she died in 2020.\n\nThat was when then-President Donald Trump nominated Amy Coney Barrett to replace her and she was confirmed by a GOP-controlled Senate.\n\nThe same can’t be said for Merrick Garland, of course. In 2016, he was the man Obama was nominated to the court after the death of Justice Antonin Scalia in February of that year.\n\nGiven that the Republicans controlled the Senate, they were in no mood to confirm one of the administration’s justices, particularly in an election year, and then-Majority Leader Mitch McConnell declined to even give Garland a hearing. (Garland’s nakedly partisan contempt for the rule of law as attorney general of the United States under President Joe Biden has revealed this course of action to have been a wise one.)\n\nHowever, the Democrats still have control of the White House and Senate. Whether that lasts is anyone’s guess; Trump leads Biden in the polls and outlook for the upper chamber isn’t superb for the Democrats even if they’re able to keep control of 1600 Pennsylvania.\n\nThat’s why generally lib-friendly writer Josh Barro — a politics and economics journo who tends to be very Biden-supportive on his Substack, even if he mostly remains nominally neutral — thinks it’s high time the Dems pressured Sonia Sotomayor to retire.\n\nWait, you might be saying — isn’t Sotomayor young, by the standards of the gerontocracy in Washington? At age 69, yes she is, even if she is (as Barro noted) “a diabetic who has in some instances traveled with a medic.” However, in a Substack post excerpted by lefty rag The Atlantic on Monday, Barro called out liberal “cowardice in speaking up about Sotomayor” and her age.\n\nIn 2006, Barro wrote, Scalia was 70 years old with 20 years of service on the court behind him. If he had retired then, then-President George W. Bush could nominate his replacement for confirmation by a Republican-controlled Senate. That would have kept Scalia’s seat on the court safely in conservative hands, potentially for decades.\n\nBarro asked readers to “imagine for a moment that Hillary Clinton had won the 2016 election, as many expected.”\n\n“By running a few points stronger, she might have taken Democratic candidates across the finish line in close races in Pennsylvania and Missouri, resulting in Democratic control of the Senate,” he wrote.\n\n“In that scenario, Clinton would have named a liberal successor to Scalia — more liberal than Garland — and conservatives would have lost control of the Court, all because of Scalia’s failure to retire at the opportune moment.”\n\nThis, mind you, is a scenario liberals believe they deserve anyway — and have been willing to back court-packing and similar schemes in order to achieve it. It didn’t happen, and any scenario that involves keeping Missouri blue given the red drift in that state is a bit ludicrous. Nevertheless, Barro noted that Sotomayor is the oldest of the three liberal-appointed justices.\n\n“Justice Sonia Sotomayor will turn 70 in June. If she retires this year, President Joe Biden will nominate a young and reliably liberal judge to replace her,” Barro wrote.\n\n“Republicans do not control the Senate floor and cannot force the seat to be held open like they did when Scalia died. Confirmation of the new justice will be a slam dunk, and liberals will have successfully shored up one of their seats on the Court — playing the kind of defense that is smart and prudent when your only hope of controlling the Court again relies on both the timing of the death or retirement of conservative judges and not losing your grip on the three seats you already hold.”\n\nAnd, if she doesn’t retire this year, Barro wrote, “we don’t know when she will next be able to retire with a likely liberal replacement.”\n\n“It’s possible that Democrats will retain the presidency and the Senate in this year’s elections, in which case the insurance created by a Sotomayor retirement won’t have been necessary,” he wrote. “But if Democrats lose the presidency or the Senate this fall—or both—she’ll need to stay on the bench until the party once again controls them. That could be just a few years, or it could be longer.\n\n“Democrats have previously had to wait as long as 14 years (1995 to 2009). In other words, if Sotomayor doesn’t retire this year, she’ll be making a bet that she will remain fit to serve until possibly age 78 or even 82 or 84 — and she’ll be forcing the whole Democratic Party to make that high-stakes bet with her.”\n\nYet, Democrats have reportedly been on the fence about replacing her with a younger justice because she’s the first Latina woman on the court.\n\n“This is incredibly gutless,” Barro wrote. “You’re worried about putting control of the Court completely out of reach for more than a generation, but because she is Latina, you can’t hurry along an official who’s putting your entire policy project at risk? If this is how the Democratic Party operates, it deserves to lose.” [Emphasis his.]\n\nHe called this “part of a broader insanity in the way that the Democratic Party thinks about diversity and representation” — which isn’t necessarily a lie, but that’s part of a much broader problem in American liberalism than he lets on.\n\n“Representation is supposed to be important because the presence of different sorts of people in positions of power helps ensure that the interests and preferences of various communities are taken into account when making policy. But in practice, Democratic Party actions regarding diversity tend to be taken for the benefit of officials rather than demographic groups,” Barro wrote. (Emphasis his. And by the way, duh.)\n\n“What’s more important for ordinary Latina women who support Democrats — that there not be one more vote against abortion rights on the Supreme Court, or that Sotomayor is personally there to write dissenting opinions? The answer is obvious, unless you work in Democratic politics for a living, in which case it apparently becomes a difficult call.”\n\nThis should be a difficult call for a number of different reasons, albeit not the identitarian ones Barro says the Democrats are falling prey to. The biggest one is this: While justices on the Supreme Court have, in the past, skewed one way or another in terms of ideology depending on who nominated them, it’s still supposed to be the one non-political branch of the federal government.\n\nWhile the politicization of the Supreme Court has taken many faces, both Democrat and Republican,a milestone was reached during the Obama years, when the then-president set a precedent by lecturing the Supreme Court on campaign finance law during the 2010 State of the Union. President Biden continued that tradition 14 years later, though only six of nine justices were there to hear it.\n\nSonia Sotomayor is mostly healthy and, by the standards of Washington, D.C., young. But, if having someone in her late 60s on the bench is too problematic for the Democrats, why stop there?\n\nElena Kagan, Obama’s other appointee, is 63. Replace them both with fresh Harvard Law grads, I say, preferably those who skipped a few years back in high school. Make sure they haven’t taken a gap year, of course, and have passed rigorous physicals. Check their family history for longevity, as well. Make sure that they’ve got great-grandparents in their 90s still alive and kicking. Not that it matters, because they’ll probably be asked to retire before the odometer hits the big 7-0, but you can never be too careful.\n\nI’m not saying that Sotomayor is some kind of genius jurist who cannot be replaced, but Barro’s reductio ad absurdum thought experiment demonstrates the issue with this.\n\nIt’s bad enough that leftists are infuriated with the current Supreme Court majority simply because it follows the Constitution as written and not as a rubber stamp for social policy that fails at the legislative level. (Cough cough Roe v. Wade cough.)\n\nThey now want to disabuse whatever trust conservatives and independents might have in the court by just sewing up seats via trading out justices for other younger nominees.\n\nMoreover, if the nine men and women on the Supreme Court bench can easily be replaced by less-experienced lawyers simply for perceived actuarial benefits, it’s essentially starting a political arms race to the bottom when it comes to judicial experience on the highest court in the land. Oh, you found a 45-year-old to replace Sonia Sotomayor? Well, here’s a 35-year-old to replace Clarence Thomas! And a 29-year-old to take over for Alito! These would be people selected for their potential longevity, not on merit. If you want a surefire way to ruin the court, this is it.\n\nAnd, yes, Barro realizes the irony here: “One obvious response to this argument is that the president is also old — much older, indeed, than Sonia Sotomayor,” he wrote. “I am aware, and I consider this to be a serious problem. But Democrats are unlikely to find a way to replace Biden with a younger candidate who enhances their odds of winning the election.”\n\nNor are they likely to find a way to replace Sotomayor that doesn’t boil down to electoral cynicism. Sotomayor is a decade younger than Biden, still in relative good health and — this is the important thing — in compos mentis. If there’s any way to seal the deal for Republicans who are Trump-averse to vote the GOP ticket this November, pressuring her not to pull an RBG (who was a decade olderand cancer survivor when there were calls for her to step aside in 2014) is pretty much it.\n\nThen again, maybe Barro is saying the quiet part out loud: The establishment media thinks Trump and the GOP may not even need something like that to win.\n\nAfter all, he’s not the only one talking about Sotomayor’s seat, as an article last week in Bloomberg Law pointed out.\n\nWhen The Atlantic is sounding the alarm so blatantly, there’s a reason. The left is panicking and desperate to shove a minority woman off the court in order to shore up whatever support it has there. That ought to tell you a lot about how the establishment media thinks this race is going to play out. Trump may win and everyone has to make sacrifices — including Sonya Sotomayor.\n\nIf that sacrifice is Sotomayor giving up a Supreme Court seat, well, so be it.\n\nThis article appeared originally on The Western Journal.",
    "title": "Libs So Convinced Trump Will Win That They're Trying to Boot Sotomayor Before Election C. Douglas Golden, The Western Journal",
    "date": "2024-03-20T19:00:00.000+02:00",
    "url": "https://www.thegatewaypundit.com/2024/03/libs-convinced-trump-will-win-trying-boot-sotomayor/",
    "author": "The Western Journal"
}