{
    "text": "Republican opposition continued to grow Tuesday against a $118 billion bipartisan border deal and foreign aid package ahead of a key vote in the Senate.\n\nThe bill is now on track to fail, as GOP infighting threatens to steamroll any congressional response to the border as well put aid to Ukraine and Israel in jeopardy.\n\nDespite containing policy aimed at toughening border restrictions pushed for by conservatives, the deal has faced relentless attacks from former President Donald Trump and House Speaker Mike Johnson, a Louisiana Republican who has said the bill would be dead on arrival in his chamber - if it ever makes it out of the Senate. Trump, who is hoping to make immigration a key plank of his presidential campaign, has suggested on Truth Social that approving additional resources for the border would make Republicans “look bad.”\n\nOffering a blunt assessment of the grim prospects facing the bill, Senate Minority Leader Mitch McConnell told reporters that the deal “will not become law,” due to Johnson’s opposition and concerns within the Senate GOP conference.\n\n“We had a very robust discussion about whether or not this product could ever become law, and it’s been made pretty clear to us by the speaker that it will not become law,” he said.\n\nTwo high-ranking members of Senate GOP leadership – John Thune, the No. 2 Senate Republican, and John Barrasso, the No. 3 Senate Republican – announced that they will vote against the measure in an initial procedural vote on Wednesday, the latest blow to a deal that was negotiated by Republican Sen. James Lankford of Oklahoma, one of the most conservative senators, along with Independent Sen. Kyrsten Sinema of Arizona and Democratic Sen. Chris Murphy of Connecticut.\n\nA majority of Senate Republicans are now either actively planning to vote “no” during the first procedural vote on the package Wednesday or leaning against the bill. Many Republicans have attacked the policy directly, and some have argued there should be more time to consider, debate and amend the bill after it was released on Sunday evening.\n\nThune, the Senate GOP whip, said that he plans to vote against proceeding to the bill on Wednesday and said that blocking the package will be the “predominate position” of GOP senators. Later in the day, Thune said, “I would expect that the motion to proceed to the bill will fail.”\n\nBarrasso, the chairman of the Senate GOP Conference, said in a statement, “I cannot vote for this bill. Americans will turn to the upcoming election to end the border crisis.”\n\nSenate Majority Leader Chuck Schumer harshly criticized Senate Republicans on Tuesday for deciding to oppose the package as it is currently written, accusing them of acting on Trump’s marching orders.\n\n“We all know what’s going on here. Donald Trump would rather keep the chaos at the border so he can exploit it on the campaign trail, instead of letting the Senate do the right thing and fix it. He would rather let Ukraine suffer on the battlefield, instead of being tough on Putin,” Schumer said. “And instead of standing up to Donald Trump, Senate Republicans are ready to kill our best chance at fixing the border and ready to vote down this aid package for Ukraine in order to put what they think – they think – is their party’s political interest above the interests of the country.”\n\nThe Democratic leader also went after Republican demands for more time to read the bill, noting that they had requested 72 hours, and saying he would offer to move the first procedural vote to Thursday if they want another day. “I suspect they won’t accept even that offer, because they really don’t want more time. They’re just using it as an excuse,” he said.\n\nSen. John Cornyn, another prominent senior Republican, said he plans to vote no on moving forward with the deal, adding that he wants to see changes to parts of the bill.\n\n“We need more time,” Cornyn told CNN, adding later: “I’m a ‘no’ on the motion to proceed.”\n\nMurphy, a key Democratic border deal negotiator, blasted Senate Republicans on Tuesday, calling them a “disaster” and describing their treatment of Lankford, the top GOP negotiator, as “disgusting,” saying he never expected they would leave him “hanging out to dry as badly as they did.”\n\n“I never expected they would leave Senator Lankford hanging out to dry as badly as they did,” Murphy said. “I thought they would be able to find the votes to support a very tough, conservative compromise that he was able to win.”\n\nLankford said on Tuesday that he has been “disappointed” in his colleagues who he says are mischaracterizing the package in order to reject it, rather than what is actually in the bill.\n\n“That’s the part that’s disappointing to me, is to say if you’re going to disagree with it, disagree with it based on the facts of the bill, not something that’s actually factually not true,” he said, pointing to accusations that the package includes amnesty, allows thousands more migrants to enter the US, and incentivizes more people to cross the border.\n\n“I’m surprised at the misinformation that’s out there, and how effective that has been,” added Lankford.\n\nHe acknowledged that “it’s not looking good” for the package to eventually become law, as more GOP senators demand more time to consider the language or reject it outright.\n\nOn Tuesday, McConnell said, “I want to congratulate Senator Lankford on a remarkable job of negotiating with the other side, getting the support of the border council, but it looks to me and to most of our members is that we have no real chance here to make a law.”\n\nWhile Trump and other Republicans have attacked the bill as too weak, it would mark a tough change to immigration law and would give the president far-reaching powers to restrict illegal migrant crossings at the southern border.\n\nThe Wall Street Journal editorial board called the deal “the most restrictive migrant legislation in decades,” saying “its provisions include long-time GOP priorities” in an op-ed titled “A Border Security Bill Worth Passing.”\n\nThe sweeping legislative package would also provide aid to key US allies abroad, including billions of dollars to support Ukraine in its fight against Russia and security assistance for Israel, as well as humanitarian assistance for civilians in Gaza, the West Bank and Ukraine.\n\nIt is unclear if Congress will be able to pass aid to Ukraine and Israel separate from border measures as many Republican senators had previously demanded that the issues be paired together.\n\nAsked if Congress should drop the border elements of the package and pass the rest of the security supplemental for Ukraine, Israel and Taiwan, Cornyn indicated he supported that approach.\n\n“I would say defer the border and do the rest,” he said.\n\nJohnson is pushing to pass a stand-alone Israel aid package on Tuesday, but that is also on the brink of collapse amid opposition from far-right Republicans and Democratic leaders, according to multiple GOP sources.\n\nPresident Joe Biden would veto a House standalone aid package for Israel, the White House said Monday.\n\n“The Administration spent months working with a bipartisan group of Senators to reach a national security agreement that secures the border and provides support for the people of Ukraine and Israel, while also providing much-needed humanitarian assistance to civilians affected by conflicts around the world,” the White House wrote in a statement. “Instead of working in good faith to address the most pressing national security challenges, this bill is another cynical political maneuver.”\n\nThis story has been updated with additional developments.",
    "title": "Republicans line up to sink Senate border bill negotiated by one of their own",
    "date": "2024-03-21T21:21:00.000+02:00",
    "url": "https://www.cnn.com/2024/02/06/politics/republican-opposition-senate-border-bill/index.html",
    "author": "Clare Foran,Ted Barrett,Manu Raju"
}