{
    "text": "The Biden administration has announced the implementation of the most stringent vehicle emission regulations in US history. The new policy aims to drastically increase the prevalence of electric cars, setting a goal for 56% of new car sales to be electric by 2032. This initiative is forecasted to reduce carbon dioxide emissions by 7 billion tonnes over the next three decades. The move has led to significant pushback from the auto industry, with companies facing hefty fines if they fail to comply with the new standards.\n\nEnvironmental advocates have largely welcomed the regulations, although there are voices within the activist community who believe the measures could have been more ambitious. The approach stands in contrast to the more aggressive strategies adopted by the UK and the EU, both of which plan to ban the sale of petrol cars by 2035, eliciting a mix of praise and critique from various sectors in the US.\n\nThe announcement comes in the context of relatively slow adoption of electric vehicles (EVs) in the American market, where EVs represented less than 8% of new car sales in the previous year. The regulation outlines annual limits on vehicle emissions, permitting the continued production of petrol-powered vehicles, provided they constitute an increasingly smaller proportion of a manufacturer's overall product lineup.\n\nNavigating the political challenges, the Biden administration seeks to balance the employment concerns of autoworkers, particularly in crucial states such as Michigan, against the imperative of addressing climate change. The controversial nature of the regulation suggests potential legal battles on the horizon, possibly from the oil industry and Republican-governed states, which may ultimately lead the Supreme Court to determine the regulation's fate.",
    "title": "Biden administration unveils groundbreaking vehicle emission standards - Noah",
    "date": "2024-03-21T02:21:00.000+02:00",
    "url": "http://noah-news.com/gb/en/environment/2024/03/21/biden-administration-unveils-groundbreaking-vehicle-emission-standards",
    "author": "Lorr ai ne Malak ai"
}