{
    "text": "Trump lags behind Biden in campaign cash reserves while legal bills mount\n\nPresident Biden’s campaign continues to boast a significant cash advantage over Donald Trump’s, as the former president juggles the burdens of fundraising for his bid to return to office and paying his mounting legal bills seven months before the general election.\n\nFederal Election Commission reports filed on Wednesday did not offer a full picture of the comparative strength of the two campaigns, because several of the groups raising money for each presumptive nominee will not disclose their latest totals with the FEC until April.\n\nBut the Biden campaign demonstrated a clear fundraising advantage over Trump in filings Wednesday night, reporting $71 million in cash on hand to Trump’s $33.5 million — more than double his rival’s reserves. Biden’s campaign widened the gap from the end of January, when it led Trump’s campaign $56 million to $30.5 million.\n\nThe reports underscore the extent to which Trump’s legal troubles are putting a strain on his campaign. Save America, the political action committee that the Trump campaign has been using to pay the legal bills for the former president and many of his associates, spent more than it raised in February — with the vast majority of its spending going to legal costs.\n\nThe Save America PAC reported about $4 million in cash on hand at the end of February. It spent about $7 million over the same period, including $5.6 million paid to lawyers. Since the start of this year, Save America has spent $8.5 million on legal bills, and the Trump campaign has spent $1.8 million on such costs.\n\nTrump has used the charges against him as a rallying cry to galvanize his supporters — accusing Democrats and President Biden of weaponizing the powers of the Justice Department against him. (Biden has said that he has not suggested to the Justice Department what it should or should not do regarding charges.) Trump has structured his fundraising effort to benefit from his claims. Each time a donor contributes a dollar to the campaign through his joint fundraising committee, 10 cents is directed to Save America and 90 cents is allocated to the Trump presidential campaign.\n\nTrump’s campaign brought in nearly $11 million in February and had $33.5 million in cash on hand at the end of the month. Almost all of the money that Trump’s campaign brought in during February came in the form of a transfer from a joint fundraising committee, campaign finance records show. Both Biden and Trump rely on a constellation of committees that together can raise and spend money on behalf of their candidacies.\n\nThough Biden has trailed Trump in many of the early national and battleground state polls, the incumbent’s campaign and allied groups are outpacing Trump’s effort in fundraising and the cash stockpiled for the general election. The disparity is fueled in part by the fact that Biden did not face a contested primary and has been able to raise money in conjunction with the Democratic National Committee, as well as state parties.\n\nThe Biden campaign said that it ended February with $155 million in the bank and that it raised money from nearly half a million donors. The team also said it raised $53 million in February across all of the five entities that are fundraising for the president’s effort, including the DNC. It did not release a breakdown of how much each committee had raised, and some of those reports will not be available until April.\n\nWith flush coffers, the Biden team launched a $30 million spring advertising campaign in key swing states — including an ad aimed at Latino voters. The campaign has said it will open more than 100 offices this month, and Biden launched a national organizing program to engage Hispanic voters in Arizona this week.\n\nThe Trump campaign just recently joined forces with the Republican National Committee, which has faced its own fundraising strains, and began integrating their fundraising teams and other staff to create greater efficiencies. The campaign negotiated the terms of a joint fundraising agreement with the RNC and state parties across the country, which will help accelerate fundraising for the GOP effort.\n\nAs Trump continues to dominate the GOP landscape in drawing small donors, the RNC’s fundraising has trailed the DNC’s — though allies of the Trump campaign insist that their fundraising will pick up now that the campaign and the RNC are merging their efforts.\n\nOn Wednesday, the RNC reported that it had raised $10.7 million in February and ended the month with $11.3 million in cash on hand. The DNC raised $16.6 million and reported more than double the cash on hand with $26.6 million in the bank at the end of the month.\n\nAfter Trump clinched the nomination earlier this month, his team began a swift revamp of the RNC’s operations as Ronna McDaniel stepped down as the committee’s chair and Michael Whatley took over.\n\nOne of Trump’s top advisers, Chris LaCivita, is overseeing the integration of the two operations and addressing dissatisfaction in some sectors of the party about the RNC’s financial situation. Many higher-level aides to the RNC have resigned or been fired in recent weeks and some lower-level staffers were asked to reapply for their jobs.\n\nDespite the upheaval, Whatley said in a memo to RNC members that he was confident that the merging of the two teams would ultimately result in a strong fundraising effort for the GOP. He argued that the recent joint fundraising agreement negotiated by the RNC and the campaign would ensure the party has “the necessary funds to win up and down the ballot.”\n\n“Our two teams will get President Trump’s vision for America in front of as many people as possible, and we are working on merging our digital assets both from the campaign and RNC,” he wrote. “This merger will greatly expand our capacity and reach.”\n\nDemocrats mocked the fundraising disparity between the two parties on Wednesday. “If Donald Trump put up these kinds of numbers on The Apprentice, he’d fire himself,” the Biden campaign’s communications director, Michael Tyler, said in a statement.\n\nNews Related",
    "title": "Trump lags behind Biden in campaign cash reserves while legal bills mount",
    "date": "2024-03-21T13:09:00.000+02:00",
    "url": "https://newsexplorer.net/trump-lags-behind-biden-in-campaign-cash-reserves-while-legal-bills-mount-s2000632.html",
    "author": "VNExplorer"
}