{
    "text": "CNN —\n\nThe Democratic Party has ramped up its attacks on independent presidential candidate Robert F. Kennedy Jr. in recent days, marking the first significant attempt by either party to shape voter sentiment around his candidacy ahead of a potential rematch of the 2020 election.\n\nThe Democratic National Committee has taken multiple steps in recent days to portray Kennedy as a spoiler who would help Republican frontrunner Donald Trump defeat President Joe Biden, arguing Kennedy is funded primarily by wealthy donors aligned with the former president.\n\nLast week, the DNC filed a complaint with the Federal Election Commission alleging that Kennedy’s campaign had illegally coordinated with American Values 2024, a PAC backing his White House bid. Kennedy’s campaign has denied coordinating with the group.\n\nIn a call with reporters outlining the complaint, DNC adviser Ramsey Reid blamed Trump and his donors for turning Kennedy into a “stalking horse” by funding the PAC.\n\n“We’re concerned that Donald Trump is disrespecting the democratic process. It’s pretty clear that Trump and his megadonors are propping up RFK Jr. as a stalking horse,” Reid said.\n\nThe DNC has homed in on donations to the PAC from billionaire Tim Mellon, an heir to a prominent banking fortune who has been a prolific donor to pro-Trump and other GOP causes over the years. Mellon gave approximately $15 million to American Values 2024 last year. In 2020, he gave $20 million to America First Action Inc., one of the leading outside groups backing Trump’s reelection.\n\nOn Saturday, as Kennedy held a campaign rally in Grand Rapids, Michigan, the DNC advertised on four billboards around the area accusing Kennedy of being “powered by MAGA/Trump.” And after the Kennedy-aligned PAC released a new TV ad during the Super Bowl that repurposed an old spot from the 1960 campaign of President John F. Kennedy, the candidate’s uncle, the DNC issued a statement highlighting the PAC’s funding from Mellon.\n\n“It’s fitting that the first national ad promoting Robert F. Kennedy Jr.’s candidacy was bought and paid for by Donald Trump’s largest donor this cycle,” DNC rapid response director Alex Floyd said in a statement released shortly after the ad aired Sunday.\n\nKennedy’s team pushed back on the Democratic attacks, saying that donors “from across the political spectrum are supporting the Kennedy campaign as they are tired of the corruption in the two-party system.”\n\n“Instead, donors want an independent candidate who will heal the divide, restore the middle class, end the forever wars, unravel corporate capture, and the end chronic disease epidemic,” Kennedy campaign spokeswoman Stefanie Spear said in a statement to CNN.\n\nDNC adviser Lis Smith told CNN the party’s latest efforts are meant to educate voters on the connections between Trump and Kennedy, while acknowledging the critical role Kennedy could play in the general election.\n\n“It’s clear that Donald Trump and his allies view him as a useful stalking horse who could help throw the election to Trump in November,” Smith said.\n\nWhile his independent campaign faces steep odds of success, Kennedy’s candidacy could influence the outcome of a Biden-Trump rematch if he garners enough support in critical states. In the 2020 election, Biden flipped three states – Arizona, Georgia and Wisconsin – by margins of less than 1%. Recent national polling of a Trump-Biden rematch suggests the race could be narrowly decided again. A CNN/SSRS poll released earlier this month showed Trump with 49% support among registered voters, compared with 45% for Biden.\n\nIt’s unclear as of now how Kennedy would affect a potential general election between Biden and Trump – whether he’d draw more support from historically Republican or Democratic voters, or whether he’d receive enough total support to influence the election either way. An NBC News poll released this month found 34% of registered voters saying they could see themselves supporting Kennedy.\n\nBut Kennedy’s allies have targeted Biden and Democrats as they look to gain traction in the race, a sign they’re ready to meet the DNC’s escalating attacks straight ahead. In a statement released after the Super Bowl ad, American Values 2024 co-founder Mark Gorton criticized the DNC for its efforts targeting Kennedy.\n\n“The only argument the DNC has left is that Biden is not Trump. When RFK Jr. gets on the ballot, the American public will have the ability to choose a candidate who is not Trump, who has integrity, bravery, a proven track record of fighting corporate corruption, and the ability to stand up to the corporate interests that have taken over the Biden administration. The American people are waking up, and the DNC’s only hope is to prevent them from having a choice,” Gorton said.\n\nThis story has been updated with additional information.\n\nCNN’s Edward-Isaac Dovere and David Wright contributed to this report.",
    "title": "DNC heightens attacks on RFK Jr. as a spoiler candidate who will help Trump",
    "date": "2024-03-21T00:21:00.000+02:00",
    "url": "https://www.cnn.com/2024/02/13/politics/rfk-jr-democrats-trump-attacks/index.html",
    "author": "cnn.com"
}