{
    "text": "Private Residence\n\nDallas, Texas\n\n7:24 P.M. CDT\n\nTHE PRESIDENT: Thank you. (Applause.) I don’t know where he’s been, but I want to go there. (Laughter.)\n\nRussell and Dori, thank you for your friendship. You know, you heas- — you hosted me the first time for a fundraiser in 2019. And it’s fitting that you’re hosting my first Texas fundraiser for 2024.\n\nA special thanks to all of you: Jaime Harrison and — the chair of the — of the — our — our party; Chris, our finance chair; and all the lawyers here today who care deeply about the rule of law and the frontlines of fairness and justice and — and deepening democracy and defending it, because I think it’s at stake.\n\nYou know, folks, we’re seeing incredible enthusiasm all over the country as we travel. Recently, I’ve traveled to Pennsylvania, Michigan, Georgia, Wisconsin, New Hampshire, Nevada, Arizona. And Jill and Kamala and Doug are traveling as well.\n\nOur grassroots support, thank God, keeps getting stronger. So far, over 1.3 million people have contributed to our campaign this time around — 500,000 of them, brand new — and 97 percent of those contributions are $200 or less — 97 percent of them.\n\nAnd we’re ramping up our many campaign headquarters, off- — field offices across the country. We’ve opened a hundred field offices so far and staffing them all now — and before Trump has opened a — and his MAGA Republican friends — have opened even one. (Laughter.)\n\nAnd while you probably haven’t read about it, in the last few days, there have been five national polls where we’re back to leading again in the polls. (Applause.)\n\nBut the truth is I’m not sure any of them matter, because it’s so hard to take polls these days. It really is. And not everyone is feeling the enthusiasm. Not everyone.\n\nJust the other day, a defeated-looking guy came up to me and said, “Mr. President, I need your help. I’m being crushed with debt. I’m completely wiped out.” I had to say, “Donald, I can’t help you.” (Laughter and applause.) (Inaudible.)\n\nSpeaking of Donald Trump, just a few days ago, he asked a famous question in one of his rallies: Are you better off today than you were four years ago?\n\nAUDIENCE: Yes!\n\nTHE PRESIDENT: Well, Donald, I’m glad you asked that question, man. (Laughter.) I hope everyone in the country takes a moment to think back what it was like in March of 2020.\n\nCOVID had come to America. Trump was president. Hospitals, emergency rooms were overcrowded. First responders were risking their lives. Nurses were wear- — were wear- — were wearing garbage bags because they couldn’t have the protection in the hospitals they needed. There was a ventilator shortage. Morgues were being set up all outside, not just in the hospitals. And the loved ones were dying all alone. We couldn’t even say goodbye to them.\n\nAnd unemployment shot up to 14 percent. The stock market crashed. Grocery store shelves were emply — and were empty. And we even — remember the whole toilet paper conference? (Laughter.) No, I’m — think about how tough things were.\n\nYou know, months ago Trump tried to downplay the virus. He told us, “Don’t worry, it will go away. Just stay calm. And we’ll” — remember he said, “We’ll be out of it by Easter”? Well, over a million people died. And while — all while doing nothing.\n\nOf course, we now know Bob Woodward’s book — that Trump was lying to the American people all along. He knew how dangerous the virus was, and he hid it from us. He just kept getting worse — worse and worse. He told Americans — remember he was telling “inject bleach”? He told us to hit the body with UV light. Well — (laughter).\n\nBut later, you know, he wanted to tear gas the photo op — for a photo op, out — because they protested justice in front of the White House.\n\nThen, after losing the 2020 election, Trump finished his presidency by sending an interrecti- — an insurrection mob to the Capitol. And, folks, look, there’s — these folks — so many of them have been convicted. And he swears when he gets elected he’s going to pardon them all — pardon them all — because they’re “heroes.”\n\nBut four years later, look at where we — how far we’ve come. Donald Trump is not president — that’s the first thing — because of you. (Applause.) And I mean it — because of many of you.\n\nCOVID no longer controls our lives. We’ve created 15 million new jobs — more jobs in that timeframe than any president has in American history. (Applause.) We have the lowest unemployment rate in over 50 years. We had record economic growth, new small-business creation record, stock market is highest it’s ever been.\n\nInsulin now costs seniors 35 bucks instead of 400 bucks a month. Out-of-pocket costs for prescription drugs for seniors are going to be capped at $2,000 a year, no matter what the total cost is.\n\nIt doesn’t just save seniors money; it saves taxpayers significant amounts of money.\n\nBy just passing that law and what we’ve done so far, we’ve saved — we’ve reduced the deficit by $160 billion — $160 billion. If you’re not paying $400 instead of $15, and so on. Go down the line. I won’t bore you with detail.\n\nWe’re rebuilding the nation’s roads and bridges. We’re delivering clean water and high-speed Internet to every American, whether you’re rural or no matter where you live.\n\nAmerican manufacturing is booming — 800,000 manufacturing jobs and counting. And be- — you all know this as well as I do: We’ve attracted over $650 billion dollars in private-sector investment in clean energy, advanced manufacturing, semiconductors — all across America. (Applause.) We made the biggest investment in history to combat climate change. And we can do a lot more, of course, and we have to.\n\nInflation peaked at 9 percent a little over a couple of years ago — a year and a half ago. Now, it’s dropped to 3 percent — the lowest in the world — and still dropping. We’re going to do more — more to be done.\n\nSo, let me ask you: Does anyone here want to go back to 2020? (Laughs.)\n\nAUDIENCE: No!\n\nTHE PRESIDENT: Well, when fear ruled our lives, when Trump was president — I don’t think so.\n\nBut, look, the problem isn’t just going back to Trump ha- — where Trump had the country. The problem is he wants to take us — where he wants to take us now. Look at what he’s saying, and I hope that we all begin to take seriously. He means what he says. As crazy as it sounds, he means what he says.\n\nHe wants to get rid of the Affordable Care Act. Over 30 million Americans depend on the ACA. It would be a disaster for the — to be taken away.\n\nHe wants to get rid of the savings I just got put into law for prescription drugs at 35 bucks for — for insulin — for a whole range of — and he just wants to wipe it all out.\n\nYou know, and what he wants to do is enact another $2 trillion tax cut. Well, at the time, you know, he increased the deficit larger than any man in American history in four years — the deficit.\n\nHouse Republicans just proposed massive cuts in Social Security and Medicare. Trump recently said, “Social security and Medicare — there’s a lot you can do to cut more.”\n\nWell, folks, the climate — he’s a climate denier. And he’s going to do away with the historic action that we’ve taken. There’s a lot more to do. I’m not suggesting we’ve finished.\n\nBut another school shooting recently, and what did he say? He said — when asked about it, he said, “Just get over it.” “Just get over it.”\n\nNo — no, I want to stop it, not get over it. The idea our children are having to duck and cover in school. Did you ever think we’d be in that position? Ever think we’d be teaching kids that?\n\nLook — look at the judges he put on the bench. Imagine who else he’ll put on the bench.\n\nOur reputation internationally has been crushed when he was president. Imagine what will happen if he’s reelected. He wants to do away with NATO, and he wants to tell Putin to do whatever you want — do whatever you want.\n\nTrump boasts he — what I found so stunning: He recently hosted Viktor Orbán, the Prime Minister of Hungary, at Mar-a-Lago. And Orbán says he doesn’t think democracy works — it doesn’t work. And that’s who he admires most.\n\nHe brags about how he ha- — he’s the reason Roe v. Wade is overturned and the freedom to choose is taken away. Look, and American needs to know: Donald Trump and his MAGA extremists are now calling for a national ban — a national ban on abortion in every state in the Union.\n\nFolks, one more thing. Trump didn’t just bring chaos to the lives of women. He is also bringing chaos to the American border.\n\nWith a group of bipartisan senators we put together over a five-month period, the very conservative — a very conservative senator from Oklahoma heading the group — of a meeting for five — five solid weeks toward the end, we agreed on the strongest border security law in American history: 1,500 more Border Security agents and officers; 100 more immigration judges to tackle the backlog of 2 million cases; 4,300 asylum officers and new policy so they can resolve six — issues in six months instead of, now, six years; 100 more high-tech drug detection machines to significantly decrease the ability to — to smuggle in fentanyl and all its precursors.\n\nBut Trump — the problem is — I’ve been around a while. I don’t ever remember the leader of another party saying the reason they want to — their party to vote against something — not because it wasn’t good but because he worried I would get too much credit for it — the other team would get credit for it.\n\nFolks, it wasn’t about whether it’s good for me or Trump; it’s about what’s good for America.\n\nBut here’s what I — here’s what I will not do. Unlike Trump, I’m not going to demonize immigrants. I will not say immigrants are “poisoning the blood” of this nation. I will not call immigrants “rapists” and “murderers.” I will not separate families, put kids in cages. I’ll not end the birthright citizenship.\n\nNow, this guy actually wants to end — and he’s — now he’s bragging about it. He wants to end the right for birthright citizenship, which we established way back, a couple hundred years ago. If you’re born in America, you’re an American citizen. He wants to end that.\n\nI’m not going to ban people because of religion. That’s not who we are as Americans.\n\nFolks, but after all the threats Trump poses, to our economy, our standing in the world, is — the greatest threat he poses is to our democracy. Violence on January 6th — Trump embraced and he’s running on it. He’s running on it. He calls insurrectionists who are in prison — in prison — found guilty and in prison — he calls them “patriots.” He suggests that they are, in fact, the ones who should be — and he swears if he gets elected, he’s going to pardon them — pardon them all.\n\nTrump now says if he loses again in November, there will be a “bloodbath” in the streets.\n\nYou know, we didn’t — when I got elected, and you helped me get elected in 2020, I — I made a speech on democracy at Independence Hall. I said we’re in danger of losing the democracy if we don’t win this thing. Well, folks, we can’t stand for this stuff. We have to say in one voice as Americans — as Democrats, independents, and Republicans — there’s no place for violence in America ever, ever, ever. Period. (Applause.)\n\nAnd I’ll probably get her in trouble, but I just read what Liz Cheney recently said. She said, “You can’t possibly vote for him, because democracy is at stake.” And when asked, she said she’d vote for Biden. The idea that a woman who is — has very different id- — ideas on policy than I do is so concerned that this guy gets reelected — what will happen.\n\nLook, let me close with this, because you’re standing. You know, I couldn’t be — the stakes couldn’t be higher across the board. And with your help, we’re going to win up and down the ticket. That includes here in Texas, because I want to see — you got to elect Colin your next senator. (Applause.) You got to so Ted Cruz joins another loser, Donald Trump. (Laughter.)\n\nLooks, there’s a lot of focus these days on how old Trump is and how old I am. I’m two — two times 40. But I — you know, what the hell? (Laughter.)\n\nThe real question is — all kidding aside — is how old are ideas? How old are our ideas?\n\nDonald Trump’s vision of America is one of anger, hate revenge, retribution — some of the oldest known ideas to man.\n\nI have a very different vision for America, one that focuses on the future and answers questions — important questions: Are you better off now, and will you be better off four years from now?\n\nHere’s the future I see, and I’ll be brief. I see a future where we defend democracy and we don’t diminish it.\n\nI see a future where we restore the right to choose and protect the freedoms, not take them away.\n\nI see a future — (applause) — I see a future where the middle class finally has a fair shot and the wealthy, the su- — you know, we have a thousand billionaires. I — I respect anybody who can make as much money as they can legally. But you know what their average tax — you know what the tax is of a — for those thousand billionaires in America? 8.2 percent. Anybody want to trade that rate? (Laughter.)\n\nNo — no, but I’m serious. This — this is — you know, if – if they just got paid — if they just paid the 25 percent, do you know how much money that would raise? Four hundred billion dollars over 10 years.\n\nImagine what we could do — from everything from the deficit to taking care of kids, education, so many —\n\nI see a future where we save the planet from the climate crisis and our country from gun violence.\n\nLook, I own weapons. I own guns. But this — from the very beginning, the Second Amendment didn’t say you can own any weapon. You couldn’t own a cannon. You couldn’t own a — I’m serious.\n\nAnd so, above all, I really do — I give you my word — I see a future for all Americans where we don’t demonize one another and we give hate no safe harbor and we leave nobody behind. That’s a future we can build together. That’s the reason I’ve never been more optimistic about our future.\n\nMy dad used to have an expression, God love him. My dad was a high school-educated guy who was well-read. He got into Johns Hopkins. But during the war, he never made it to Hopkins.\n\nMy dad used to say, “Joey, a job is about a lot more than a paycheck. It’s about your dignity. It’s about respect. It’s about having a chance. It’s about being able to look your kid in the eye and say, ‘Honey, it’s going to be okay,’ and mean it.” Well, that’s what this is about: giving everybody a shot.\n\nWe are the most incredible nation in the world. I know that sounds like I’m bragging about our country, but I am. I think it’s real. We’re the only nation in the world, as I said before, that have come — come out of every crisis we faced stronger than we went in — stronger than when we went in.\n\nWe have to remember who in the hell we are. We are the United States of America. And I believe with all my — every fiber of my being there’s not a single thing beyond our capacity to get done when we act together. I mean that from the bottom of my heart.\n\nSo, God bless you all. Thanks for giving me a shot to do it again. And may God protect our troops. (Applause.) Thank you.\n\nEvery time I’d walk out of my Grandfathers Finnegan’s house in Scranton he’d yell, “Joey, keep the faith.” And my grandmother would yell, “No, Joey. Spread it.” Let’s go spread it.\n\nThank you. (Applause.)\n\n7:39 P.M. CDT",
    "title": "Remarks By President Biden at a Campaign Reception | Dallas, TX | The White House",
    "date": "2024-03-21T08:00:00.000+02:00",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/03/20/remarks-by-president-biden-at-a-campaign-reception-dallas-tx",
    "author": "The White House"
}