{
    "text": "OK, this is almost too good, but remember that it’s all politics.\n\nThe Biden Administration has been playing cat and mouse with Intel (INTC) for the last three months.\n\nYou remember, the CHIPS Act, right?\n\nWell, Intel has been waiting for the Administration to write a few checks so they can get their plans moving on the next big things: Manufacturing chips here in the U.S.\n\nPlanned projects are in Arizona, Ohio, New Mexico, and Oregon.\n\nLast month, the campaign trail brought President Biden to Ohio, but they steered clear of Columbus, where Intel’s planned construction has been on hold. Instead, the campaign visited East Palestine on the one-year anniversary of the Norfolk Southern derailment. The President vowed to continue holding Norfolk Southern accountable for their “act of greed.”\n\nRight around that time, the news hit that funding from the CHIPS Act for Intel was in flux and that the company was delaying the launch date for the Ohio chip manufacturing site.\n\nThings changed yesterday, though. The Biden campaign had a scheduled trip to Arizona to work the campaign trail. As I already pointed out, Arizona is the other site for Intel’s manufacturing plan. That detail made it hard for the campaign to visit without acknowledging Intel.\n\nRemember, it’s all about the politics this year.\n\nLong story short, Intel received some “timely” news of $8.5 billion in direct funding, tax credits for the company’s $100 billion investment, and eligibility for federal loans up to $11 billion.\n\nThe details are here if you’d like to read Intel’s press release .\n\nLet’s get down to the rub.\n\nIntel shares are trading 1% in early trading, but the long-term prospects for the stock are very strong.\n\n(Click to enlarge)\n\nIt’s not often that you get the opportunity to look at a company as it is transitioning into its future. IBM (IBM) comes to mind. General Electric (GE) is another. Intel is in that spot in time.\n\nThe stock broke into a long-term bull market in June of 2023 and 40% upside potential before they start breaking into new high territory. This stock is for the “value” investors as the company is likely to return to a different form of its former self.\n\nBottom Line\n\nI’ve been an outspoken bull about Intel’s long-term potential and believe that $42 is a bargain for the new company that is emerging in the semiconductor industry.",
    "title": "The Biden Administration Finally Writes Intel a Check",
    "date": "2024-03-20T17:13:00.000+02:00",
    "url": "https://www.becomerichfaster.com/money-morning/money-usa/the-biden-administration-finally-writes-intel-a-check",
    "author": "Chris Johnson"
}