{
    "text": "President Biden picked up another key union endorsement on Wednesday, receiving the backing from the United Steelworkers (USW) as he battles former President Trump for the blue-collar vote.\n\n\"President Biden proved time and again during his first term that he stands with working families,\" USW International President David McCall said in a statement. \"His vision and leadership allowed our nation to strengthen workers’ access to collective bargaining, grow the middle class, and embark on a path to widespread prosperity.\"\n\nUSW, which represents 850,000 workers in metals, mining, pulp and paper, rubber, chemicals, glass, auto supply and the energy-producing industries, along with a growing number of workers in health care, public sector, higher education, tech and service occupations, said it conducted a months-long process that included surveying union members regarding their top priorities.\n\nThe union said it also \"sent prospective presidential candidates in both parties a detailed questionnaire to determine where each of them stands on key issues affecting working people.\"\n\nTEAMSTERS UNION REPORTS MAX DONATION OF $45,000 TO THE RNC AFTER MEETING WITH TRUMP\n\n\"Our members told us that they value retirement security, affordable health care and labor laws that support our ability to form unions and negotiate strong contracts,\" McCall said. \"President Biden’s record on all these issues speaks for itself. He also laid out a strong plan for building on this momentum well into the future.\"\n\nLast week, the White House said Biden called McCall on Thursday to reiterate support for USW members after the president came out against the planned sale of U.S. Steel to Nippon Steel of Japan, according to The Associated Press. In announcing the decision, Biden said the U.S. needs to \"maintain strong American steel companies powered by American steel workers.\"\n\nThe news comes after United Auto Workers (UAW) President Shawn Fain endorsed Biden for president in 2024 in January, taking several swipes at Trump in the process. Biden notably stood on the UAW picket line in Michigan in the fall during their strike against Ford, General Motors and Stellantis.\n\nMeanwhile, the International Brotherhood of Teamsters' political action committee in February reported a $45,000 donation — the maximum contribution amount — to the Republican National Committee's (RNC) convention fund, marking a stark departure from the union's history of giving primarily to Democrats.\n\nUAW PRESIDENT ENDORSES BIDEN, CLAIMS TRUMP 'DOESN'T CARE ABOUT THE AMERICAN WORKER'\n\nIn 2021, USW members led a union-wide effort backing large-scale infrastructure investment with strong Buy American provisions.\n\n\"President Biden, through the Infrastructure Investment and Jobs Act, Inflation Reduction Act and other pro-worker legislation, is making good on his promise to create good, union jobs and healthier communities across the country,\" McCall said Wednesday. \"Our nation has long needed this sort of sweeping investment. President Biden made it happen.\"\n\nMcCall claimed Biden is promoting domestic manufacturing and \"widespread prosperity\" in the long term by \"strategically combining these historic investments with a worker-centered trade policy that is rebuilding supply chains and supporting critical industries.\" He also credited the Democratic incumbent and his administration for advancing workers’ interests.\n\n\"President Biden’s leadership revitalized the Department of Labor and National Labor Relations Board so that they are once again fulfilling their mission to empower working people. And he consistently held firm on protecting Americans’ retirement security, fending off attacks on Social Security and Medicare,\" McCall said. \"Among the many accomplishments of Biden’s American Rescue Plan was shoring up the troubled multi-employer pension plans that put more than a million workers’ retirements in jeopardy through no fault of their own — including 120,000 USW members and retirees. These workers can now look to the future with optimism rather than fear.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Workers and their families are more secure than they were four years ago, thanks to President Biden’s leadership. From infrastructure to retirement security, international trade to safer workplaces, President Biden got the job done,\" McCall added. \"We’re honored to back him as he runs for re-election.\"\n\nFox News' Thomas Cantenacci contributed to this report.",
    "title": "Biden picks up another key union endorsement amid fight against Trump for blue-collar vote",
    "date": "2024-03-20T23:51:00.000+02:00",
    "url": "https://www.foxbusiness.com/politics/biden-picks-another-key-union-endorsement-fight-against-trump-blue-collar-vote",
    "author": "foxbusiness.com"
}