{
    "text": "Washington, D.C., Attorney General Brian Schwalb dropped charges against Steve Nikoui, a Gold Star father who was arrested for disrupting President Joe Biden’s State of the Union Address, after a significant backlash, Fox News reported Tuesday.\n\nBoth the Speaker’s Office and the D.C. AG’s office confirmed to Fox News that the charges had been dropped. The AG’s office told the outlet that its decision to not move forward with the charges was typical when dealing with protesters.\n\nNikoui was detained after he shouted “Abbey Gate! Kareem Nikoui! Second Battalion, First Marines!” as Biden spoke about murder rates in his annual address. Authorities led Nikoui from the chamber and charged him with a misdemeanor for “crowding, obstructing, or incommoding” during a protest — a charge that carries a fine of up to $500 and 90 days in prison.\n\nThe guy who heckled Biden from the upper seating area shouted “United States Marines;” perhaps in reference to the 13 Marines the President killed with his disastrous Afghanistan withdrawal. pic.twitter.com/n3OPgvVdtZ — Nicholas Fondacaro (@NickFondacaro) March 8, 2024\n\nAdvertisement\n\nNikoui’s son Kareem was one of 13 members of the U.S. military killed in a suicide bombing at the Kabul airport during the Biden administration’s disastrous withdrawal from Afghanistan in 2021. At least 170 civilians were also killed in that attack.\n\n“I don’t think I disrespected anyone,” Nikoui said in an interview with Morning Wire. “I don’t think I dishonored my son.”\n\nNikoui blames the Biden administration for his son’s death, explaining that, “They were told to leave 2,500 troops there. 2,000 troops could have manned Bagram and then 500 extra to help. And that was in place in the agreement. But [Biden] took it to something like 136 troops. If they would have followed Trump’s agreement, my son would be alive.”\n\nAdvertisement\n\nRep. Darrell Issa (R-CA) sent a letter to Capitol Police Chief J. Thomas Manger on Monday arguing that the charges against him should be dropped.\n\n“Mr. Nikoui’s arrest for emotionally expressing his grief and seeking acknowledgment for his son’s sacrifice during the State of the Union – where he called out, ‘Abbey Gate! Kareem Nikoui! Second Battalion, First Marines!’ – highlighted a profound disconnect between the sacrifices made by our service members and the recognition they deserve,” Issa said.\n\nCLICK HERE TO GET THE DAILYWIRE+ APP\n\nAdvertisement\n\n“Though he interrupted the event, what Mr. Nikoui voiced out loud was a cry for the acknowledgment of the loss endured by the families of the 13 who made the ultimate sacrifice for their country,” he added.\n\nDaniel Chaitin contributed to this report.",
    "title": "Charges Dropped Against Gold Star Father Who Shouted At Biden During SOTU Address",
    "date": "2024-03-20T16:03:00.000+02:00",
    "url": "https://www.dailywire.com/news/charges-dropped-against-gold-star-father-who-shouted-at-biden-during-sotu-address",
    "author": "EdJenner"
}