{
    "text": "Sen. Bernie Sanders's latest proposal. Also, is it actually a good idea to tax the rich?\n\nI’m Isaac Saul, and this is Tangle: an independent, nonpartisan, subscriber-supported politics newsletter that summarizes the best arguments from across the political spectrum on the news of the day — then “my take.”\n\nAre you new here? Get free emails to your inbox daily. Would you rather listen? You can find our podcast here.\n\nToday's read: 13 minutes.\n\n🕰️ Bernie Sanders introduces a 32-hour workweek bill. Plus, why should we tax the rich?\n\nFrom today's advertiser:\n\nRestore Your Youth and get 55% off your first order.\n\nCollagen loss as you age results in weaker joints, wrinkles, and a decline in overall vitality. Replenishing collagen can restore your vibrancy and power, and the journey starts now. With the power of NativePath’s Grass-Fed Collagen Powder, their premium formula absorbs rapidly, rebuilding strength and enhancing beauty from within. Simply add 2 scoops to your daily routine and witness the transformative effects.\n\nWhat are the other benefits?\n\nTangle readers: Don't miss out on this game-changing chance to feel and look your best — get 55% off today.\n\n*If you don't want ads, you can subscribe to our ad-free newsletter here.\n\nApologies.\n\nYesterday, you received our newsletter twice. The first edition had the quotes from left-leaning sources copied over into the section where we quote sources from the right. We sent a second, corrected, newsletter shortly after, but apologize for the error. I simply put the wrong section in, and both of our quality control editors missed it before sending.\n\nNew video.\n\nYesterday, we announced our first new video in a while — a breakdown of my piece on the Zionist case for a ceasefire in Gaza. It just went up yesterday and has already generated a lot of positive feedback. Please help us tell the YouTube algorithm there’s an audience for our work by watching the video in full, then clicking “subscribe” to be informed of new videos when they drop!\n\nQuick hits.\n\nThe Federal Reserve left interest rates unchanged and said its goal is still to make three small cuts within the year, though it also signaled that significant interest rate cuts are less likely. ( The decision ) U.S. Secretary of State Antony Blinken met with Egyptian President Abdel Fattah El-Sisi in Cairo as part of talks with Arab officials to seek a ceasefire in Gaza. ( The meeting ) Separately, Israel’s military operation in Gaza’s largest hospital facility, Al-Shifa, entered its fourth day. ( The offensive ) Judge Scott McAfee, who is presiding over the criminal case against former President Donald Trump and his 14 co-defendants in Georgia, permitted the defense to appeal his decision to allow Fulton County district attorney Fani Willis to remain on the case. They now have 10 days to file an application to the appeals court. ( The appeal ) Senate Majority Leader Chuck Schumer (D-NY) declined a request from Israeli Prime Minister Benjamin Netanyahu to address Senate Democrats this week. ( The rejection ) Today, House Speaker Mike Johnson (R-LA) said he plans to invite Netanyahu to speak to Congress. ( The invitation ) The Justice Department filed an antitrust complaint against Apple, alleging that the tech company drove up prices for consumers by blocking competitors from offering their services on iPhones. ( The lawsuit )\n\nToday's topic.\n\nThe 32-hour workweek. Last Wednesday, Sen. Bernie Sanders (I-VT) introduced a bill to federally mandate a 32-hour workweek. Sanders’s bill is the Senate companion to a bill introduced by Rep. Mark Takano (D-CA) in the House, the Thirty-Two Hour Workweek Act , which would amend the Fair Labor Standards Act to reduce the standard workweek from 40 hours to 32, lowering the maximum hours threshold for overtime pay for non-exempt employees. Those exempt would include computer professionals, farmworkers, sales employees, and many other occupations . The proposal follows the United Auto Workers (UAW) strikes in the fall, where one of the labor demands was for a 32-hour workweek.\n\nTakano, a senior member of the House Committee on Education and the Workforce, credits technological advances , especially in artificial intelligence, with increasing efficiency enough to allow workers to put in less time to produce the same results. “We have choices to make as a society about whether we are going to allow technology to put us in the service of it or whether it really serves all of us, and I mean all of us,” Takano said.\n\nSanders garnered attention for his bill last week with a hearing in the Senate Health, Education, Labor and Pensions Committee, which he chairs. He said the proposed worktime reductions would be phased in over four years. “Do we continue the trend that technology only benefits the people on top, or do we demand that these transformational changes benefit working people?\" Sanders asked.\n\nThe proposal faced both support and opposition in the hearing . \"If this policy is implemented, it would threaten the millions of small businesses already operating on razor-thin margins, in part because they are unable to find enough workers,” said Sen. Bill Cassidy (R-LA). \"Employers would be forced to eliminate full-time positions in favor of part-time ones.\"\n\nA recent survey from Morning Consult found that 87% of employed U.S. adults would be interested in a four-day workweek. However, the Senate bill is not likely to gain the necessary 60 votes to pass the divided Senate, nor is Takano’s bill expected to pass a Republican-controlled House. The 32-hour workweek faces stiff opposition not just from most Republicans but also from some financial experts , who say that the proposed changes could hurt blue-collar workers and manufacturing industries. Other economists , though, argue that a shortened workweek would improve worker productivity.\n\nA recent pilot study of 61 companies in the United Kingdom found that a four-day workweek significantly increased employee morale, decreased burnout, and improved employee retention. 92% of companies who participated in the pilot program voluntarily adopted a 32-hour workweek.\n\nSome economists have cast doubt on the results of the UK study, noting that it wasn’t peer-reviewed and participating companies shortened the workweek by only 7% on average. Others suggest that these pilot programs tend to only include employers who were already inclined to try a shorter week, limiting the accuracy of their findings.\n\nToday we’ll take a look at the arguments about the proposal from the right and left, then I’ll give my take.\n\nWhat the right is saying.\n\nThe right opposes the proposal, arguing it’s out of touch with economic reality.\n\nSome say it would cause costs to rise for everyone.\n\nOthers suggest working fewer hours won’t make workers happier.\n\nNational Review’s editors wrote about “Bernie’s 32-hour work week.”\n\n“What is Sanders’s plan to contribute to the great human endeavor of becoming wealthier while working less? Does he have an idea for the next automobile, a better management strategy, or the power loom for the 22nd century?,” the editors asked. “No, Sanders wants to write words on a page and have a couple hundred people vote for it… That’s Sanders’s idea of progress. Pass a law that says everyone gets paid the same for doing less work, and then it happens.”\n\n“We could easily produce 1950s levels of output only working a few hours per week. But that would mean 1950s levels of technology, 1950s levels of poverty, 1950s levels of housing, 1950s levels of air-conditioning, 1950s levels of food quality and variety — and it turns out nobody really wants that. So we keep working, and innovating, so we can be better off, not just as well off,” the editors wrote. “Maybe if you’re an 82-year-old socialist who has only worked in politics your entire life, you lose touch with what it means to be a productive member of society.”\n\nIn The Washington Examiner, Brad Polumbo said “Bernie Sanders unveils his latest insane idea.”\n\n“It might sound dreamy, but like so many of Sanders’s bold plans that promise to make everything better with no meaningful downsides, it’s actually a harebrained idea that would backfire tremendously,” Polumbo wrote. “There’s no such thing as a free lunch. Any economic change has significant trade-offs, and you can’t get around them just by writing legislation that says everything has to work out great for everyone.”\n\n“This change would constitute an enormous increase in costs for many employers and businesses. And it’s just basic economics that when businesses’ costs go up, they have to raise their prices. Workers aren’t actually going to be better off if everything they consume gets more expensive. Regardless, while the federal government could try to prohibit employers from reducing current workers’ wages in light of this legislation, that wouldn’t really work. After all, employers will still presumably be free to offer lower wages for all new hires.”\n\nIn PJ Media, Rick Moran asked “would reducing the workweek to 32 hours make workers happier?”\n\n“There's no doubt this would be a popular piece of legislation with many workers. And Sanders, surprisingly, makes some good points about why the change would be beneficial,” Moran said. But “there is absolutely no empirical evidence that a shorter workweek relieves stress and makes workers happier… however many hours an employee puts in, the work has to get done. I doubt whether relieving stress levels would be measurable.”\n\n“Work has, indeed, changed radically. There is a lot less physical exertion, and, in fact, machines do most of our heavy lifting and thinking. To relieve stress, I suggest looking at home life as well. There are far more stressors at home than in most workplaces. And a 32-hour workweek isn't going to fix that,” Moran added. “This proposal would sound the death knell of American economic supremacy. Let's make sure we understand that before taking the leap to a 32-hour workweek.”\n\nWhat the left is saying.\n\nThe left is mixed on the proposal, with supporters arguing it’s a necessary move for a modern workforce.\n\nSome disagree, saying companies will make this change themselves if it’s truly in workers’ best interest.\n\nOthers say the proposal’s growing popularity shows our changing societal values.\n\nIn The Washington Post, Sen. Bernie Sanders and United Auto Workers president Shawn Fain made “the case for a 32-hour workweek with no loss in pay.”\n\n“Today, American workers are more than 400 percent more productive than they were in the 1940s. And yet, despite this fact, millions of our people are working longer hours for lower wages. In fact, 28.5 million Americans now work over 60 hours a week, and more than half of full-time employees work more than 40 hours a week,” Sanders and Fain said. “Despite these long hours, the average worker in America makes almost $50 a week less than he or she did 50 years ago, after adjusting for inflation.”\n\n“Think about all the incredible advancements in technology — computers, robotics, artificial intelligence — and the huge increase in worker productivity that has been achieved. What have been the results of these changes for working people? Almost all the economic gains have gone straight to the top, while wages for workers are stagnant or worse,” Sanders and Fain wrote. “While CEOs are making nearly 400 times as much as their average employees, many workers are seeing their family lives fall apart… This should not be happening in the United States of America in 2024.”\n\nIn Inc. Magazine, Suzanne Lucas said “no matter how popular this bill seems, the chances of it becoming law are slim to none.”\n\n“Sanders says he wants to pass this 4-day workweek bill to force companies to share profits with their employees and bring Americans into line with other wealthy nations,” Lucas wrote. “Employees in other countries may look like they work a lot fewer hours per week--workers in Copenhagen, Denmark, for instance, clock in at 1,380 hours per year, which is a dramatic difference. But they also have a standard 37-hour work week, with an average of 33 hours per week actually worked—a 3.4-hour difference.\n\n“Why is the overall number so much lower? Vacation. Danes are entitled to a minimum of five weeks of vacation per year for full-time employees. Most Europeans enjoy real time off like this. U.S. law doesn't have any mandatory vacations, although some states require paid sick time,” Lucas said. “Many people want to work fewer hours, but businesses tend to want full-time employees to work 40 hours… If this is truly better for everyone, companies will adopt it on their own. No new law needed.”\n\nIn The New York Times, Binyamin Appelbaum called the 32-hour workweek “the magic number.”\n\n“Americans spend too much time on the job. A shorter workweek would be better for our health, better for our families and better for our employers, who would reap the benefits of a more motivated and better-rested work force. Other countries may seek an advantage in the global marketplace by wringing every drop of labor from their workers; American companies have to be more productive, and that means taking better care of their workers.”\n\n“Though the 40-hour week may feel like an immutable law of nature, it’s barely a century old. American workers fought to establish the eight-hour workday around the turn of the last century, campaigning on the catchy slogan ‘Eight hours for work, eight hours for rest, eight hours for what you will,’” Appelbaum wrote. “The revival of the idea partly reflects a shift in societal priorities. Americans have become more protective of their health, more inclined to define themselves in terms of their lives outside work — and perhaps more willing to accept leisure as a substitute for higher pay.”\n\nMy take.\n\nReminder: \"My take\" is a section where I give myself space to share my own personal opinion. If you have feedback, criticism, or compliments, don't unsubscribe. Write in by replying to this email, or leave a comment.\n\nIt’ll never pass, but there are good reasons to adopt a 32-hour workweek.\n\nIf you have a business that can get the same amount of productivity for less time, then go for it.\n\nBut not all businesses can, so I don’t think this proposal makes sense as a piece of top-down federal legislation.\n\nI just don’t see how a 32-hour workweek can happen.\n\nSanders’s proposal is not going to make it through a divided Senate, and Takano’s is essentially dead on arrival in the House. The federal government isn’t going to enact a 32-hour workweek, and I don’t think it should. But that doesn’t mean the idea is totally without merit, either.\n\nLet’s start with what the proposal gets right. Workers are more productive now and are getting paid less — Sanders isn’t pulling those numbers out of thin air. According to the St. Louis Fed, worker productivity since 1955 has increased by about 400% , and over the same period average inflation-adjusted income has decreased — despite income inequality dropping in the last year.\n\nIt’s also true that other countries do require fewer hours per week. Denmark, for example, has a 37-hour workweek , as well as more maternity and paternity leave and a culture where more paid time off is expected. And there is evidence to suggest that companies that enact a four-day workweek can maintain the same level of productivity with happier and healthier employees.\n\nIn simple terms, the proposal makes sense. Technological advances have helped workers make productivity gains and helped companies make more money, but the amount that workers get paid per time worked hasn’t increased. Instead of fixing that by making hourly pay go up, why not keep their pay the same and make the number of hours go down? Workers who make enough would be happier because they would spend less time at work, those who don’t make enough would have more time for a second job; and if companies get the same level of productivity, then what’s the problem?\n\nThat brings us to what the proposal gets wrong. First, I don’t see how this helps with worker wages. If we make it so full-time workers are making the same amount a year but are just working less, how is that putting more money in the pockets of most Americans? You could argue that it frees them up for more part-time work, but like Sanders said, a lot of people who need the money are already working second jobs. I can see the argument that working less is just better for health and stress levels, and that’s fine, but I don’t think you can really argue it’s better for the average person’s bottom line.\n\nIn fact, it might be worse. A shortened workweek might make sense for white-collar workplaces, but I don’t see how it makes sense for manufacturing or construction companies. Imagine a construction company where 50 employees are paid a fixed amount for 40 hours a week. If suddenly that company has to pay the same employees for 32 hours of work instead, what do you think will happen? Either 50 employees are going to get eight hours of overtime pay, increasing the cost of construction at a time when housing prices are at all-time highs, or 100 employees are going to work 20 hours a week — meaning 50 people lose their benefits while 50 newer, less efficient workers are brought on, also without benefits. Either way, an increase in housing costs or a decrease in worker benefits isn’t a good outcome.\n\nThe U.K. pilot study of 61 companies quoted so often by 32-hour workweek supporters reflects this problem, too. Of those companies, seven were in manufacturing and construction, and none of the construction companies were quoted or showcased in the report. Meanwhile, only one manufacturing company — a craft brewery — was highlighted.\n\nThat study had other problems, too. First off, it isn’t definitive. Other studies have shown that the length of the workweek isn’t behind most workplace issues. It also wasn’t peer-reviewed, it was financed by an organization called “4 Day Week Global” (meaning its methods are likely biased), it included only organizations interested in adopting a four-day workweek (biasing its results further), and it only collected data about stress levels at the workplace. While trying to mitigate stress is a worthy cause, there’s not much evidence that the number of hours we work is a significant driver: About 75% of U.S. adults reported experiencing stress in their lives, while in Scandinavian countries — where it’s more common to work fewer hours — it’s closer to 80% .\n\nSimply put, I don’t think legislating a top-down 32-hour workweek is going to be a magic bullet to eliminate stress, I don’t think it makes for smart policy, and I don’t think it’s going to be good for every industry — or for every company in the industries where it could work best. I know that with the amount of work we have to do every week at Tangle, I’m not exactly champing at the bit to try it out.\n\nBut I could see it working for a lot of other places. Advertising agencies, law firms, even small businesses and storefronts — if you can actually achieve the same amount of productivity for less work, then you should by all means do it. And I think Sanders and Takano mainstreaming this issue and making it part of a broader discussion could result in that change coming faster to those workplaces where it makes sense. Then maybe, down the road, it would make sense in more and more industries.\n\nI just don’t think we’re there now. Like another signature Sanders position, the $15 federal minimum wage he ran on in 2016 , I think it’s a nice talking point that makes sense for some industries but wouldn’t make sense as a matter of overarching federal policy. Until more U.S. companies try this out across every sector, there just isn’t enough reason to support a government-mandated change of this magnitude.\n\nTake the poll: What do you think of the 32-hour workweek? Let us know !\n\nDisagree? That's okay. My opinion is just one of many. Write in and let us know why, and we'll consider publishing your feedback.\n\nHelp share Tangle.\n\nI'm a firm believer that our politics would be a little bit better if everyone were reading balanced news that allows room for debate, disagreement, and multiple perspectives. If you can take 15 seconds to share Tangle with a few friends I'd really appreciate it — just click the button below and pick some people to email it to!\n\nYour questions, answered.\n\nQ: Why do so many people want to increase the tax on the rich? 1 — The top 1% already pay over 42% of the taxes. 2 — Every time they increase this tax rate the amount collected actually goes down. Sounds like a no win!\n\n— Ray from Staunton, Virginia\n\nTangle: A lot of the issues we cover have moderate positions to stake out that take elements from each side of a debate. Some issues are ones where moderate positions are still very possible, but maintaining a consistent viewpoint makes it hard to meet in the middle. Abortion is one of those issues. Taxation is another.\n\nIf you believe that we are better off with less government, that means you want to see lower taxes, fewer agencies and employees, and fewer investments in government services and entitlement programs. If you believe in more government, that means more taxation, more federal workers, and more investment in government services and entitlement programs.\n\nI think that’s where your second point actually provides a really good visualization. There’s an economic concept called the Laffer Curve , which says that the more you tax a population the less prosperous the people are, meaning that over time you actually get less from them. It also means the opposite — the less you tax a population, the less you get in taxes. So, in theory, there’s a happy medium of ideal taxation. But every increase in taxation past that point gives diminishing returns, and actually hurts the population.\n\nI don’t disagree at all with that. And to be honest, I’m more ideologically prone towards smaller government and less taxation. But I also understand the point of view of people who disagree with me, and I think their best point answers your first question: Why tax the rich, when the top 1% earn 22% of income but make up 42% of our tax revenue ?\n\nFirst of all, it’s not really a bad thing that we tax richer people more, because the same idea behind the Laffer Curve for the government is also at play for individuals — every extra dollar you earn past a certain point gives diminishing returns, so it’s better to put a higher tax on the dollars people need less. Second, despite income inequality going down in 2023, it’s still extremely high in historical terms, and a more progressive tax is a pretty good tool for addressing it.\n\nFrom my point of view, the big question is how to effectively tax the ultra-wealthy, who amass their fortunes not from salaries but from stock benefits and investments. Those are hard to tax , and they should be. But in a country where the 400 richest people own as much wealth as the bottom 60% combined, and where their fortunes are almost unimaginable , you’re going to see a lot of popular interest in progressively taxing the people who earn significantly more in a year than most people will ever see in a lifetime.\n\nWant to have a question answered in the newsletter? You can reply to this email (it goes straight to my inbox) or fill out this form.\n\nUnder the radar.\n\nThis week, Meta said it will be shutting down CrowdTangle (no relation), an analytics tool used by journalists and researchers to see what's going viral on Facebook and Instagram. CrowdTangle was a driving force behind the controversy over Facebook’s algorithms in the lead-up to the 2020 election, with journalists leveraging its data to show the site was promoting hyper-political content. The move comes despite Meta facing calls for greater transparency in how it handles content moderation, and the company says it will offer improved research tools — like its new Meta Content Library — to address these concerns. But news publishers, journalists, or anyone with commercial interests will not be granted access to that data and will have to rely on third-party tools to analyze Meta’s platforms. Axios has the story.\n\nNumbers.\n\n53-30. The vote in the Senate in 1933 in favor of a bill that shortened the workweek to 30 hours. The bill didn’t make it any further but set the stage for the adoption of the 40-hour workweek in 1940.\n\nThe vote in the Senate in 1933 in favor of a bill that shortened the workweek to 30 hours. The bill didn’t make it any further but set the stage for the adoption of the 40-hour workweek in 1940. 2,316. The average annual working hours for non-farm U.S. workers in 1929, according to an analysis by Our World in Data.\n\nThe average annual working hours for non-farm U.S. workers in 1929, according to an analysis by Our World in Data. 1,808. The average annual working hours for non-farm U.S. workers in 1994.\n\nThe average annual working hours for non-farm U.S. workers in 1994. 1,757. The average annual working hours for non-farm U.S. workers in 2017.\n\nThe average annual working hours for non-farm U.S. workers in 2017. 60%. The approximate increase in U.S. worker output (measured in goods and services) between 2000-2022, according to the Bureau of Labor Statistics.\n\nThe approximate increase in U.S. worker output (measured in goods and services) between 2000-2022, according to the Bureau of Labor Statistics. 10%. The approximate increase in hours worked between 2000-2022.\n\nThe approximate increase in hours worked between 2000-2022. 75%. The percentage of employed U.S. adults who said they’d be interested in a four-day workweek if remote work is allowed “all or nearly all of the time,” according to a 2023 Morning Consult poll.\n\nThe percentage of employed U.S. adults who said they’d be interested in a four-day workweek if remote work is allowed “all or nearly all of the time,” according to a 2023 Morning Consult poll. 51%. The percentage of employed U.S. adults who said they’d be interested in a four-day workweek without the option of remote work.\n\nThe extras.\n\nYesterday’s poll: 434 readers took our poll on whether the Biden administration’s communication to social media companies was a violation of free speech with 44% saying that some of the speech was a violation. “Communication is fine but the way they used coercive language to get these media platforms to abide their ‘suggestions’ is downright terrifying,” one respondent said.\n\nWhat do you think of the 32-hour workweek? Let us know !\n\nHave a nice day.\n\n“Stupid table. $100.” That was the title of a post for a coffee table a woman was trying to sell on Facebook Marketplace — too high for her couch, too low for anything else, and it reminded her of her ex, whom she had just gotten out of a relationship with. Her inbox got flooded with support, as the Marketplace community suggested she just solicit $1 donations from people and then destroy the table. In the end, what was an angry and bitter post turned into a cathartic outpouring of love. “Thank you for the 1000+ sweet, hilarious, and inspiring messages... Maybe this table wasn't so stupid after all,” she said. Sunny Skyz has the story .\n\nDon't forget...\n\n📣 Share Tangle on Twitter here, Facebook here, or LinkedIn here.\n\n🎥 Follow us on Instagram here or subscribe to our YouTube channel here\n\n💵 If you like our newsletter, drop some love in our tip jar.\n\n🎉 Want to reach 97,000+ people? Fill out this form to advertise with us.\n\n📫 Forward this to a friend and tell them to subscribe (hint: it's here).\n\n🛍 Love clothes, stickers and mugs? Go to our merch store!",
    "title": "Should we have a 32-hour workweek?",
    "date": "2024-03-21T18:00:00.000+02:00",
    "url": "https://www.readtangle.com/should-we-have-a-32-hour-workweek",
    "author": "@Ike_Saul"
}