{
    "text": "President Joe Biden’s principal campaign committee reported it held more than $71 million in cash on hand at the end of February.\n\nPresident Joe Biden is currently enjoying a significant cash advantage over his biggest rivals for the White House.\n\nOn the evening of March 20, political committees associated with President Biden, former President Donald Trump, and independent candidate Robert F. Kennedy Jr. filed their February disclosures with the Federal Election Commission (FEC). Joe Biden Only one of President Biden’s political committees reported on March 20, but that single body held far more cash at the end of February than any other major candidate’s main committee.\n\nPresident Biden’s principal campaign committee, Biden For President, according to its FEC filing, held more than $71 million in cash on hand at the end of February.\n\nThe same organization raised about $21.3 million in total receipts and made about $6.3 million in total disbursements.\n\nSignificant parts of the Biden financial apparatus report on a quarterly basis, so the full extent of the president’s fundraising is not clear as of March 20.\n\nHowever, Biden For President has issued press releases saying the campaign, as a whole, raised $53 million in February and has access to more than $155 million in cash.\n\nPresident Biden’s reelection effort was buoyed by a $120 million commitment from the progressive political group League of Conservation Voters on March 19, too.\n\nIn addition, on March 12, Republican Voters Against Trump pledged to spend $50 million in President Biden’s favor. The group is financed by Democratic Party donors and Republican critics of President Trump.\n\nThe full size of President Biden’s war chest will be known in April when the numerous committees tied to him file quarterly financial disclosures with the FEC. Donald Trump Three committees funding the Trump campaign raised about $28.7 million in February, according to the FEC.\n\nPresident Trump’s principal campaign committee, Donald J. Trump For President 2024 Inc., his qualified leadership political action committee, Save America, and a super PAC, Make America Great Again Inc., held about $63.1 million at the end of February. The groups spent $22 million.\n\nFormer President and Republican presidential candidate Donald Trump and former First Lady Melania Trump smile after voting in Florida's primary election at a polling station at the Morton and Barbara Mandel Recreation Center in Palm Beach, Fla., on March 19, 2024. (Giorgio Viera /AFP via Getty Images)\n\nThe Republican Party’s primaries officially ended in February when former U.S. Ambassador to the UN Nikki Haley dropped out of the race. President Trump is now the GOP’s presumptive nominee.\n\nPresident Trump scored another political victory in March when the Republican National Committee picked Michael Whatley and Lara Trump as its new co-chairs. The new leadership has promised to operate as an extension of the Trump campaign\n\nNevertheless, the Trump campaign is spending heavily on defending the candidate in numerous legal proceedings across the country.\n\nAccording to FEC filings, the three committees that reported their February activities dropped more than $6.5 million on legal expenses during the month.\n\nPresident Trump will likely continue to face legal and financial hurdles as the cases against him progress. He’s currently staring down a $464 million bond in order to appeal a decision in New York.\n\nLike President Biden, only a portion of the Trump campaign’s finances were revealed on March 20. The rest of the committees regulated by the FEC connected to President Trump will issue quarterly disclosures in the middle of April. Robert F. Kennedy Jr. Independent presidential candidate Robert F. Kennedy Jr.’s campaign spent more than it made in February, according to its FEC filings.\n\nIndependent presidential candidate Robert F. Kennedy Jr. poses with supporters during a meet and greet after a voter rally at St. Cecilia Music Center in Grand Rapids, Mich., on Feb. 10, 2024. (Emily Elconin/Getty Images)\n\nThe two groups financing Mr. Kennedy’s run, the principal campaign committee Team Kennedy and a hybrid PAC American Values 2024, reported they collectively raised about $7.3 million and spent about $11.7 million.\n\nTogether, the two groups reported they held more than $23.7 million in cash on hand at the end of February.\n\nMr. Kennedy made waves nationally in February with a surprise Super Bowl ad purchased by American Values. He captured the headlines again when rumors about him potentially tapping New York Jets Quarterback Aaron Rodgers as his running mate circulated in March.",
    "title": "Biden Campaign Holds Wide Lead In Fundraising Race: Filings",
    "date": "2024-03-21T09:03:00.000+02:00",
    "url": "https://www.theepochtimes.com/us/biden-campaign-holds-wide-lead-in-fundraising-race-filings-5611695",
    "author": "EdJenner"
}