{
    "text": "Mike Pence in Washington DC on 26 May 2020; Donald Trump in Des Moines, Iowa, on 10 January 2024. Photograph: Brendan Smialowskikamil Krzaczynski/AFP/Getty Images\n\nDonald Trump told his vice-president, Mike Pence, that refusing to block certification of Joe Biden’s 2021 election victory at the Capitol on 6 January 2021 would be “a political career killer”, according to newly released testimony from a presidential valet.\n\n“Mike, this is a political career killer if you do this,” Trump told Pence by phone on the morning of January 6, the New York Times reported, citing a transcript of testimony to the House committee that investigated the deadly attack on Congress that unfolded later that day.\n\nRelated: Mike Pence will not endorse Trump, but will not rule out voting for him\n\nAccording to the Times, the unnamed valet also said Trump appeared unconcerned when he was told a civilian had been shot dead as the Capitol was stormed.\n\n“I just remember seeing it in front of him,” the valet said of a card given to Trump as he watched the riot on television. “I don’t remember how it got there or whatever. But there was no, like, reaction.”\n\nThe woman who was killed, Ashli Babbitt, has become a martyr to the Trumpist far right. Trump has called her a “great patriot”. The police officer who shot her outside the House chamber was cleared of wrongdoing, a judgment with which Trump disagreed.\n\nEight other deaths, including law enforcement suicides, are now linked to the Capitol attack, which happened after Trump told supporters to “fight like hell” to overturn Biden’s win, which according to Trump’s lie was the result of electoral fraud.\n\nMore than 1,200 arrests have been made over the riot and hundreds of convictions and sentences secured. Trump was impeached for inciting an insurrection but acquitted by Senate Republicans. He is now the presumptive Republican nominee for president, despite facing 88 criminal charges (14 concerning election subversion) and multimillion-dollar penalties in civil lawsuits. The US supreme court rejected attempts to keep Trump off the ballot under the 14th amendment to the constitution, which bars insurrectionists from office.\n\nStory continues\n\nThe Times said it obtained the redacted transcript of the valet’s testimony from House Republicans who claim the January 6 committee omitted from its hearings and report anything that did not suit its narrative.\n\nTranscripts contradicting sensational testimony from Cassidy Hutchinson, a close aide to Trump’s final chief of staff, Mark Meadows, have already been released.\n\nBarry Loudermilk of Georgia, the Republican leading the effort to undermine the work of the January 6 committee, told the Times there was “some testimony in [the valet transcript] that may not be favorable to Trump” but said: “We’re putting it all out there, not doing what the select committee did, and putting things out there that will be favorable to our side.”\n\nBennie Thompson, the Mississippi Democrat who chaired the January 6 committee, which included two anti-Trump Republicans, told the Times: “Despite Mr Loudermilk’s attempts to rewrite the violent history of January 6, the facts laid out in the select committee’s final report remain undisputed – and nothing substantive was left out nor hidden.\n\n“While the valet did not witness everything that happened in the White House that day, the testimony confirms Trump’s indifference to the violence and his anger at Vice-President Pence for performing his duty under the constitution.”\n\nThe unnamed valet said he did not remember Trump calling Pence what the Times called “an expletive meant to refer to a wimp”, otherwise widely reported to have been the word “pussy”.\n\nAs the Times noted, Trump has not disputed the insult that was described to the January 6 committee by a former chief of staff to Ivanka Trump, the former president’s daughter.\n\nThe valet also said he did not remember Trump or any staff member commenting on how rioters chanted for Pence to be hanged. Hutchinson told the committee she heard aides saying Trump said Pence “deserved” such a fate.\n\nThe valet said he heard Trump ask aides about how to send national guard troops to the Capitol, a deployment that took several hours as chaos reigned and a contentious issue since.\n\nThe valet also described “disbelief” among White House staff as the situation at the Capitol worsened and Trump persisted in watching TV.\n\nPence escaped the rioters and ultimately returned to the Capitol to preside over certification, despite objections from 147 Republicans in the House and Senate. According to Trump’s valet, the president “just mentioned that Mike let him down, and that was it”.\n\nTrump has been proved right, however, about Pence committing a “political career killer”. Portrayed as a hero by the January 6 committee, Pence ran against Trump for the Republican presidential nomination. Failing to make an impact, he withdrew well before the first primary vote.\n\nLast week, he exacted a measure of revenge – by refusing to endorse Trump in his rematch with Biden.\n\nBut Pence also said his differences with Trump were “not personal” – and refused to say he would not vote for him.",
    "title": "Trump told Pence certifying Biden election would be ‘political career killer,’ valet says",
    "date": "2024-03-21T02:00:00.000+02:00",
    "url": "https://uk.news.yahoo.com/trump-told-pence-certifying-biden-201546526.html",
    "author": "Martin Pengelly in Washington"
}