{
    "text": "CNN —\n\nIndependent presidential candidate Robert F. Kennedy Jr. apologized to members of his family who objected to a new TV ad released Sunday during the Super Bowl that repurposed a spot from his uncle’s 1960 campaign.\n\nThe retro-themed ad from a PAC backing his candidacy mimics the soundtrack and theme of President John F. Kennedy’s 1960 campaign ad. The spot features a dramatic orchestra opening and a jingle repeating the word “Kennedy” over and over again.\n\nThe ad also feature the lyrics, “Do you want a man for president who sees it through and through? A man who’s old enough to know and young enough to do.” The words are a potential jab from the 70-year-old Kennedy toward his somewhat older competitors, 81-year-old President Joe Biden and 77-year-old former President Donald Trump, in a race defined by criticisms of age and mental cognition.\n\n“My cousin’s Super Bowl ad used our uncle’s faces- and my Mother’s. She would be appalled by his deadly health care views. Respect for science, vaccines, & health care equity were in her DNA,” Kennedy’s cousin Bobby Shriver said on X following the release of the ad.\n\nAnother of Kennedy’s cousins, Mark Shriver, replied to Bobby Shiver’s post by saying “I agree with my brother @bobbyshriver simple as that.”\n\nBobby and Mark Shriver are sons of Eunice Kennedy Shriver, sister of President Kennedy and the late Attorney General Robert F. Kennedy.\n\nKennedy responded to criticism from Bobby Shriver by apologizing.\n\n“Bobby. I’m so sorry if that advertisement caused you pain. The ad was created and aired by the American Values Superpac without any involvement or approvals from my campaign. Federal rules prohibit Superpacs from consulting with me or my staff. I send you and your family my sincerest apologies. God bless you,” Kennedy posted on X.\n\nAmerican Values 2024, the group supporting Kennedy’s presidential bid, spent $7 million on the ad. More recently, the PAC faced allegations from the Democratic National Committee that it illegally contributed to Kennedy’s signature-gathering efforts.\n\nKennedy has faced dissent from members of his family throughout his presidential run. On the day of he announced his intention to run for president as an independent, a group of his siblings called his decision to run against Biden in a general election “dangerous to our country.”\n\nKennedy has been a leading proponent of vaccine misinformation through his Children’s Health Defense organization and has spent years wrongly suggesting that many vaccines are not safe. In a CNN interview in December, he walked back some of his comments and rejected the label that he’s “anti-vaccine” despite his history of spreading misinformation about the efficacy of vaccines.\n\nHe also made a series of comments in 2022 in which he compared the Covid-19 lockdowns to Nazi Germany, arguing that “even in Hitler’s Germany, you could cross the Alps into Switzerland.”\n\n“Bobby might share the same name as our father, but he does not share the same values, vision or judgment,” Rory Kennedy, Kerry Kennedy, Joseph P Kennedy II and Kathleen Kennedy Townsend said in a statement in October.\n\nCNN’s Liz Brown-Kaiser contributed to this story.",
    "title": "RFK Jr. apologizes to cousins offended by Super Bowl ad’s reference to JFK",
    "date": "2024-03-21T00:21:00.000+02:00",
    "url": "https://www.cnn.com/2024/02/12/politics/rfk-jr-apologizes-cousins-super-bowl-ad/index.html",
    "author": "Aaron Pellish,Michelle Shen"
}