{
    "text": "CNN —\n\nPresident Joe Biden, in a call Saturday with Ukrainian President Volodymyr Zelensky, directly tied Ukraine’s withdrawal from the key town of Avdiivka to Congress’ inability to pass further aid for the country’s effort to fend off Russia’s invasion.\n\n“This morning, Ukraine’s military was forced to withdraw from Avdiivka after Ukrainian soldiers had to ration ammunition due to dwindling supplies as a result of congressional inaction, resulting in Russia’s first notable gains in months. President Biden emphasized the need for Congress to urgently pass the national security supplemental funding bill to resupply Ukrainian forces,” according to a White House readout of the call.\n\nThe call bookended a week defined by US attempts to reassert leadership on the world stage. It also highlighted renewed urgency to pass additional funds for Ukraine amid the withdrawal from Avdiivka, a key town that in recent months became one of the most fiercely contested battles on the eastern front, and the news of Kremlin critic Alexey Navalny’s death.\n\nBiden told reporters later Saturday that he’s not confident other Ukrainian towns wouldn’t also fall, adding it is “unethical” that the US is not providing more aid to the Ukrainian people after they have fought “so bravely and heroically.”\n\n“The idea that now they are running out of ammunition, and we walk away. I find it absurd. I find it unethical,” Biden said in Rehoboth Beach, Delaware. “I find it contrary to everything we are as a country.”\n\nEarlier this week, the Senate passed with bipartisan support a $95.3 billion foreign aid bill, which includes $60 billion to support Ukraine. However, GOP House Speaker Mike Johnson has said he does not plan to bring the bill to the floor, and the House is on a two-week break.\n\nUS officials have recently expressed concern about Russian gains in the war, suggesting it’s a reflection of a slowdown in aid. National Security Council spokesperson Adrienne Watson also said in a statement shared with CNN that the withdrawal from Avdiivka is a direct result of the foreign aid bill being stalled in Congress.\n\n“This is the cost of Congressional inaction. The Ukrainians continue to fight bravely, but they are running low on supplies. It is critical that the House approve additional Ukraine funding without delay so that we can provide Ukraine with the artillery ammunition and other critical equipment they need to defend their country,” she said.\n\nBiden’s call followed similar ones earlier Saturday from Vice President Kamala Harris and Zelensky urging Congress to pass additional aid for Ukraine, with Harris slamming House Republicans for stalling legislation.\n\nUkrainian President Volodymyr Zelenskiy and US Vice President Kamala Harris attend a news conference during the Munich Security Conference on February 17, 2024. Tobias Schwarz/Pool/Reuters\n\n“Political gamesmanship has no role to play in what is fundamentally about the significance of standing with an ally as it endures an unprovoked aggression,” Harris told reporters following a bilateral meeting with Zelensky at the Munich Security Conference in Germany.\n\nShe said she has “full belief that were the supplemental package and security package to make it to the floor of the House of Representatives, that it would actually pass.”\n\n“For us, this package is vital,” Zelensky said, according to a translation. “We do not currently look into alternatives because we are counting on the United States.”\n\nWhile the Ukrainian leader said he does not consider the lack of additional funding a betrayal, he hinted at the House being on recess until the end of the month.\n\n“Please, everyone, remember that dictators do not go on vacation,” he said during a speech at the conference. “Hatred knows no pause. Enemy artillery does not fall silent due to procedural issues.”\n\nBiden on Friday criticized House lawmakers for taking a two-week break, calling it “outrageous” and telling reporters it’s “about time they step up” following the death of Russian opposition figure Navalny.\n\n“Two weeks, they’re walking away,” Biden said at the White House. “Two weeks. What are they thinking? My God, this is bizarre, and it’s just reinforcing all of the concern and almost – I won’t say panic – but real concern about the United States being a reliable ally. This is outrageous.”\n\nUkraine has been facing renewed pressure across the eastern front in its war against Russia, compounded by ammunition and manpower shortages. The withdrawal from Avdiivka marks the biggest gain for Moscow since it captured the city of Bakhmut last year.\n\nThis story has been updated with additional developments.",
    "title": "Biden blames ‘congressional inaction’ for Ukrainian withdrawal of key town in call with Zelensky",
    "date": "2024-03-22T15:21:00.000+02:00",
    "url": "https://www.cnn.com/2024/02/17/politics/biden-zelensky-congress-ukraine-aid/index.html",
    "author": "Sam Fossum,Priscilla Alvarez,Radina Gigova,Kaanita Iyer"
}