{
    "text": "\n\n\n\nYesterday, I said Taylor Marshall finally admitted that \"Pope Francis teaches HERESY: Pope Pius XII condemned the heresy of Francis\":\n\nPope Francis on Feb 2 2022, taught, \"that in Christ no one can ever truly separate us from those we love because the bond is an existential bond, a strong bond that is in our very nature...who have denied the faith, who are apostates.\" Pope Pius XII taught the exact opposite when he wrote of those: \"who have not been so unfortunate as to separate themselves from the unity of the Body, or been excluded by legitimate authority for grave faults committed....as does schism or heresy or apostasy.\" Pope Francis is condemned by Pope Pius XII. Only one can be right on this matter. [https://www.youtube.com/watch?v=rzxvFNb59Ug]\n\nNow, the question is will he do the Steve Skojec Francis Trad-like semi-modernist thing.\n\nHere is a post that shows what that is like:\n\nSemi-Modernists, FrancisTrads like Skojec, Sedevacantists and Vatican II & I\n\n- This problem is exacerbated by our current historical conditions. As the theological community began to unravel before, during and after Vatican II, those who considered themselves orthodox were those who were obedient and intellectually submissive to the Magisterium, since those who dissented were not orthodox. Therefore the standard of orthodoxy was shifted from Scripture, intrinsic tradition (of which the Magisterium is a part) and extrinsic tradition (which includes magisterial acts of the past, such as Pius IX’s Syllabus of Errors), to a psychological state in which only the current Magisterium is followed.\n\nNeoconservatives have fallen into this way of thinking. The only standard by which they judge - orthodoxy is whether or not one follows the current Magisterium. As a general rule, traditionalists tend to be orthodox in the sense that they are obedient to the current Magisterium, even though they disagree about matters of discipline and have some reservations about certain aspects of current magisterial teachings that seem to contradict the previous Magisterium (e.g., the role of the ecumenical movement). Traditionalists tend to take not just the current Magisterium as their norm but also Scripture, intrinsic tradition, extrinsic tradition and the current Magisterium as the principles of judgment of correct Catholic thinking. This is what distinguishes traditionalists and neoconservatives\n\nInevitably, this magisterialism has led to a form of positivism. Since there are no principles of judgment other than the current Magisterium, whatever the current Magisterium says is always what is “orthodox.” In other words, psychologically the neoconservatives have been left in a position in which the extrinsic and intrinsic tradition are no longer included in the norms of judging whether something is orthodox or not. As a result, whatever comes out of the Vatican, regardless of its authoritative weight, is to be held, even if it contradicts what was taught with comparable authority in the past. Since non-infallible ordinary acts of the Magisterium can be erroneous, this leaves one in a precarious situation if one takes as true only what the current Magisterium says. While we are required to give religious assent even to the non-infallible teachings of the Church, what are we to do when a magisterial document contradicts other current or previous teachings and one does not have any more authoritative weight than the other? It is too simplistic merely to say that we are to follow the current teaching. What would happen if in a period of crisis, like our own, a non-infallible ordinary magisterial teaching contradicted what was in fact the truth? If one part of the Magisterium contradicts another, both being at the same level, which is to believed?\n\nUnfortunately, what has happened is that many neoconservatives have acted as if non-infallible ordinary magisterial teachings (such as, for instance, the role of inculturation in the liturgy as stated in the Catechism of the Catholic Church) are, in fact, infallible when the current Magisterium promulgates them. This is a positivist mentality. Many of the things that neoconservatives do are the result of implicitly adopting principles that they have not fully or explicitly considered. Many of them would deny this characterization because they do not intellectually hold to what, in fact, are their operative principles. - Fr. Chad Ripperger, F.S.S.P. [http://www.latinmassmagazine.com/articles/articles_2001_sp_ripperger.html]\n\n\n\n- \"Some... assembled [Council] prelates advocated... harsh measures towards the [Semi-Arian] Arianizers... Athanasius, however, proposed more temperate measures... A decree was passed, that such [Semi-Arian] bishops as had communicated with the Arians through weakness or surprise, should be recognized in their respective sees, on signing the Nicene formulary; but that those, who publicly defended the heresy, should only be admitted to lay-communion... Yet it cannot be denied, that men of zeal and boldness were found among the [Semi-Arian] Arianizers. Two laymen, Flavian and Diodorus, protested with spirit against the [unambiguous Arian] heterodoxy of the crafty Leontius, and kept alive an orthodox [Catholic] party in the midst of the [Arian] Eusebian communion.\"\n\n(The Arians of the Fourth Century, By John Henry Newman, Pages 198-199)\n\n\n\n'Yet the men were better than their creed; and it is satisfactory to be able to detect amid the impiety and worldliness of the heretical party any elements of a purer spirit, which gradually exerted itself and worked out from the corrupt mass, in which it was embedded. Even thus viewed as distinct from their political associates, the Semi-Arians are a motley party at best; yet they may be considered as Saints and Martyrs, when compared with the Eusebians, and in fact some of them have actually been acknowledged as such by the Catholics of subsequent times. Their zeal in detecting the humanitarianism of Marcellus and Photinus, and their good service in withstanding the {300} Anomœans, who arrived at the same humanitarianism by a bolder course of thought, will presently be mentioned. On the whole they were men of correct and exemplary life, and earnest according to their views; and they even made pretensions to sanctity in their outward deportment, in which they differed from the true Eusebians, who, as far as the times allowed it, affected the manners and principles of the world. It may be added, that both Athanasius and Hilary, two of the most uncompromising supporters of the Catholic doctrine, speak favourably of them. Athanasius does not hesitate to call them brothers [Note 7]; considering that, however necessary it was for the edification of the Church at large, that the Homoüsion should be enforced on the clergy, yet that the privileges of private Christian fellowship were not to be denied to those, who from one cause or other stumbled at the use of it [Note 8]. It is remarkable, that the Semi-Arians, on the contrary, in their most celebrated Synod (at Ancyra, A.D. 358) anathematized the holders of the Homoüsion, as if crypto-Sabellians [Note 9].\"\n\n[http://www.newmanreader.org/works/arians/chapter4-2.html]\n\n- Cardinal John Henry Newman\n\n\n\nWhat is a Semi-Modernist and could Fr. Thomas Weinandy be a Semi-Modernist in recently promoting the Francis agenda?\n\nWhy were the conservative Vatican II popes and why are almost all the conservative present day bishops and conservative Catholics so afraid of a schism with the Modernist heretic faction?\n\n\n\nMight it be because like in the Arian crisis when there were Arians and Semi-Arians so today there are Semi-Modernists who because of \"weakness\" don't want schism and want communion with the total Modernist heretics?\n\n\n\nRemember what Cardinal Newman said:\n\n\n\n\"Athanasius, however, proposed more temperate measures... A decree was passed, that such [Semi-Arian] bishops as had communicated with the Arians through weakness or surprise, should be recognized in their respective sees, on signing the Nicene formulary; but that those, who publicly defended the heresy, should only be admitted to lay-communion.\"\n\n\n\nSemi-Arians were those who attempted the practically almost impossible task of being loyal to the traditional teachings of the Church while holding on to Semi-Arian ambiguous teachings because they were afraid of being in schism with the total Arian heretics who were supported and protected by the Roman government.\n\n\n\nSo today, it appears that most conservative Catholics like the Semi-Arians have tried to do the practically almost impossible task of being loyal to the infallible teachings of the Church while holding on to Semi-Modernist ambiguous teachings as well as the ambiguities of Vatican II because they are afraid of being in schism with the Modernist heretics.\n\n\n\nNewman said that during the Arian Heresy Crisis 80% of the bishops were Arians or semi-Arains which is probably similar to the number of bishops who today have fallen into Modernism or Semi-Modernism.\n\n\n\nFrancis's closest adviser and collaborator Cardinal Oscar Rodriguez Maradiaga apparently declared himself, Francis and all liberals to be total Modernist heretics since Vatican II:\n\n\n\n\"The Second Vatican Council... meant an end to the hostilities between the Church and Modernism... Modernism was, most of the time, a reaction against injustices and abuses that disparaged the dignity and rights of the person.\"\n\n(Whispers in the Loggia Website, \"The Council's 'Unfinished Business,' The Church's 'Return to Jesus\"... and Dreams of \"The Next Pope\" - A Southern Weekend with Francis' 'Discovery Channel,'\" October 28, 2013)\n\n\n\nThe journalist conservative Catholic Milo Yiannopoulos in his book \"Diabolical\" reported:\n\n\n\n\"Since Vatican II, most popes have been preoccupied with holding together the conservative [Semi-Modernist] and liberal [Modernist heretic] factions that emerged in its wake.\"\n\nAgain, I say during the Arian crisis, Semi-Arians were those who attempted the practically almost impossible task of being loyal to the traditional teachings of the Church while holding on to Semi-Arian ambiguous teachings because they were afraid of being in schism with the total Arian heretics.\n\n\n\nSo today, it appears that most conservative Catholics like the Semi-Arians have tried to do the practically almost impossible task of being loyal to the infallible teachings of the Church while holding on to Semi-Modernist ambiguous teachings as well as the ambiguities of Vatican II because they are afraid of being in schism with the Modernist heretics.\n\nMight it be because like in the Arian crisis when there were Arians and Semi-Arians so today there are Semi-Modernists who because of \"weakness\" don't want schism and want communion with the total Modernist heretics?\n\n\n\nIf Francis is a Modernist then, might the conservative Fr. Thomas Weinandy possibly hold Semi-Modernist and Semi-Arian opinions?\n\nThis Project MUSE theological article seems to present the case that Weinandy might possibly hold Semi-Arian poistions:\n\nThis article responds to Thomas Weinandy's account of the consciousness and knowledge of Christ. Deserving of careful consideration, his is a rich and multifaceted proposal on a difficult and complex topic. Some of the complexity is theological in nature, not all of which I will be able to avoid in my response. Still, this response is meant to be primarily philosophical in nature. And it appears that there are two kinds of philosophical presuppositions that typically go unacknowledged in discussions of this topic. One concerns theories of personhood and self-consciousness. The other has to do with the \"principle of perfection,\" a \"principle of fittingness\"—or what Thomas Weinandy calls \"the false presupposition\" of Thomas Aquinas's Christology. To my mind, both are philosophical presuppositions, but the first (on personhood and self-consciousness) fits the theme of this volume more closely, and so it will be the topic of this response.\n\nPerson versus I—The Trinity\n\nWeinandy's proposal regarding the human consciousness of Christ seems peculiar if not unique in that it suggests that in Christ there is no divine I, but only a human I. In fact, in this proposal none of the divine persons has an I—though I am not sure the suggestion is that they share a common [End Page 425] I.2 Thus Christ would be a divine person without a divine I. The personal pronoun I would be connected with a human nature as self-conscious, rather than with the divine person in which this nature subsists.\n\n[... ]\n\n\n\nI do not currently see any philosophical objections to this suggestion regarding the Trinity. But neither do I see what would force us to make this assumption. By contrast, Reginald Garrigou-Lagrange, for example, would hold that there are three intelligent and free subjects in God.4 And [End Page 426] indeed, though the three persons are distinct from each other, each is not \"really\" distinct from the divine essence, and we would therefore expect each person to have all the properties that the essence has. The persons are distinct only by their proper relationality with each other. And this relationality consists in the way in which each person passes on the whole and entire essence to the other.5 Thus the Son has the whole essence as received from the Father; he has the essence in a filial way. He has the divine will in a filial manner, and the divine mind as \"conceived\" or in the form of a concept, word, or logos. If therefore self-consciousness is a property of the divine essence—for God is Spirit—and if persons are beings that have a nature or essence, then each of the divine persons has this one divine essence and the property of self.\" [https://muse.jhu.edu/article/735101]\n\nIt appears that the Sedevacantist friendly website, aka Catholic, may be making a big deal for their cause about the apparent Semi-Modernist and possible Arian Fr. Weinandy jumping on board with Francis's \"Synodal Path to a Synodal Church\":\n\nBased on his 2017 letter to Jorge, it appeared that he had at least some semblance of Catholic faith coursing through his veins. Did someone spike the Capuchin’s cappuccino? Was he blackmailed? Did Jorge’s operatives threaten to shoot his puppy?\n\nWhile any and all of these things are possible given the level of evil presently dwelling in occupied Rome, the real answer is far more obvious:\n\n\n\nWeinandy is just another man of the Council. As such, whenever or wherever his words or deeds give the appearance of orthodoxy, it is just this, mere appearance. In reality, he, like the rest of his conciliar con freres, is tainted with more than a little leaven of error. They belong to a counterfeit church. As the Baltimore Catechism states:\n\n“If any Catholic denies only one article of faith, though he believes all the rest, he ceases to be a Catholic, and is cut off from the Church” (see Q. 129, 1945 edition, p. 142).\n\nConsider Weinandy’s passionate praise for the Almighty Council and its abundant fruit published just last year:\n\n– “Without Vatican II, it would be hard to imagine Karol Wojtyla being elected Pope.” [https://akacatholic.com/what-happened-to-stompin-tom-weinandy/]\n\nBefore we move to the next point that Sedevacantists and Francis Traditionalists like Steve Skojec are in agreement that Francis and Benedict as well as John Paul II are the same, let's look at the problems with Sedevacantism.\n\nNumber one is Vatican I.\n\nAre they prepared to deny Vatican I?\n\n\n\nVatican I clearly teaches that popes will reign perpetually:\n\n\n\n\"[T]he true doctrine concerning the establishment, the perpetuity, and the nature of the apostolic primacy. In this primacy, all the efficacy and all the strength of the Church are placed. (Vatican I, Pastor Aeternus, chapter 1)\" (UnamSanctumCatholicm.com, \"False Principles of Sedevantism (Part 1)).\n\nBr. Alexis Bugnolo explains some other problems with them:\n\n\n\nSedevacantists hold in general that there have been no true popes since Pius XII. They accept the error of Luther that there is no authority or unity in the Church except that which is given the individual by the virtue of Faith. Thus, holding themselves as purer than all others, after the manner of Jansenists, they judge nearly everyone a heretic and thus outside of the Church. Their special target is all who hold an office which comes down through Apostolic Succession, because that is the real threat to their error and their egos.\" [https://fromrome.info/2020/01/19/flagship-of-sedes-presages-ppbxvi-movement-victory-in-2020/]\n\nGetting back to the Sedevacantist and Francis Traditionalists like Skojec thinking Francis and Benedict as well as John Paul II are the same.\n\n\n\nThe Remnant and Skojec are right in saying that the Vatican II's ambiguities which were a forerunner of Amoris Laetitia's ambiguity lead to the problems within the Church and outside including false ecumenism.\n\n\n\nStrangely, the non-traditionalist conservative Matthew Schmitz put it best:\n\n\n\n\"[T]he post-Vatican II settlement [of]... Upholding Catholic teaching on paper but not in reality as led to widespread corruption... a culture of lies... that allowed men like McCarrick to flourish.\"\n\n\n\nIt allowed the Church of Pope John Paul II and Pope Benedict XVI to keep heretics and homosexual predators in the hierarchy such as McCarrick and others like him to flourish and to promote neo-sacrilegious media productions such as the Assisi fiasco and the kissing of the Koran.\n\n\n\nThis was wrong and God will judge them for their failures to be good fathers (popes) in allowing evil men into God's Church to abuse and to lead many to indifferentism and away from salvation which is only in Jesus through His Church.\n\n\n\nBoth sincerely in my opinion because of false philosophical personal ideas while not totally abandoning Thomism tried to do the practically almost impossible task of being loyal to the infallible teachings of the Church while holding on to neo-modernist Personalist versions of Kantian and Hegelian philosophy as well as the ambiguities of Vatican II.\n\n\n\nBenedict if you read his later writings finally rejected Kantianism, but apparently couldn't completely give up Hegelianism.\n\n\n\nHowever, he realized in a vague way that the ambiguity of Vatican II was destroying the Church so he brought back the Traditional Latin Mass and attempted to fight against sex abuse, the Vatican gay lobby and reform the finances to the Church.\n\n\n\nUnfortunately, in my opinion, these efforts united the financially corrupt old guard of Cardinal Angelo Sodano and the Vatican gay lobby which brought about Vatileaks and other pressures against Benedict that eventually lead to the Benedict resignation and the papacy of Jorge Bergoglio whose pontifical validity has been questioned by many even in the hierarchy from the beginning to this day.\n\n\n\nAs Bishop René Gracida has said there was never universal acceptance of Bergoglio by the Church.\n\n\n\nBut even more importantly, there are reasonable doubts about the validity of Benedict's resignation and Bergoglio's lawful election to the papacy which were never present with the other papacies which Bishop Gracida declares must be investigated and interpreted by the cardinals as John Paul's conclave constitution explicitly states.\n\n\n\nThis is one reason that Francis is not the same as Benedict and John Paul.\n\n\n\nThe other reason that The Remnant and Skojec are wrong about saying Francis is the same as Benedict and John Paul can be put simply in analogy:\n\n\n\nJohn Paul and Benedict were sincere doctors with medicine that was getting the patient sicker.\n\n\n\nBenedict realized the medicine was bad and slowly started giving good medicine.\n\n\n\nBut in my opinion, Francis is a doctor who is trying to kill the patient by slow poisoning.\n\n\n\nIn my opinion, it is obvious that Francis doesn't have even a remnant of Thomism. Nor does he apparently care about being loyal to the infallible Church teachings. He appears to be a nihilistic postmodernist like his favorite theologian Michel de Certeau.\n\n\n\nFrancis's only grasp of reality or meaning appears to be leftist and Peronist ideology as well as his close friend the kissing bishop's Bernard Haring Hegelian situation ethics all dressed in religious language.\n\n\n\nWhile Benedict and John Paul upheld Church teachings on paper while not always in reality, Francis with Amoris Laetitia, the Argentine letter, the death penalty Catechism change and the latest indifferentism papal statement isn't even upholding the infallible teachings on paper.\n\n\n\nGeorge Gilder wrote a book called \"Sexual Suicide\" which helped me return to the Church because it showed that the Catholic teachings on sexuality were true and those outside those teachings were committing slow suicide.\n\n\n\nFrancis in my opinion is trying to kill the Church by slow suicide.\n\n\n\nHe will not succeed because Jesus promised the gates of Hell will not prevail.\n\n\n\nThose who don't oppose him in my opinion are his accomplices unless they are in invincible ignorance.\n\n\n\nIn my opinion, it appears that if Francis doesn't convert he may be heading down a path of destruction along with all his accomplices if they don't convert if they aren't in invincible ignorance.\n\n\n\nI feel sorry for them.\n\n\n\nWe must pray for him and his accomplices, but most of all we must pray for all those abused and lead away from salvation by their promotion of heresy.\n\nPray an Our Father now for reparation for the sins committed because of Francis’s Amoris Laetitia.\n\nPray an Our Father now for the restoration of the Church as well as the Triumph of the Kingdom of the Sacred Heart and the Immaculate Heart of Mary.\n\nStop for a moment of silence, ask Jesus Christ what He wants you to do now and next. In this silence remember God, Father, Son and Holy Ghost – Three Divine Persons yet One God, has an ordered universe where you can know truth and falsehood as well as never forget that He wants you to have eternal happiness with Him as his son or daughter by grace. Make this a practice. By doing this you are doing more good than reading anything here or anywhere else on the Internet.\n\nFrancis Notes:\n\n– Doctor of the Church St. Francis de Sales totally confirmed beyond any doubt the possibility of a heretical pope and what must be done by the Church in such a situation:\n\n\n\n“[T]he Pope… WHEN he is EXPLICITLY a heretic, he falls ipso facto from his dignity and out of the Church, and the Church MUST either deprive him, or, as some say, declare him deprived, of his Apostolic See.”\n\n(The Catholic Controversy, by St. Francis de Sales, Pages 305-306)\n\n\n\nSaint Robert Bellarmine, also, said “the Pope heretic is not deposed ipso facto, but must be declared deposed by the Church.”\n\n[https://archive.org/stream/SilveiraImplicationsOfNewMissaeAndHereticPopes/Silveira%20Implications%20of%20New%20Missae%20and%20Heretic%20Popes_djvu.txt]\n\n– “If Francis is a Heretic, What should Canonically happen to him?”: http://www.thecatholicmonitor.com/2020/12/if-francis-is-heretic-what-should.html\n\n– “Could Francis be a Antipope even though the Majority of Cardinals claim he is Pope?”: http://www.thecatholicmonitor.com/2019/03/could-francis-be-antipope-even-though.html\n\n– If Francis betrays Benedict XVI & the”Roman Rite Communities” like he betrayed the Chinese Catholics we must respond like St. Athanasius, the Saintly English Bishop Robert Grosseteste & “Eminent Canonists and Theologians” by “Resist[ing]” him: https://www.thecatholicmonitor.com/2021/12/if-francis-betrays-benedict-xvi.html\n\n– LifeSiteNews, “Confusion explodes as Pope Francis throws magisterial weight behind communion for adulterers,” December 4, 2017:\n\n\n\nThe AAS guidelines explicitly allows “sexually active adulterous couples facing ‘complex circumstances’ to ‘access the sacraments of Reconciliation and the Eucharist.'”\n\n\n\n– On February 2018, in Rorate Caeli, Catholic theologian Dr. John Lamont:\n\n\n\n“The AAS statement… establishes that Pope Francis in Amoris Laetitia has affirmed propositions that are heretical in the strict sense.”\n\n\n\n– On December 2, 2017, Bishop Rene Gracida:\n\n\n\n“Francis’ heterodoxy is now official. He has published his letter to the Argentina bishops in Acta Apostlica Series making those letters magisterial documents.”\n\n\n\nPray an Our Father now for the restoration of the Church by the bishops by the grace of God.\n\nElection Notes:\n\n– Intel Cryptanalyst-Mathematician on Biden Steal: “212Million Registered Voters & 66.2% Voting,140.344 M Voted…Trump got 74 M, that leaves only 66.344 M for Biden” [http://catholicmonitor.blogspot.com/2020/12/intel-cryptanalyst-mathematician-on.html?m=1]\n\n– Will US be Venezuela?: Ex-CIA Official told Epoch Times “Chávez started to Focus on [Smartmatic] Voting Machines to Ensure Victory as early as 2003”: http://catholicmonitor.blogspot.com/2020/12/will-us-be-venezuela-ex-cia-official.html\n\n– Tucker Carlson’s Conservatism Inc. Biden Steal Betrayal is explained by “One of the Greatest Columns ever Written” according to Rush: http://catholicmonitor.blogspot.com/2021/01/tucker-carlsons-conservatism-inc-biden.html?m=1\n\n– A Hour which will Live in Infamy: 10:01pm November 3, 2020:\n\nhttp://www.thecatholicmonitor.com/2021/01/a-hour-which-will-live-in-infamy-1001pm.html?m=1\n\nWhat is needed right now to save America from those who would destroy our God given rights is to pray at home or in church and if called to even go to outdoor prayer rallies in every town and city across the United States for God to pour out His grace on our country to save us from those who would use a Reichstag Fire-like incident to destroy our civil liberties. [Is the DC Capitol Incident Comparable to the Nazi Reichstag Fire Incident where the German People Lost their Civil Liberties?: http://catholicmonitor.blogspot.com/2021/01/is-dc-capital-incident-comparable-to.html?m=1 and Epoch Times Show Crossroads on Capitol Incident: “Anitfa ‘Agent Provocateurs‘”:\n\nhttp://catholicmonitor.blogspot.com/2021/01/epoch-times-show-crossroads-on-capital.html?m=1]\n\nPray an Our Father now for the grace to know God’s Will and to do it.\n\nPray an Our Father now for America.\n\nPray an Our Father now for the restoration of the Church as well as the Triumph of the Kingdom of the Sacred Heart and the Immaculate Heart of Mary.",
    "title": "Flashback: Is it like in the Arian Crisis with the Arians & Semi-Arians where there are Semi-Modernists [Francis Trads like Skojec & maybe T. Marshall] who because of \"Weakness\" don't want Schism with the total Modernist Heretics like Francis?",
    "date": "2024-03-20T06:39:00.000+02:00",
    "url": "https://www.thecatholicmonitor.com/2024/03/flashback-is-it-like-in-arian-crisis.html",
    "author": "Fred Martinez (noreply@blogger.com)"
}