{
    "text": "The legal team for former president Donald Trump on Tuesday asked the Supreme Court to grant presidents absolute immunity from criminal charges stemming from actions committed while in office. File Photo by John Angelillo/UPI | License Photo\n\nMarch 19 (UPI) — Former President Donald Trump called on the Supreme Court on Tuesday to rule that he has “absolute immunity” from charges stemming from his alleged efforts to overturn the 2020 general election. “The president cannot function, and the presidency itself cannot retain its vital independence, if the president faces criminal prosecution for official acts once he leaves office,” Trump’s legal team argued in its filing.\n\nThe former president and New York real estate mogul was indicted in August on four charges alleging he participated in a scheme aimed at keeping him in the White House despite losing the 2020 general election to then-Democratic candidate and current President Joe Biden.\n\nHis attorneys have repeatedly argued Trump is shielded from prosecution for actions that occurred during his presidency — a stance that a three-judge appeals panel early last month soundly rejected.\n\nThe conservative-leaning Supreme Court has agreed to consider the case and has set an expedited start date of April 25 for the argument.\n\nIn the filing on Tuesday, Trump’s legal team warned the justices that a denial of criminal immunity would “incapacitate every future president with de facto blackmail and extortion” while condemning them “to years of post-officer trauma at the hands of political opponents.”\n\n“The threat of future prosecution and imprisonment would become a political cudgel to influence the most sensitive and controversial presidential decisions,” Trump’s legal team argued, “taking away the strength, authority and decisiveness of the presidency.”\n\nThe former president’s lawyers cite as precedence a Supreme Court decision involving former President Richard Nixon that found presidents enjoyed absolute immunity for civil damages that arise from acts within the “outer perimeter” of their official duties.\n\nThey continue that if the Supreme Court doesn’t dismiss the charges and that some sort of immunity does exist, it should remand the case to lower courts to consider, which would further delay the start of the case.\n\nTrump’s trial was set to begin on March 4.\n\nTrump’s legal team has repeatedly sought to delay his trials, in an action that could see decisions coming down after November’s presidential election. Trump is the presumed Republican candidate, and if re-elected president, he could direct the Justice Department to dissolve all federal cases against him.\n\nSpecial counsel Jack Smith, who filed the four-count indictment in August, has repeatedly argued against both the strategy to delay the start of Trump’s trial and his stance on absolute immunity.\n\nIn a filing from early last month, Smith said the charges filed against the former president “strike at the heart of our democracy.”\n\n“A president’s alleged criminal scheme to overturn an election and thwart the peaceful transfer of power to his successor should be the last place to recognize a novel form of absolute immunity from federal criminal law,” Smith wrote.",
    "title": "Trump presses Supreme Court for 'absolute immunity' from election charges - Tech Jaun",
    "date": "2024-03-20T05:45:00.000+02:00",
    "url": "https://techjaun.com/trump-presses-supreme-court-for-absolute-immunity-from-election-charges",
    "author": "WEB DESK"
}