{
    "text": "Washington D.C.’s hottest club is at the Capitol Building, where some of the most important people in the nation are mingling, and will be followed by an hour-long talk by the most important man in the United States, Joe Biden. Biden, in his 2024 State of The Union Address, gave a speech that surpassed the expectations of many. The president, now 81 (going on 82 this November), gave a speech that was full of life. However, any error in speech or minor-slip by Biden was more than welcome for the Republican Party, who are seeking to defeat Biden in this November election. This State of the Union was not only about the present but sparked conversations about the potential next four years in Biden’s America.\n\nAs the speech began, President Biden detailed the importance of this moment in American history. He described unprecedented conflicts, like the war in Ukraine and the notion that not “since President Lincoln and the Civil War have freedom and democracy been under assault [in the United States] as they are today.” The speech continued, further touting the progress America has made in international relations. Such as Sweden joining NATO earlier in March. However, the internal conflicts within America took the forefront. Biden began refuting elements of Trump’s history, calling the January 6 insurrection the gravest threat to American democracy since the Civil War.\n\n\n\n“America’s comeback is building a future of American possibilities… investing in all of America, in all Americans to make … sure everyone has a fair shot, and we leave no one — no one behind,” Biden said. The President further echoed his desire for a great American rise in prosperity. His focus was primarily on populist points, such as lowering the cost of prescription drugs for many Americans in the aspirations of tackling corporate greed. A similar plan to Biden’s aspirations is to cut taxes for the middle class, at the expense of high-earning people and companies who, according to Biden, will begin to pay their fair share of taxes in his administration. Moreover, the overall positive framing of the American comeback in the alleged post-COVID era, some of Bidens claims about these tax cuts and tax enforcement for high earners could be deemed misleading. Due to the nature of the American tax system, only 14 of the 55 biggest earning companies will be applicable to this aim by the administration. This can be attributed to the “book-income” nature of the policy.\n\nHowever, the biggest pivot from typical Democratic party talking points was the result of a brief encounter the President had with representative Marjorie Taylor Greene. Moments before the State of the Union began Greene was seen handing Biden a pin. Later in the night, as the speech progressed, the topic of the US-Mexico border came up and Biden made his biggest error of the night. Greene called out to Biden in the middle of his talk, asking “what about Laken Riley?” Riley was a 22-year-old student at Augusta University who was tragically killed this past February, with the accused suspect being an illegal immigrant from Venezuela. As Greene beckoned Biden to recognize Riley, Biden held up a pin that read ‘Say Her Name, Laken Riley’ and said: “Lanken — Lanken Riley, an innocent young woman who was killed.” Greene quickly retorted, “by an illegal!” Biden responded, “by an illegal. That’s right. But how many thousands of people are being killed by legals?” The term “illegal” has been out of the Democratic vocabulary for a while now. Biden described the accused as “illegal” despite his continued claim that he “will not demonize immigrants by saying they are ‘poison in the blood of our country,’” the latter half of the statement derived from former president Trump.\n\nAlthough the State of The Union speeches are typically symbolic, this speech indicates the potential for Biden to take back the reins within the polls and to show the public that although he is old, he is not too old to hang onto old beliefs and reactionary framing.",
    "title": "President Joe Biden Speaks! - The Argosy",
    "date": "2024-03-20T02:00:00.000+02:00",
    "url": "https://www.since1872.ca/news/president-joe-biden-speaks",
    "author": "@The_Argosy"
}