{
    "text": "A few days after former South Carolina Gov. Nikki Haley dropped out of the Republican presidential primary on March 6, veteran media executive and Haley backer Harry Sloan got a call from movie mogul Jeffrey Katzenberg, who asked Sloan to help President Joe Biden take on Donald Trump in the general election.\n\nSloan agreed to help raise money for Biden’s reelection effort and try to reel in Republican-aligned business leaders to get behind the president, he told CNBC in a recent interview.\n\n“People I know who are generally business Republicans, they’re going to hear from me” about helping Biden, Sloan said. The former chair of MGM said he has already reached out to some of the people in his Rolodex, and he plans to host a fundraiser for Biden later this year.\n\nSloan is among at least half a dozen former Haley bundlers who have decided to help Biden — and not Trump — since Haley ended her campaign, according to a source familiar with the effort, who was granted anonymity to discuss private conversations.\n\nA co-chair of the Biden campaign, Katzenberg has been trying to recruit wealthy Haley supporters into Biden’s camp since at least February.\n\nBut now, with Haley formally out of the race, that effort has gone into overdrive.\n\nSloan and other Haley supporters have also heard from the Biden campaign’s finance chair, Rufus Gifford, who said he belongs to a WhatsApp group called “Haley Supporters for Biden.”\n\nFor Biden’s team, successfully snagging Republican former Haley donors would amount to a fundraising coup, bolstering the president’s political operation while taking these potential donors off the field for Trump.\n\nThe effort to win over Haley donors also got a boost when Trump threatened to blacklist Haley donors.\n\n“Anybody that makes a ‘Contribution’ to [Haley] from this moment forth, will be permanently barred from the MAGA camp. We don’t want them, and will not accept them,” he wrote on Truth Social on Jan. 24.\n\nHaley notably did not endorse Trump when she dropped out of the race.\n\nSloan himself is a major addition to Biden’s fundraising arsenal. While Haley was still in the primary, Sloan helped to raise at least $550,000 for her White House bid, most of it through two fundraising receptions, including one at his home in Los Angeles.\n\nBut Sloan is not a straight party-line donor. He has donated in the past to candidates on both sides of the aisle, including $100,000 last year to a pro-Biden political action committee, Future Forward, and a separate donation to Biden’s campaign.\n\nSloan also gave $100,000 to a PAC that supported Haley, according to Federal Election Commission records. Another Republican who received a donation from Sloan is Pennsylvania GOP Senate candidate Dave McCormick.\n\nThe never Trump wing\n\nBarbara Comstock, a former Virginia Republican congresswoman who was co-chair of Haley’s campaign, is also working against the Trump candidacy.\n\n“I support the Republican Voters Against Trump efforts. I also support Republicans for Ukraine,” Comstock told CNBC in an email. “Still figuring out what other things would be most helpful.”\n\nComstock said that if she chooses to include fundraising in her efforts, Republican Voters Against Trump does operate through a super PAC called Republican Accountability.\n\nThe super PAC recently announced plans to launch a $50 million general election effort to defeat Trump.\n\nThe project will feature videos of former Trump voters explaining why they won’t back him again in 2024. The clips and quotes will appear on television, radio, billboard and digital ads targeting voters in the battleground states of Arizona, Georgia, Michigan, Nevada, Pennsylvania and Wisconsin.\n\nThe super PAC is largely funded by anti-Trump donors. LinkedIn co-founder and Democratic megadonor Reid Hoffman contributed $4 million last year to the group, according to campaign finance records. Hoffman also donated $250,000 to a pro-Haley PAC.\n\nHoffman has donated at least $2 million more to the Republican Accountability PAC so far this year, his political advisor Dmitri Mehlhorn told CNBC.\n\nRepublican Accountability also received $2 million in 2023 from Defending Democracy Together, a political nonprofit led by Bill Kristol, an outspoken critic of Trump’s and a former aide in the Reagan administration.\n\nShare this: Twitter\n\nFacebook\n\n\n\nLike this: Like Loading...",
    "title": "Nikki Haley Fundraisers Now Backing Biden?",
    "date": "2024-03-20T17:24:00.000+02:00",
    "url": "https://nextgennews.org/2024/03/20/nikki-haley-fundraisers-now-backing-biden",
    "author": "Next Gen News Team"
}