{
    "text": "Topline\n\nHunter Biden’s ex-business partner, Tony Bobulinski, a primary witness in the GOP-led impeachment probe into President Joe Biden, accused Democrats of lying to the media in an explosive House Oversight Committee hearing Wednesday—widely viewed as a last-ditch effort in the inquiry as Republicans have begun to acknowledge it appears to be coming to a close.\n\nKey Facts\n\nIn his opening statement before the committee, Bobulinski accused Rep. Jamie Raskin, D-Md., and Rep. Dan Goldman, D-N.Y., of lying to the media. He also alleged Hunter Biden’s attorney, Abbe Lowell, has tried to “smear” him, while defending what he described as a “successful business career” following his time in the Navy. Raskin jumped in, asking Oversight Chair Rep. James Comer, R-Ky., if Bobulinski was subject to decorum rules, while Rep. Jared Moskowitz, D-Fla., reportedly shouted “keep going, you fool!” Bobulinski, who worked briefly with Hunter Biden in 2017 on a company called Sinohawk, has claimed to possess evidence showing the president profited from his son’s business deals in China, including a widely cited email that allegedly references “10% held by H for the big guy,” which Bobulinski has repeated claimed is a reference to the president. Bobulinski’s claims have never been verified, however, and multiple other witnesses have told the committee the president was not involved in his son’s business ventures.\n\nTangent\n\nMoskowitz wore a Vladimir Putin mask around the Capitol before the hearing to mock Republicans for spreading allegations about the Bidens that reportedly stem from Russian disinformation.\n\nChief Critic\n\nRaskin accused Bobulinski of making “hazy allegations against the Bidens for the first time at a press conference choreographed by the Trump for President campaign,” he said in his opening statement, referring to the 2020 press conference in which Bobulinski initially aired the allegations. Referencing the possibility that the GOP could make criminal referrals to the Justice Department based on their findings, Raskin said “criminal referrals require evidence of crime . . . and the only crimes we have seen are those of the GOP’s own star witnesses alike,” he said, referencing Alexander Smirnov, who claimed Biden and his son were involved in a bribery scheme and was recently indicted by the FBI for allegedly lying to the agency.\n\nKey Background\n\nBobulinski testified before the committee alongside former Hunter Biden business partner Jason Galanis and former Rudy Giuliani associate Lev Parnas. The committee also requested Hunter Biden’s appearance, but he declined to participate, with Lowell calling the hearing in a letter to Comer “an obvious attempt to throw a Hail Mary pass after the game has ended.” The hearing comes as a growing number of Republicans have openly acknowledged the probe is unlikely to result in a formal impeachment of the president as it has not produced any evidence showing the president was directly involved in, or financially benefited, from business deals involving his son or other family members.\n\nContra\n\nParnas in his testimony before the committee repeated his claims that any damning information about the Bidens was the product of Russian disinformation, telling lawmakers “every person integral to this shadow diplomacy knew that the Biden corruption rumors were baseless,” he said, accusing Fox News anchors and Trump allies, former Rep. Devin Nunes, R-Calif., and Sen. Ron Johnson, R-Wisc., of “pushing a false narrative.” Parnas, who was enlisted by Giuliani to dig up dirt on Biden in Ukraine ahead of the 2020 election, was later convicted of fraud and campaign finance violations for funneling money into the 2018 midterms to help a Russian national gain interest in the cannabis industry.\n\nRead More",
    "title": "‘Lies’: Biden Impeachment Hearing Turns Fiery As Ex-Hunter Biden Business Partner Testifies - shareandstocks.com",
    "date": "2024-03-20T19:15:00.000+02:00",
    "url": "https://www.shareandstocks.com/lies-biden-impeachment-hearing-turns-fiery-as-ex-hunter-biden-business-partner-testifies",
    "author": "ShareandStocks com"
}