{
    "text": "The Biden administration faces increasing backlash over new legislation that will re-classify gig workers as employees.\n\nThe Labor Department’s (DOL) new Independent Contractor Rule can into effect on March 11. It imposes six criteria that employers must consider when deeming whether to classify a worker as an independent ‘gig’ contractor or an employee.\n\nThe new rule makes it more difficult for employers to classify workers as independent contractors, which is likely to have a significant impact on industries that rely heavily on gig workers, such as ride hailing, food delivery and creative services.\n\nAccording to Statista data, as of February 2024 there were 76.4 million freelance workers in the US. Turning a sizeable amount of the millions on independent contractors into unionized employees would help President Joe Biden achieve his promise of being “the most pro-union president in American history.”\n\nBut the new law has been criticized by gig workers, small business advocates, trade groups, and lawmakers. They liken it to the controversial rule in California, which governs gig work and that came into effect on January 1, 2020. The law, known was Assembly Bill 5 (AB5), require many businesses to treat gig workers as employees.\n\nUnder the rule, the number of articles freelance journalists can be paid for are capped. However, following an outcry by gig workers, the legislature in California passed over 100 exemptions for industries that were being impacted by the law.\n\nAt least five lawsuits have been filed against the Biden administration to stop the new Independent Contactor Rule. The US Chamber of Commerce is one of the latest groups challenging the law.\n\nBut the DOL argues that the legislation helps protects workers’ rights and offers more consistency through the Fair Labor Standards Act. More Perfect Union, the union-friendly organization, support the rule, arguing that the forthcoming legislation will result in higher wages and overtime pay for millions of workers in gig jobs.\n\nHowever, workers continue to prioritize the flexibility and autonomy that contracted employment models provide, as a Harvard Business Review study found.\n\nKaren Anderson, founder of the Freelancers Against AB5, described the rule as ‘disruptive and cruel.’\n\n“Within our membership, we’ve identified more than 600 categories of professions affected by this destructive, disruptive and cruel law,” she said.",
    "title": "Biden Administration Faces Backlash Over Gig Worker Legislation",
    "date": "2024-03-21T08:00:00.000+02:00",
    "url": "https://projin.co.kr/biden-administration-faces-backlash-over-gig-worker-legislation",
    "author": "PROJIN"
}