{
    "text": "FPI\n\nMarch 21, 2024\n\nHoly Hunter Biden Hearing. This is beautiful. Tony Bobulinski just called Jamie Raskin a liar to his face. Bobulinksi has cojones. Hearing goes off the rails.pic.twitter.com/grVqLSrqzi — Citizen Free Press (@CitizenFreePres) March 20, 2024\n\nTony Bobulinski causes AOC to have a TOTAL MELTDOWN after saying Joe Biden committed crimes 🤣 pic.twitter.com/RxkkZG8LEw — Benny Johnson (@bennyjohnson) March 20, 2024\n\n🚨 NEVER BEFORE SEEN FOOTAGE 🚨 They were selling “The Brand.” And “The Brand” was Joe Biden. pic.twitter.com/ksFsSZptYq — House Judiciary GOP (@JudiciaryGOP) March 19, 2024\n\nTony Bobulinski had Democrats fuming on Wednesday as he testified before the House Oversight Committee's impeachment inquiry that his former business partner Hunter Biden perjured himself in closed door testimony last month and that Joe Biden was most definitely involved in the family's business dealings.Bobulinski provided examples to support his claim of perjury during his opening statement:In the first example, Bobulinski questioned the timing of when Hunter Biden began to work with CEFC China Energy Co., a firm with close ties to the Chinese Communist Party (CCP):\"In Hunter’s transcript (Page 42), he states, “I officially began to do work for CEFC when the – when I received a retainer from CEFC in early – or spring of 2017”. Why, then, did Hunter yell at CEFC Executive Director Zang in front of his entourage as I sat right next to him in New York City on Sunday May 7th, 2017? Hunter was adamant that he was owed the rest of the $20 Million CEFC had committed to paying for the work he had claimed he had done in prior years.\"In the second instance, Bobulinski argued that Hunter Biden lied when he claimed that Joe Biden never interacted with Hunter’s associates:\"On Page 48 of his transcript, Hunter is asked, 'He’s never interacted with any of your business associates. Is that correct?' The 'He’s' is a reference to Joe Biden. Hunter responds, 'Yes'. Hunter arranged the meeting between his father and me at the Beverly Hilton in Los Angeles on May 2, 2017. The sole reason Hunter wanted me to meet his father was because I was the CEO of Sinohawk, the Bidens’ partnership with CEFC. I was a business associate. In his transcript, Hunter confirms that that meeting with Joe took place and incriminates his Uncle Jim for perjury by confirming it.\"In the third example, Bobulinski said Hunter “lied” about leveraging Joe Biden to receive a $5 million payment from CEFC:\"Hunter lied to the Committee about important details concerning his money demands and threats to CEFC on July 30 and July 31, 2017. He leveraged his father’s presence next to him in that infamous text in order to strong-arm CEFC into paying Hunter immediately and in the process defrauded the partners of Sinohawk Holdings LLC and Oneida Holdings LLC. The threat worked, as a few days later the Chinese wired $5 million dollars into a company of which Hunter owned 50%. It’s important to remember that CEFC considered this money an interest-free loan to the 'Biden family,' and planned to send more. I have the email from CEFC to prove it.\"Bobulinski also said Joe Biden was “more than a participant in and beneficiary of his family’s business” but “was an active, aware enabler who met with business associates such as myself to further the business, despite being buffered by a complex scheme to maintain plausible deniability.”“If there is no evidence of corruption – if Joe’s conduct and the conduct of his family were fully legal and proper – then why are they so dishonest about it?” Bobulinski asked. “Not just slight misrepresentations of fact but deep untruths about the entire corrupt enterprise.”South Carolina Republican Rep. Nancy Mace fired off an intense round of \"yes or no\" questions aimed at Joe Biden's involvement in his son's business dealings.Mace directed her questions to Bobulinski and another ex-Hunter Biden business associate, Jason Galanis, asking them to verify various interactions with Biden, Hunter and the business associates concerning various deals and transactions.Those interactions included Joe Biden taking calls from Hunter where he updated his dad on certain business deals, confirming a reserved board seat for Joe Biden at a company, that Joe Biden lied when he denied meeting with Hunter's business partners, and that the family received money from Chinese business interests.Bobulinski and Galanis answered \"yes\" to each of Mace's questions.\"Joe Biden has repeatedly claimed that he was not involved in Hunter Biden's, Jim Biden's, or any other Biden family business deals. Today our witnesses have proved otherwise,\" Mace said at the conclusion of her questioning.Bobulinski also directly confronted two Democrat members of the Oversight Committee, accusing them of lying in the media about the impeachment inquiry. \"Representatives Dan Goldman and Jamie Raskin, both lawyers, and Mr. Goldman a former prosecutor with the Southern District of New York, will continue to lie today in this hearing and then go straight to the media to tell more lies,\" he said in his opening statement.\n\nYour Choice\n\nFree Press International\n\n[\n\nPublish This Content\n\n]",
    "title": "Tony Bobulinski testimony: Hunter Biden perjured himself",
    "date": "2024-03-21T18:02:00.000+02:00",
    "url": "http://freepressers.com/articles/tony-bobulinski-testimony-hunter-biden-perjured-himself",
    "author": "PSYCLONE MEDIA, INC"
}